GRC      TITLE 'HDKGRC           (CP)  VM370CE: VIRTUAL MACHINE/370 COMX00010000
               MUNITY EDITION'                                          00020000
         ISEQ  73,80          Validate sequence numbers                 00030000
**********************************************************************  00040000
*                                                                       00050000
* MODULE NAME -                                                         00060000
*                                                                       00070000
*        HDKGRC                                                         00080000
*                                                                       00090000
* FUNCTION -                                                            00100000
*                                                                       00110000
*        Build all of the Channel Programs needed to manage             00120000
*        local display devices. The CCWs and associated data            00130000
*        streams will be tailored to fit the device type and            00140000
*        screen geometry.                                               00150000
*                                                                       00160000
* ATTRIBUTES -                                                          00170000
*                                                                       00180000
*        Reenterable, resident                                          00190000
*                                                                       00200000
* ENTRY POINTS -                                                        00210000
*                                                                       00220000
*        DMKGRCCW - Prepare channel programs                            00230000
*        DMKGRCRL - Release CCW resources from IOBLOK                   00240000
*                                                                       00250000
**********************************************************************  00260000
         EJECT ,                                                        00270000
         COPY  OPTIONS                                                  00280000
         COPY  LOCAL                                                    00290000
         SPACE 3                                                        00300000
HDKGRC   CSECT ,                                                        00310000
         DC    CL8'HDKGRC'             Module Id                        00320000
         DC    AL2(MODEND-HDKGRC)      Module length                    00330000
         DC    C'&SYSDATE',C'-'        Compile date                     00340000
         DC    C'&SYSTIME'             Compile time                     00350000
         SPACE 3                                                        00360000
         USING PSA,0                                                    00370000
         USING TRQBLOK,R5                                               00380000
         USING CONTASK,R6                                               00390000
         USING RDEVBLOK,R8                                              00400000
         USING GRFXBLOK,R9                                              00410000
         USING IOBLOK,R10                                               00420000
         USING VMBLOK,R11                                               00430000
         USING SAVEAREA,R13                                             00440000
         SPACE 3                                                        00450000
         EXTRN DMKBOXDS,DMKBOXBX,DMKBOX80                               00460000
         EXTRN DMKCVT12,DMKCVT14                                        00470000
         EXTRN HDKG66CP                                                 00480000
         TITLE 'HDKGRC:HDKGRCCW  (CP)  VM370CE: VIRTUAL MACHINE/370 COMX00490000
               MUNITY EDITION'                                          00500000
***************************************************************         00510000
*                                                                       00520000
* METHOD NAME -                                                         00530000
*                                                                       00540000
*        HDKGRCCW                                                       00550000
*                                                                       00560000
* FUNCTION -                                                            00570000
*                                                                       00580000
*        Build a local display device channel program                   00590000
*        and its associated data stream.                                00600000
*                                                                       00610000
* ENTRY CONDITIONS -                                                    00620000
*                                                                       00630000
*        R0  = Index of channel program to be built                     00640000
*        R8  = Address of the RDEVBLOK                                  00650000
*        R10 = Address of the IOBLOK                                    00660000
*        R11 = Address of the user's VMBLOK                             00670000
*        R12 = Address of HDKGRCCW entry point                          00680000
*        R13 = Address of standard SAVEAREA                             00690000
*                                                                       00700000
* EXIT CONDITIONS -                                                     00710000
*                                                                       00720000
*        R15 = 0 : The RDEVBLOK has been initialized                    00730000
*                                                                       00740000
*        R15 = 4 : A Read Partition Query was issued.                   00750000
*                  Wait for the Attention interrupt that                00760000
*                  will be generated. A call to HDKGINRD                00770000
*                  needs to be made when that interrupt occurs.         00780000
*                                                                       00790000
*        R15 = 8 : An I/O error occurred while trying th                00800000
*                  initialize the display device.                       00810000
*                                                                       00820000
* NOTES -                                                               00830000
*                                                                       00840000
*        Local display device initialization is invoked                 00850000
*        when an unsolicited Device-End is detected for                 00860000
*        an enabled device or when an ENABLE command is                 00870000
*        issued for a disabled device                                   00880000
*                                                                       00890000
***************************************************************         00900000
         SPACE 3                                                        00910000
HDKGRCCW RELOC ,                                                        00920000
         SPACE 3                                                        00930000
*-------------------------------------------------------------          00940000
*        3066 gets its own happy place                                  00950000
*-------------------------------------------------------------          00960000
         SPACE 1                                                        00970000
         CLI   RDEVTYPE,TYP3066        Ship old 3066 stuff              00980000
         BNE   CCW327X                 ... off to buffalo               00990000
         GOTO  HDKG66CP                3066 CCWs in separate place      01000000
         SPACE 3                                                        01010000
*-------------------------------------------------------------          01020000
*        Generate 327x channel programs and data streams                01030000
*-------------------------------------------------------------          01040000
         SPACE 1                                                        01050000
CCW327X  DS    0H                                                       01060000
         LR    R2,R0                   Save input parameter             01070000
         L     R9,RDEVGRFX             Get GRFXBLOK addressability      01080000
*                                                                       01090000
         ICM   R7,15,IOBCCWRK          Get channel program addressing   01100000
         BNZ   ROUTCALL                have it already                  01110000
         LA    R0,GRFCCWLD             1st call.. allocate the storage  01120000
         CALL  DMKFREE                 ...                              01130000
         XC    0(GRFCCWLN,R1),0(R1)    Clear it out                     01140000
         ST    R1,IOBCCWRK             Chain it off the IOBLOK          01150000
         LR    R7,R1                   Set permanent aaddressing        01160000
         USING GRFCCWS,R7              ...                              01170000
         SPACE 1                                                        01180000
*-------------------------------------------------------------          01190000
*        Route based on display device type                             01200000
*-------------------------------------------------------------          01210000
         SPACE 1                                                        01220000
ROUTCALL DS    0H                                                       01230000
         BAL   R14,RELEASE             Release any prior work areas     01240000
*                                                                       01250000
         B     VECTOR77(R2)                                             01260000
VECTOR77 DS    0H                                                       01270000
         B     BADCALL        CPIX=0  bad call                          01280000
         B     BLD77RMI       CPIX=1  Read Manual Input                 01290000
         B     BLD77FMT       CPIX=2  Format screen w/logo              01300000
         B     BLD77WRT       CPIX=3  Write to output area              01310000
         B     BLD77CLR       CPIX=4  Clear screen                      01320000
         B     BLD77CLS       CPIX=5  Clear screen with Erase Write     01330000
         B     BLD77CRD       CPIX=6  Clear input area w/RUNNING        01340000
         B     BLD77MRD       CPIX=7  Clear input area w/o status       01350000
         B     BLD77IDS       CPIX=8  Write to input area               01360000
         B     BLD77TAB       CPIX=9  Insert a logical tab              01370000
         B     BLD77HLD       CPIX=10 Set status = HOLDING              01380000
         B     BLD77MOR       CPIX=11 Set status = MORE...              01390000
         B     BLD77NAC       CPIX=12 Set status = NOT ACCEPTED         01400000
         B     BLD77RUN       CPIX=13 Set status = RUNNING              01410000
         B     BLD77VMR       CPIX=14 Set status = VM READ              01420000
         B     BLD77CPR       CPIX=15 Set status = CP READ              01430000
         B     BLD77VMP       CPIX=16 Set status = VM READ inhibit      01440000
         B     BLD77CPP       CPIX=17 Set status = CP READ inhibit      01450000
         B     BLD77WNG       CPIX=18 Sound warning alarm               01460000
         SPACE 3                                                        01470000
GOODEXIT DS    0H                                                       01480000
         LA    R1,GRFCCW1              Default channel program          01490000
EXITR1   DS    0H                                                       01500000
         ST    R1,SAVER1               Return R1 = channel program      01510000
         XR    R15,R15                 and RC=0                         01520000
DOEXIT   DS    0H                                                       01530000
         EXIT  ,                                                        01540000
BADCALL  DS    0H                                                       01550000
         LA    R15,8                                                    01560000
         B     DOEXIT                                                   01570000
         EJECT ,                                                        01580000
***************************************************************         01590000
*                                                                       01600000
*        C V T 1 2                                                      01610000
*                                                                       01620000
*        Convert buffer address to encoded 12-bit if needed             01630000
*                                                                       01640000
***************************************************************         01650000
         SPACE 1                                                        01660000
CVT12    DS    0H                                                       01670000
         TM    RDEVGRIC,RDEVAD14       14-bit addressing                01680000
         BOR   R14                     yes, use addr as-is              01690000
         ST    R14,SAVEWRK2            Save return address              01700000
         CALL  DMKCVT12                Convert to 12-bit                01710000
         L     R14,SAVEWRK2            and return to caller             01720000
         BR    R14                                                      01730000
         SPACE 3                                                        01740000
***************************************************************         01750000
*                                                                       01760000
*        C V T 1 4                                                      01770000
*                                                                       01780000
*        Convert possibly encoded buffer address to                     01790000
*        14-bit linear buffer location                                  01800000
*                                                                       01810000
***************************************************************         01820000
         SPACE 1                                                        01830000
CVT14    DS    0H                                                       01840000
         ST    R14,SAVEWRK2            Save return address              01850000
         CALL  DMKCVT14                Convert to 12-bit                01860000
         L     R14,SAVEWRK2            and return to caller             01870000
         BR    R14                                                      01880000
         EJECT ,                                                        01890000
* +--------------------------------------------------------+            01900000
* |                                                        |            01910000
* |      R M I : Read Manual Input (327x)                  |            01920000
* |                                                        |            01930000
* |      Input:                                            |            01940000
* |      IOBMISC = read buffer address                     |            01950000
* |                                                        |            01960000
* |      0B (Select)                                       |            01970000
* |      01 (Write) WCC                                    |            01980000
* |                 SBA @inpt                              |            01990000
* |      06 (RM)    buffer                                 |            02000000
* |                                                        |            02010000
* +--------------------------------------------------------+            02020000
         SPACE 1                                                        02030000
         PUSH  USING                                                    02040000
BLD77RMI DS    0H                                                       02050000
         MVC   GRFCCW1(RMI77CPL),RMI77CP  Channel program               02060000
         MVC   GRFXBUFF(RMI77DSL),RMI77DS Data stream                   02070000
*                                                                       02080000
         LA    R1,RMI77DSL             Set data stream length           02090000
         STH   R1,GRFCCW2+6              into the write CCW             02100000
         LA    R1,GRFXBUFF             Data stream goes here            02110000
         STCM  R1,7,GRFCCW2+1          plug in CCW address              02120000
*                                                                       02130000
         USING RMI77DS,R1              Fill in variables                02140000
         MVC   RMI77SBA,GRFX@INP       ... input area buffer addr       02150000
*                                                                       02160000
         L     R1,IOBMISC              Caller-provided input buffer     02170000
         STCM  R1,7,GRFCCW3+1            goes into the RM CCW           02180000
         LA    R1,BUFINLTH*2           along with the buffer size       02190000
         STH   R1,GRFCCW3+6            ...                              02200000
*                                                                       02210000
         B     GOODEXIT                and all finished                 02220000
         SPACE 1                                                        02230000
         POP   USING                                                    02240000
         SPACE 3                                                        02250000
*-------------------------------------------------------------          02260000
*        RMI Channel Program template                                   02270000
*-------------------------------------------------------------          02280000
         SPACE 1                                                        02290000
RMI77CP  DS    0D                                                       02300000
         CCW   CCWSEL,0,SILI+CC,1       Select                          02310000
         CCW   CCWWRT,*-*,SILI+CC,*-*   Write: WCC, SBA @inpt           02320000
         CCW   CCWRM,*-*,SILI,*-*       Read Modified                   02330000
RMI77CPL EQU   *-RMI77CP                                                02340000
         SPACE 1                                                        02350000
*-------------------------------------------------------------          02360000
*        RMI Data Stream template                                       02370000
*-------------------------------------------------------------          02380000
         SPACE 1                                                        02390000
RMI77DS  EQU   *                                                        02400000
         DC    AL1(WCCDFLT)                                             02410000
         DC    AL1(SBA)                                                 02420000
RMI77SBA DC    AL2(*-*)                Input Area buffer address        02430000
RMI77DSL EQU   *-RMI77DS                                                02440000
         EJECT ,                                                        02450000
* +--------------------------------------------------------+            02460000
* |                                                        |            02470000
* |      F M T : Format screen with logo                   |            02480000
* |                                                        |            02490000
* |      Input:                                            |            02500000
* |      none                                              |            02510000
* |                                                        |            02520000
* |      05/0D (EW[A]) WCC kbreset+alarm                   |            02530000
* |                    SBA @stat                           |            02540000
* |                    SF prot-low                         |            02550000
* |                    CL9'ENABLED'                        |            02560000
* |                    SF prot-low                         |            02570000
* |                    CL8'sysid'                          |            02580000
* |                    SF prot-low   s/b last screen cell  |            02590000
* |                    C'VM/370 Online'                    |            02600000
* |                                                        |            02610000
* |                    for each logo row [                 |            02620000
* |                       SBA logo-addr                    |            02630000
* |                       logo data row                    |            02640000
* |                    ]                                   |            02650000
* |      03    (NOP)                                       |            02660000
* |                                                        |            02670000
* +--------------------------------------------------------+            02680000
         SPACE 1                                                        02690000
         PUSH  USING                                                    02700000
BLD77FMT DS    0H                                                       02710000
         MVC   GRFCCW1(FMT77CPL),FMT77CP                                02720000
         MVC   GRFCCW1(1),GRFXERAS     Put correct EW[A] opcode         02730000
*                                                                       02740000
         L     R5,=A(DMKBOXDS)         Access logo descriptor           02750000
         LH    R2,0(,R5)               Get row size                     02760000
         LH    R3,2(,R5)               Get row count                    02770000
*                                                                       02780000
*        Make sure the logo fits on the screen                          02790000
*                                                                       02800000
         SR    R5,R5                   Clear size                       02810000
         MVI   SAVEWRK2,0              Assume no logo                   02820000
         CH    R2,GRFXCOLS             Is screen wide enough?           02830000
         BH    FMTNLG1                 no, don't build it then          02840000
         LA    R1,4(,R3)               Will logo height+4 fit on scrn?  02850000
         CH    R1,GRFXROWS             ...                              02860000
         BH    FMTNLG1                 no, skip it                      02870000
         MVI   SAVEWRK2,1              yes, set flag                    02880000
*                                                                       02890000
*        Calculate the space needed                                     02900000
*                                                                       02910000
         LA    R5,3(,R2)               (row.size + 3)                   02920000
         MR    R4,R3                   * row.ct                         02930000
FMTNLG1  DS    0H                                                       02940000
         LA    R5,FMT77DSL(,R5)        + preamble                       02950000
         STH   R5,GRFCCW1+6            = write length                   02960000
*                                                                       02970000
*        Allocate large datastream buffer                               02980000
*                                                                       02990000
         BAL   R14,RELEASE             Release any prior workarea       03000000
*                                                                       03010000
         LA    R0,7(,R5)               Alloc size in dwords             03020000
         SRL   R0,3                    dwords please                    03030000
         CALL  DMKFREE                 ... get it                       03040000
         STH   R0,GRFBUFFL             Save dwword length               03050000
         ST    R1,GRFBUFFA             save address                     03060000
         LR    R6,R1                   set addressability               03070000
*                                                                       03080000
*        Build orders in work area                                      03090000
*                                                                       03100000
FMT77OK1 DS    0H                                                       03110000
         STCM  R6,7,GRFCCW1+1          Set order addr in CCW            03120000
         L     R5,=A(DMKBOXBX)         Use the default logo             03130000
         CLI   INSTWRD1,C'8'           Is it really VM/380??            03140000
         BNE   *+8                     no.. all set to build logo       03150000
         L     R5,=A(DMKBOX80)         yes.. use alternate logo         03160000
*                                                                       03170000
         MVC   0(FMT77DSL,R6),FMT77DS                                   03180000
         USING FMT77DS,R6                                               03190000
         MVC   FMT77AD1,GRFX@INP       Input area attr addr             03200000
         MVC   FMT77SBA,GRFX@STA       Status area attr addr            03210000
         MVC   FMT77SID,GRFXSID        Move in systemId                 03220000
*                                                                       03230000
*        If we are running on Hercules-380, then update                 03240000
*        the "VM/370 Online" message to say "VM/380 Online"             03250000
*                                                                       03260000
         MVC   FMT77VMO+4(1),INSTWRD1  zap with 7 or 8 from PSA         03270000
         CLI   SAVEWRK2,1              Are we including the logo?       03280000
         BNE   FMTNLG2                 nope... skip it                  03290000
*                                                                       03300000
*        Calculate starting buffer address                              03310000
*                                                                       03320000
         LH    R4,GRFXROWS             Screen rows                      03330000
         S     R4,F2                   - 2                              03340000
         SR    R4,R3                   - logo rows                      03350000
         SRL   R4,1                    / 2 = starting row               03360000
         MH    R4,GRFXCOLS             * cols = address                 03370000
*                                                                       03380000
         LH    R1,GRFXCOLS             Screen cols                      03390000
         SR    R1,R2                   - logo cols                      03400000
         SRL   R1,1                    / 2 = starting col               03410000
*                                                                       03420000
         AR    R4,R1                   row+col = buffer addr            03430000
*                                                                       03440000
         LA    R6,FMT77DSL(,R6)        Build the logo here              03450000
         BCTR  R2,0                    row size - 1 for EX              03460000
*                                                                       03470000
FMT77LP  DS    0H                                                       03480000
         LR    R1,R4                   Current buffer address           03490000
         BAL   R14,CVT12               Make the proper buffer address   03500000
         MVI   0(R6),SBA               Move to next row                 03510000
         STCM  R1,3,1(R6)              ...                              03520000
*                                                                       03530000
         EX    R2,FMT77MVC             Move in next logo row            03540000
*                                                                       03550000
         LA    R6,3+1(R2,R6)           Bump buffer target               03560000
         LA    R5,1(R2,R5)             Bump to next logo row            03570000
         AH    R4,GRFXCOLS             Bump buffer addr                 03580000
*                                                                       03590000
         BCT   R3,FMT77LP              and build the whole logo         03600000
*                                                                       03610000
FMTNLG2  DS    0H                                                       03620000
         MVI   GRFXATOA,FLDPROT        Attribute in lower right         03630000
*                                                                       03640000
         B     GOODEXIT                                                 03650000
         SPACE 1                                                        03660000
FMT77MVC MVC   3(*-*,R6),0(R5)         *** Executed ***                 03670000
         SPACE 1                                                        03680000
         POP   USING                                                    03690000
         SPACE 3                                                        03700000
*-------------------------------------------------------------          03710000
*        FMT Channel Program template                                   03720000
*-------------------------------------------------------------          03730000
         SPACE 1                                                        03740000
FMT77CP  DS    0D                                                       03750000
         CCW   CCWEW,*-*,SILI+CC,*-*   Erase Write [Alternate]          03760000
         CCW   CCWNOP,0,SILI,1         NOP to get CE+DE together        03770000
FMT77CPL EQU   *-FMT77CP                                                03780000
         SPACE 1                                                        03790000
*-------------------------------------------------------------          03800000
*        FMT Data Stream template                                       03810000
*-------------------------------------------------------------          03820000
         SPACE 1                                                        03830000
FMT77DS  EQU   *                                                        03840000
         DC    AL1(WCCUNLK+WCCALARM)                                    03850000
         DC    AL1(SBA)                                                 03860000
FMT77AD1 DC    AL2(*-*)                input area buffer address        03870000
         DC    AL1(SF,FLDPROT+FAHIDE)  Hidden/protected                 03880000
         DC    AL1(IC)                                                  03890000
         DC    AL1(SBA)                                                 03900000
FMT77SBA DC    AL2(*-*)                status area buffer address       03910000
         DC    AL1(SF,FLDPROT)                                          03920000
         DC    CL9'ENABLED'                                             03930000
         DC    AL1(SF,FLDPROT)                                          03940000
FMT77SID DC    CL8'sysid'                                               03950000
         DC    AL1(SF,FLDPROT)                                          03960000
FMT77VMO DC    CL20'VM/370 Online'                                      03970000
FMT77DSL EQU   *-FMT77DS                                                03980000
         EJECT ,                                                        03990000
* +--------------------------------------------------------+            04000000
* |                                                        |            04010000
* |      W R T : Write to output area                      |            04020000
* |                                                        |            04030000
* |      Input:                                            |            04040000
* |      R4:       number of screen lines to write         |            04050000
* |      R5:       TRQBLOK address                         |            04060000
* |      R6:       CONTASK address                         |            04070000
* |      CONCNT:   length of data                          |            04080000
* |      CONDATA:  data to write                           |            04090000
* |      RDEVCORD: 1st screen line to write                |            04100000
* |                                                        |            04110000
* |      0B (Select)                                       |            04120000
* |                                                        |            04130000
* |      01 (Write) or 05 (EW) or 0D (EWA)                 |            04140000
* |                                                        |            04150000
* |         WCC kbreset                                    |            04160000
* |         if !hilight:                                   |            04170000
* |            SBA target-row, col-0                       |            04180000
* |         else                                           |            04190000
* |            if target-row == 0:                         |            04200000
* |               SBA 0,0                                  |            04210000
* |            else:                                       |            04220000
* |               SBA (target-row, 0) - 1                  |            04230000
* |               SF prot-high                             |            04240000
* |                                                        |            04250000
* |      00 data chained                                   |            04260000
* |                                                        |            04270000
* |          caller's data                                 |            04280000
* |                                                        |            04290000
* |      00 data chained                                   |            04300000
* |                                                        |            04310000
* |         if hilight && not ending on last row:          |            04320000
* |            SBA last row, end col                       |            04330000
* |            SF  prot-low                                |            04340000
* |                                                        |            04350000
* |         SBA @inpt                                      |            04360000
* |         SF  unprot+mdt                                 |            04370000
* |         SBA @stat                                      |            04380000
* |         SF  prot-low                                   |            04390000
* |         RUNNING                                        |            04400000
* |         SF  prot-low                                   |            04410000
* |         sysid                                          |            04420000
* |         if target-row == 0:                            |            04430000
* |            SF  prot-high                               |            04440000
* |         else                                           |            04450000
* |            SF  prot-low                                |            04460000
* |                                                        |            04470000
* +--------------------------------------------------------+            04480000
         SPACE 1                                                        04490000
         PUSH  USING                                                    04500000
BLD77WRT DS    0H                                                       04510000
         MVC   GRFCCW1(WRT77CPL),WRT77CP  Move in model                 04520000
*! TODO  DMKGRF is expecting this value here but it                     04530000
*        should probably be put in its own place..                      04540000
*        maybe a new, separate field in CONTASK?                        04550000
         STC   R4,CONCCW1+5               Save number of lines          04560000
         MVC   GRFXBUFF(WRT77DSL),WRT77DS Data stream model             04570000
*                                                                       04580000
         LA    R3,GRFXBUFF             Address the data stream          04590000
         STCM  R3,7,GRFCCW2+1          Set the preamble CCW data addr   04600000
         USING WRT77DS,R3                                               04610000
*                                                                       04620000
         TM    RDEVSTA3,RDEVEWRT       Erase/write required?            04630000
         BZ    WRTNOEW                 No                               04640000
         NI    RDEVSTA3,255-RDEVEWRT   Turn off flag                    04650000
         MVC   GRFCCW2(1),GRFXERAS     Set erase CCW opcode             04660000
WRTNOEW  DS    0H                                                       04670000
*                                                                       04680000
*        Calculate starting buffer address                              04690000
*                                                                       04700000
         SR    R1,R1                   Get current line position        04710000
         IC    R1,RDEVCORD             ...                              04720000
         TM    TRQBFLAG,CRTSIO         Diag58 writing to input area?    04730000
         BZ    *+8                     no, RDEVCORD is good             04740000
         IC    R1,TRQBLINE             yes, get Diag58 line number      04750000
         STC   R1,SAVEWRK1             (save starting buffer address)   04760000
         AR    R4,R1                   also calc ending line number     04770000
         MH    R1,GRFXCOLS             * col count = raw buffer addr    04780000
*                                                                       04790000
*        Build preamble data stream                                     04800000
*                                                                       04810000
         TM    CONPARM2,HILIGHT/256    Is the HILIGHT option on?        04820000
         BZ    WRTNOHI1                no, take the simple path         04830000
         LTR   R1,R1                   Writing to first line?           04840000
         BZ    WRTLN0                  yes, special case                04850000
         BCTR  R1,0                    no, set attr on line above       04860000
         LA    R2,WRT77LN2             Set preamble data length         04870000
         B     WRTADDR1                join below                       04880000
*                                                                       04890000
*        Here, the first line on the screen is to be hilighted.         04900000
*        We will just set a value of the bottom right attribute         04910000
*        that also referenced whenever the status area is displayed.    04920000
*                                                                       04930000
WRTLN0   DS    0H                                                       04940000
         MVI   GRFXATOA,FLDHIPRO       Set hilite attr for first line   04950000
*                                                                       04960000
*        Here for all non-hilighted and when the 1st line               04970000
*        is to be lighted. In this case, the SBA to set the             04980000
*        output line is the same: the start og the target line          04990000
*        This is setting up for just: WCC SBA(line#,0) preamble.        05000000
*                                                                       05010000
WRTNOHI1 DS    0H                                                       05020000
         LA    R2,WRT77LN1             Set basic prefix data length     05030000
*                                                                       05040000
WRTADDR1 DS    0H                                                       05050000
         STH   R2,GRFCCW2+6            Set preamble data stream length  05060000
*                                                                       05070000
         BAL   R14,CVT12               Make a proper buffer address     05080000
         STCM  R1,3,WRT77AD1           Set addr in data stream          05090000
*                                                                       05100000
*        Fill in user's data adr & length                               05110000
*                                                                       05120000
         LA    R1,CONDATA              User's data address              05130000
         STCM  R1,7,GRFCCW3+1          ...                              05140000
         LH    R1,CONCNT               and its length                   05150000
         STH   R1,GRFCCW3+6            ...                              05160000
*                                                                       05170000
*        Build footer based on HILITE and ending row                    05180000
*                                                                       05190000
         TM    CONPARM2,HILIGHT/256    Is the HILIGHT option on?        05200000
         BZ    WRTNOHI2                no, take the simple path         05210000
         CLM   R4,1,GRFXINL1           Ended on last output line        05220000
         BE    WRTNOHI2                yes, the InArea attr is enough   05230000
*                                                                       05240000
*        Suffix needs to first end the HILITE                           05250000
*                                                                       05260000
         MH    R4,GRFXCOLS             put attr at end of last line     05270000
         BCTR  R4,0                      of HILITE output               05280000
         LR    R1,R4                   Convert hilite end addr          05290000
         BAL   R14,CVT12                 to a proper buffer address     05300000
         STCM  R1,3,WRT77AD2           end-HILITE addr to data stream   05310000
         LA    R1,WRT77SF1             use large suffix                 05320000
         LA    R2,WRT77LN3             ...                              05330000
         B     WRTDOSFX                and join below                   05340000
*                                                                       05350000
*        Simple suffix if not HILITE                                    05360000
*        or HILITE ended on last output area line                       05370000
*                                                                       05380000
WRTNOHI2 DS    0H                                                       05390000
         LA    R1,WRT77SF2             use shorter suffix               05400000
         LA    R2,WRT77LN4             ...                              05410000
*                                                                       05420000
*        Build the common part of suffix                                05430000
*                                                                       05440000
WRTDOSFX DS    0H                                                       05450000
         STCM  R1,7,GRFCCW4+1          Set suffix address               05460000
         STH   R2,GRFCCW4+6              and length in the CCW          05470000
*                                                                       05480000
         MVC   WRT77AD3,GRFX@INP       Set @inpt buffer address         05490000
         MVC   WRT77AD4,GRFX@STA       Set @stat buffer address         05500000
         MVC   WRT77SID,GRFXSID        Move in systemId                 05510000
         MVC   WRT77ATT,GRFXATOA       Set lower right attr             05520000
*                                                                       05530000
         TM    CONPARM,ALARM           Alarm with message??             05540000
         BZ    GOODEXIT                no, just exit                    05550000
         OI    TRQBFLAG,CRTALRM        Flag screen alarm                05560000
         OI    WRT77WCC,WCCALARM       Add alaarm bit to WCC            05570000
         B     GOODEXIT                  and return to caller           05580000
*                                                                       05590000
         POP   USING                                                    05600000
         SPACE 3                                                        05610000
*-------------------------------------------------------------          05620000
*        WRT Channel Program template                                   05630000
*-------------------------------------------------------------          05640000
         SPACE 1                                                        05650000
WRT77CP  DS    0D                                                       05660000
         CCW   CCWSEL,0,SILI+CC,1       Select                          05670000
         CCW   CCWWRT,*-*,SILI+CD,*-*   Write: WCC, etc heading         05680000
         CCW   0,*-*,SILI+CD,*-*        Write output data               05690000
         CCW   0,*-*,SILI,*-*           Write trailer                   05700000
WRT77CPL EQU   *-WRT77CP                                                05710000
         SPACE 1                                                        05720000
*-------------------------------------------------------------          05730000
*        WRT Data Stream template                                       05740000
*-------------------------------------------------------------          05750000
         SPACE 1                                                        05760000
WRT77DS  EQU   *                                                        05770000
WRT77WCC DC    AL1(WCCUNLK)            unlock keyboard                  05780000
         DC    AL1(SBA)                                                 05790000
WRT77AD1 DC    AL2(*-*)                line addr                        05800000
WRT77LN1 EQU   *-WRT77DS               heading len (!hilite or line 0)  05810000
*                                                                       05820000
         DC    AL1(SF,FLDHIPRO)        hilite not line 0                05830000
WRT77LN2 EQU   *-WRT77DS               heading len (w/hilite not row 0) 05840000
*                                                                       05850000
*        then output data goes here                                     05860000
*                                                                       05870000
WRT77SF1 EQU   *                       footer (hilite not row 0)        05880000
         DC    AL1(SBA)                                                 05890000
WRT77AD2 DC    AL2(*-*)                line end addr                    05900000
         DC    AL1(SF,FLDPROT)                                          05910000
*                                                                       05920000
WRT77SF2 EQU   *                                                        05930000
         DC    AL1(SBA)                                                 05940000
WRT77AD3 DC    AL2(*-*)                Input area buffer address        05950000
         DC    AL1(SF,FLDCHNG)                                          05960000
         DC    AL1(SBA)                                                 05970000
WRT77AD4 DC    AL2(*-*)                Status area buffer address       05980000
         DC    AL1(SF,FLDPROT)                                          05990000
         DC    CL9'RUNNING'                                             06000000
         DC    AL1(SF,FLDPROT)                                          06010000
WRT77SID DC    CL8'sysid'                                               06020000
         DC    AL1(SF)                 Output area attr                 06030000
WRT77ATT DC    AL1(*-*)                FLDPROT or HIPRO if hilite ln 0  06040000
*                                                                       06050000
WRT77LN3 EQU   *-WRT77SF1              len of hilite not row 0          06060000
WRT77LN4 EQU   *-WRT77SF2              others                           06070000
*                                                                       06080000
WRT77DSL EQU   *-WRT77DS               total length for move            06090000
         EJECT ,                                                        06100000
* +--------------------------------------------------------+            06110000
* |                                                        |            06120000
* |      C L R : Clear & format the whole screen           |            06130000
* |                                                        |            06140000
* |      Input:                                            |            06150000
* |      none                                              |            06160000
* |                                                        |            06170000
* |      0B (Select)                                       |            06180000
* |      01 (Write) WCC kbreset                            |            06190000
* |                 SBA 0,0                                |            06200000
* |                 RA  @inpt;0                            |            06210000
* |                 SF  unprotected, low, mdt              |            06220000
* |                 IC                                     |            06230000
* |                 SBA @stat                              |            06240000
* |                 SF  prot-low                           |            06250000
* |                 CL9'RUNNING'                           |            06260000
* |                 SF  prot-low                           |            06270000
* |                 CL8'sysid'                             |            06280000
* |                 SF  prot-low                           |            06290000
* |                                                        |            06300000
* |      note: Vanilla VM/370 does the RA in 480-byte      |            06310000
* |            chunks. The component description manuals   |            06320000
* |            only talk about that limitation for the     |            06330000
* |            remote terminals: 3275 and 3172 controller  |            06340000
* |                                                        |            06350000
* +--------------------------------------------------------+            06360000
         SPACE 1                                                        06370000
         PUSH  USING                                                    06380000
BLD77CLR DS    0H                                                       06390000
         MVC   GRFCCW1(CLR77CPL),CLR77CP  Channel program               06400000
         MVC   GRFXBUFF(CLR77DSL),CLR77DS Data stream                   06410000
*                                                                       06420000
         LA    R1,CLR77DSL             Set data stream length           06430000
         STH   R1,GRFCCW2+6              into the write CCW             06440000
         LA    R3,GRFXBUFF             Data stream goes here            06450000
         STCM  R3,7,GRFCCW2+1          plug in CCW address              06460000
*                                                                       06470000
         USING CLR77DS,R3              Fill in variables                06480000
         SR    R1,R1                   Set home addr                    06490000
         BAL   R14,CVT12               Make a proper buffer address     06500000
         STCM  R1,3,CLR77AD1           Set top-left buffer addr         06510000
         MVC   CLR77AD2,GRFX@INP       Set input area addr              06520000
         MVC   CLR77AD3,GRFX@STA       Set status area addr             06530000
         MVC   CLR77SID,GRFXSID        Move in systemId                 06540000
*                                                                       06550000
         MVI   GRFXATOA,FLDPROT        reset bottom right attr          06560000
*                                                                       06570000
         B     GOODEXIT                all set.. return to caller       06580000
         SPACE 1                                                        06590000
         POP   USING                                                    06600000
         SPACE 3                                                        06610000
*-------------------------------------------------------------          06620000
*        CLR Channel Program template                                   06630000
*-------------------------------------------------------------          06640000
         SPACE 1                                                        06650000
CLR77CP  DS    0D                                                       06660000
         CCW   CCWSEL,0,SILI+CC,1       Select                          06670000
         CCW   CCWWRT,*-*,SILI,*-*      Write: WCC, etc heading         06680000
CLR77CPL EQU   *-CLR77CP                                                06690000
         SPACE 1                                                        06700000
*-------------------------------------------------------------          06710000
*        CLR Data Stream template                                       06720000
*-------------------------------------------------------------          06730000
         SPACE 1                                                        06740000
CLR77DS  EQU   *                                                        06750000
         DC    AL1(WCCUNLK)            unlock keyboard                  06760000
         DC    AL1(SBA)                                                 06770000
CLR77AD1 DC    AL2(*-*)                0,0                              06780000
         DC    AL1(RA)                                                  06790000
CLR77AD2 DC    AL2(*-*),AL1(0)         input area buffer address        06800000
         DC    AL1(SF,FLDCHNG)                                          06810000
         DC    AL1(IC)                                                  06820000
         DC    AL1(SBA)                                                 06830000
CLR77AD3 DC    AL2(*-*)                Status area buffer address       06840000
         DC    AL1(SF,FLDPROT)                                          06850000
         DC    CL9'RUNNING'                                             06860000
         DC    AL1(SF,FLDPROT)                                          06870000
CLR77SID DC    CL8'sysid'                                               06880000
         DC    AL1(SF,FLDPROT)         Bottom-right (OutArea) attr      06890000
*                                                                       06900000
CLR77DSL EQU   *-CLR77DS               data stream length               06910000
         EJECT ,                                                        06920000
* +--------------------------------------------------------+            06930000
* |                                                        |            06940000
* |      C L S : Clear screen with Erase Write             |            06950000
* |                                                        |            06960000
* |      Input:                                            |            06970000
* |      none                                              |            06980000
* |                                                        |            06990000
* |      05/0D (EW) WCC kbreset                            |            07000000
* |                 SBA @inpt                              |            07010000
* |                 SF  unprot+hidden+mdt                  |            07020000
* |                 IC                                     |            07030000
* |                 EUA @stat                              |            07040000
* |                 SBA @inpt                              |            07050000
* |                 SF  unprot+low+mdt                     |            07060000
* |                 SBA @stat                              |            07070000
* |                 SF  prot-low                           |            07080000
* |                 CL9'RUNNING'                           |            07090000
* |                 SF  prot-low                           |            07100000
* |                 CL8'sysid'                             |            07110000
* |                 SF  prot-low                           |            07120000
* |                                                        |            07130000
* +--------------------------------------------------------+            07140000
         SPACE 1                                                        07150000
         PUSH  USING                                                    07160000
BLD77CLS DS    0H                                                       07170000
         MVC   GRFCCW1(CLS77CPL),CLS77CP  Channel program               07180000
         MVC   GRFXBUFF(CLS77DSL),CLS77DS Data stream                   07190000
*                                                                       07200000
         MVC   GRFCCW1(1),GRFXERAS     Set EW/EWA CCW opcode            07210000
*                                                                       07220000
         LA    R1,CLS77DSL             Set data stream length           07230000
         STH   R1,GRFCCW1+6              into the write CCW             07240000
         LA    R3,GRFXBUFF             Data stream goes here            07250000
         STCM  R3,7,GRFCCW1+1          plug in CCW address              07260000
*                                                                       07270000
         USING CLS77DS,R3              Fill in variables                07280000
         MVC   CLS77AD1,GRFX@INP       Set input area addr              07290000
         MVC   CLS77AD2,GRFX@STA       Set status area addr             07300000
         MVC   CLS77AD3,GRFX@INP       Set input area addr              07310000
         MVC   CLS77AD4,GRFX@STA       Set status area addr             07320000
         MVC   CLS77SID,GRFXSID        Move in systemId                 07330000
*                                                                       07340000
         MVI   GRFXATOA,FLDPROT        reset bottom right attr          07350000
*                                                                       07360000
         B     GOODEXIT                all set.. return to caller       07370000
         SPACE 1                                                        07380000
         POP   USING                                                    07390000
         SPACE 3                                                        07400000
*-------------------------------------------------------------          07410000
*        CLS Channel Program template                                   07420000
*-------------------------------------------------------------          07430000
         SPACE 1                                                        07440000
CLS77CP  DS    0D                                                       07450000
         CCW   *-*,*-*,SILI,*-*        Erase Write (Alternate)          07460000
CLS77CPL EQU   *-CLS77CP                                                07470000
         SPACE 1                                                        07480000
*-------------------------------------------------------------          07490000
*        CLS Data Stream template                                       07500000
*-------------------------------------------------------------          07510000
         SPACE 1                                                        07520000
CLS77DS  EQU   *                                                        07530000
         DC    AL1(WCCUNLK)                                             07540000
         DC    AL1(SBA)                                                 07550000
CLS77AD1 DC    AL2(*-*)                input area buffer addr           07560000
         DC    AL1(SF,FLDHIDMT)                                         07570000
         DC    AL1(IC)                                                  07580000
         DC    AL1(EUA)                                                 07590000
CLS77AD2 DC    AL2(*-*)                status area buffer address       07600000
         DC    AL1(SBA)                                                 07610000
CLS77AD3 DC    AL2(*-*)                input area buffer address        07620000
         DC    AL1(SF,FLDCHNG)                                          07630000
         DC    AL1(SBA)                                                 07640000
CLS77AD4 DC    AL2(*-*)                status area buffer address       07650000
         DC    AL1(SF,FLDPROT)                                          07660000
         DC    CL9'RUNNING'                                             07670000
         DC    AL1(SF,FLDPROT)                                          07680000
CLS77SID DC    CL8'sysid'                                               07690000
         DC    AL1(SF,FLDPROT)         Bottom-right (OutArea) attr      07700000
*                                                                       07710000
CLS77DSL EQU   *-CLS77DS               data stream length               07720000
         EJECT ,                                                        07730000
* +--------------------------------------------------------+            07740000
* |                                                        |            07750000
* |      C R D : Clear the input area                      |            07760000
* |                                                        |            07770000
* |      Input:                                            |            07780000
* |      none                                              |            07790000
* |                                                        |            07800000
* |      0B (Select)                                       |            07810000
* |      01 (Write) WCC kbreset                            |            07820000
* |                 SBA @inpt                              |            07830000
* |                 SF  unprot+hidden+mdt                  |            07840000
* |                 IC                                     |            07850000
* |                 EUA @stat                              |            07860000
* |                 SBA @inpt                              |            07870000
* |                 SF  unprot+low+mdt                     |            07880000
* |                 SBA @stat                              |            07890000
* |                 SF  prot-low                           |            07900000
* |                 CL9'RUNNING'                           |            07910000
* |                 SF  prot-low                           |            07920000
* |                 CL8'sysid'                             |            07930000
* |                 SF  OutArea-attr                       |            07940000
* |                                                        |            07950000
* +--------------------------------------------------------+            07960000
         SPACE 1                                                        07970000
         PUSH  USING                                                    07980000
BLD77CRD DS    0H                                                       07990000
         MVC   GRFCCW1(CRD77CPL),CRD77CP  Channel program               08000000
         MVC   GRFXBUFF(CRD77DSL),CRD77DS Data stream                   08010000
*                                                                       08020000
         LA    R1,CRD77DSL             Set data stream length           08030000
         STH   R1,GRFCCW2+6              into the write CCW             08040000
         LA    R3,GRFXBUFF             Data stream goes here            08050000
         STCM  R3,7,GRFCCW2+1          plug in CCW address              08060000
*                                                                       08070000
         USING CRD77DS,R3              Fill in variables                08080000
         MVC   CRD77AD1,GRFX@INP       Set input area addr              08090000
         MVC   CRD77AD2,GRFX@STA       Set status area addr             08100000
         MVC   CRD77AD3,GRFX@INP       Set input area addr              08110000
         MVC   CRD77AD4,GRFX@STA       Set status area addr             08120000
         MVC   CRD77SID,GRFXSID        Move in systemId                 08130000
         MVC   CRD77ATT,GRFXATOA       Set lower right attr             08140000
*                                                                       08150000
         B     GOODEXIT                all set.. return to caller       08160000
         SPACE 1                                                        08170000
         POP   USING                                                    08180000
         SPACE 3                                                        08190000
*-------------------------------------------------------------          08200000
*        CRD Channel Program template                                   08210000
*-------------------------------------------------------------          08220000
         SPACE 1                                                        08230000
CRD77CP  DS    0D                                                       08240000
         CCW   CCWSEL,0,SILI+CC,1       Select                          08250000
         CCW   CCWWRT,*-*,SILI,*-*      Write: WCC, etc heading         08260000
CRD77CPL EQU   *-CRD77CP                                                08270000
         SPACE 1                                                        08280000
*-------------------------------------------------------------          08290000
*        CRD Data Stream template                                       08300000
*-------------------------------------------------------------          08310000
         SPACE 1                                                        08320000
CRD77DS  EQU   *                                                        08330000
         DC    AL1(WCCUNLK)                                             08340000
         DC    AL1(SBA)                                                 08350000
CRD77AD1 DC    AL2(*-*)                input area buffer addr           08360000
         DC    AL1(SF,FLDHIDMT)                                         08370000
         DC    AL1(IC)                                                  08380000
         DC    AL1(EUA)                                                 08390000
CRD77AD2 DC    AL2(*-*)                status area buffer address       08400000
         DC    AL1(SBA)                                                 08410000
CRD77AD3 DC    AL2(*-*)                input area buffer address        08420000
         DC    AL1(SF,FLDCHNG)                                          08430000
         DC    AL1(SBA)                                                 08440000
CRD77AD4 DC    AL2(*-*)                status area buffer address       08450000
         DC    AL1(SF,FLDPROT)                                          08460000
         DC    CL9'RUNNING'                                             08470000
         DC    AL1(SF,FLDPROT)                                          08480000
CRD77SID DC    CL8'sysid'                                               08490000
         DC    AL1(SF)                 Output area attr                 08500000
CRD77ATT DC    AL1(*-*)                FLDPROT or HIPRO if hilite ln 0  08510000
*                                                                       08520000
CRD77DSL EQU   *-CRD77DS               data stream length               08530000
         EJECT ,                                                        08540000
* +--------------------------------------------------------+            08550000
* |                                                        |            08560000
* |      M R D : Clear input area when in MORE or HOLDING  |            08570000
* |                                                        |            08580000
* |      Input:                                            |            08590000
* |      none                                              |            08600000
* |                                                        |            08610000
* |      0B (Select)                                       |            08620000
* |      01 (Write) WCC kbreset                            |            08630000
* |                 SBA @inpt                              |            08640000
* |                 SF  unprot+hidden+mdt                  |            08650000
* |                 IC                                     |            08660000
* |                 EUA @stat                              |            08670000
* |                 SBA @inpt                              |            08680000
* |                 SF  unprot+low+mdt                     |            08690000
* |                                                        |            08700000
* +--------------------------------------------------------+            08710000
         SPACE 1                                                        08720000
         PUSH  USING                                                    08730000
BLD77MRD DS    0H                                                       08740000
         MVC   GRFCCW1(MRD77CPL),MRD77CP  Channel program               08750000
         MVC   GRFXBUFF(MRD77DSL),MRD77DS Data stream                   08760000
*                                                                       08770000
         LA    R1,MRD77DSL             Set data stream length           08780000
         STH   R1,GRFCCW2+6              into the write CCW             08790000
         LA    R3,GRFXBUFF             Data stream goes here            08800000
         STCM  R3,7,GRFCCW2+1          plug in CCW address              08810000
*                                                                       08820000
         USING MRD77DS,R3              Fill in variables                08830000
         MVC   MRD77AD1,GRFX@INP       Set input area addr              08840000
         MVC   MRD77AD2,GRFX@STA       Set status area addr             08850000
         MVC   MRD77AD3,GRFX@INP       Set input area addr              08860000
*                                                                       08870000
         B     GOODEXIT                all set.. return to caller       08880000
         SPACE 1                                                        08890000
         POP   USING                                                    08900000
         SPACE 3                                                        08910000
*-------------------------------------------------------------          08920000
*        MRD Channel Program template                                   08930000
*-------------------------------------------------------------          08940000
         SPACE 1                                                        08950000
MRD77CP  DS    0D                                                       08960000
         CCW   CCWSEL,0,SILI+CC,1      Select                           08970000
         CCW   CCWWRT,*-*,SILI,*-*     Write: WCC, etc heading          08980000
MRD77CPL EQU   *-MRD77CP                                                08990000
         SPACE 1                                                        09000000
*-------------------------------------------------------------          09010000
*        MRD Data Stream template                                       09020000
*-------------------------------------------------------------          09030000
         SPACE 1                                                        09040000
MRD77DS  EQU   *                                                        09050000
         DC    AL1(WCCUNLK)                                             09060000
         DC    AL1(SBA)                                                 09070000
MRD77AD1 DC    AL2(*-*)                input area buffer addr           09080000
         DC    AL1(SF,FLDHIDMT)                                         09090000
         DC    AL1(IC)                                                  09100000
         DC    AL1(EUA)                                                 09110000
MRD77AD2 DC    AL2(*-*)                status area buffer address       09120000
         DC    AL1(SBA)                                                 09130000
MRD77AD3 DC    AL2(*-*)                input area buffer address        09140000
         DC    AL1(SF,FLDCHNG)                                          09150000
*                                                                       09160000
MRD77DSL EQU   *-MRD77DS               data stream length               09170000
         EJECT ,                                                        09180000
* +--------------------------------------------------------+            09190000
* |                                                        |            09200000
* |      I D S : Write to input area                       |            09210000
* |                                                        |            09220000
* |      Input:                                            |            09230000
* |      R3:   length of data to display                   |            09240000
* |      R4:   address of data to display                  |            09250000
* |                                                        |            09260000
* |      0B (Select)                                       |            09270000
* |      01 (Write)  WCC kbreset                           |            09280000
* |                  SBA @inpt                             |            09290000
* |                  EUA @stat                             |            09300000
* |                  SBA @inpt                             |            09310000
* |                  SF  attr7                             |            09320000
* |                  IC                                    |            09330000
* |                                                        |            09340000
* |      00 data chained for caller's data                 |            09350000
* |                                                        |            09360000
* +--------------------------------------------------------+            09370000
         SPACE 1                                                        09380000
         PUSH  USING                                                    09390000
BLD77IDS DS    0H                                                       09400000
         MVC   GRFCCW1(IDS77CPL),IDS77CP  Channel program               09410000
         MVC   GRFXBUFF(IDS77DSL),IDS77DS Data stream                   09420000
*                                                                       09430000
         STCM  R4,7,GRFCCW3+1          Set caller's data address        09440000
         STH   R3,GRFCCW3+6              and length                     09450000
*                                                                       09460000
         LA    R1,IDS77DSL             Set data stream length           09470000
         STH   R1,GRFCCW2+6              into the write CCW             09480000
         LA    R3,GRFXBUFF             Data stream goes here            09490000
         STCM  R3,7,GRFCCW2+1          plug in CCW address              09500000
*                                                                       09510000
         USING IDS77DS,R3              Fill in variables                09520000
         MVC   IDS77AD1,GRFX@INP       Set input area addr              09530000
         MVC   IDS77AD2,GRFX@STA       Set status area addr             09540000
         MVC   IDS77AD3,GRFX@INP       Set input area addr              09550000
*                                                                       09560000
         B     GOODEXIT                all set.. return to caller       09570000
         SPACE 1                                                        09580000
         POP   USING                                                    09590000
         SPACE 3                                                        09600000
*-------------------------------------------------------------          09610000
*        IDS Channel Program template                                   09620000
*-------------------------------------------------------------          09630000
         SPACE 1                                                        09640000
IDS77CP  DS    0D                                                       09650000
         CCW   CCWSEL,0,SILI+CC,1      Select                           09660000
         CCW   CCWWRT,*-*,SILI+CD,*-*  Write: WCC, etc heading          09670000
         CCW   0,*-*,SILI,*-*          write caller's data              09680000
IDS77CPL EQU   *-IDS77CP                                                09690000
         SPACE 1                                                        09700000
*-------------------------------------------------------------          09710000
*        IDS Data Stream template                                       09720000
*-------------------------------------------------------------          09730000
         SPACE 1                                                        09740000
IDS77DS  EQU   *                                                        09750000
         DC    AL1(WCCUNLK)                                             09760000
         DC    AL1(SBA)                                                 09770000
IDS77AD1 DC    AL2(*-*)                input area buffer addr           09780000
         DC    AL1(EUA)                                                 09790000
IDS77AD2 DC    AL2(*-*)                status area buffer address       09800000
         DC    AL1(SBA)                                                 09810000
IDS77AD3 DC    AL2(*-*)                input area buffer address        09820000
         DC    AL1(SF,FLDCHNG)                                          09830000
         DC    AL1(IC)                                                  09840000
*                                                                       09850000
IDS77DSL EQU   *-IDS77DS               data stream length               09860000
         EJECT ,                                                        09870000
* +--------------------------------------------------------+            09880000
* |                                                        |            09890000
* |      T A B : Insert tab character & move cursor        |            09900000
* |                                                        |            09910000
* |      Input:                                            |            09920000
* |      R0  = Length of TAB set list                      |            09930000
* |      R1  = address of TAB set list                     |            09940000
* |      R3  = current input BUFFER                        |            09950000
* |                                                        |            09960000
* |      0B (Select)                                       |            09970000
* |      01 (Write) WCC                                    |            09980000
* |                 SBA @inpt                              |            09990000
* |      06 (RM)    buffer                                 |            10000000
* |                                                        |            10010000
* +--------------------------------------------------------+            10020000
         SPACE 1                                                        10030000
         PUSH  USING                                                    10040000
BLD77TAB DS    0H                                                       10050000
         USING BUFFER,R3               Need access to current input     10060000
         SPACE 1                                                        10070000
         LR    R4,R0                   Save input parms                 10080000
         LR    R5,R1                   ...                              10090000
*                                                                       10100000
*        Initialize resulting channel program                           10110000
*                                                                       10120000
         MVC   GRFCCW1(TAB77CPL),TAB77CP  Channel program               10130000
         MVC   GRFXBUFF(TAB77DSL),TAB77DS Data stream                   10140000
*                                                                       10150000
         LA    R1,TAB77DSL             Set data stream length           10160000
         STH   R1,GRFCCW2+6              into the write CCW             10170000
         LA    R2,GRFXBUFF             Data stream goes here            10180000
         STCM  R2,7,GRFCCW2+1          plug in CCW address              10190000
*                                                                       10200000
         USING TAB77DS,R2              Fill in variables                10210000
*                                                                       10220000
*        Get current relative column number                             10230000
*                                                                       10240000
         SR    R1,R1                                                    10250000
         ICM   R1,3,BUFCSR             Get current cursor address       10260000
         BAL   R14,CVT14               ...                              10270000
         SH    R1,GRFXORGI             R1 = current 0-based column      10280000
         LR    R7,R1                   (keep in R7)                     10290000
*                                                                       10300000
*        Scan TAB sets to find target column                            10310000
*                                                                       10320000
         LTR   R4,R4                   Are there any                    10330000
         BNP   TABEGIN                 No, put cursor at start          10340000
*                                                                       10350000
TABSCAN  DS    0H                                                       10360000
         CLM   R7,1,0(R5)              Is this the place to tab to?     10370000
         BL    TABHIGH                 Yes if current column is lower   10380000
         LA    R5,1(,R5)               Bump to next tab stop            10390000
         BCT   R4,TABSCAN              Scan all the tab stops           10400000
*                                                                       10410000
TABEGIN  DS    0H                                                       10420000
         SR    R7,R7                   Put cursor back at the start     10430000
*                                                                       10440000
*        No logical tab needed.. Just the IC                            10450000
*                                                                       10460000
TABONE   DS    0H                                                       10470000
         LA    R1,TAB77LN1             Set length w/o logical tab       10480000
         STH   R1,GRFCCW2+6            ...                              10490000
*                                                                       10500000
TABTWO   DS    0H                      Both logical tab and IC needed   10510000
         BAL   R6,TABADDR              Convert & store buffer address   10520000
         MVI   TAB77TAB,IC               and add Insert Cursor order    10530000
*                                                                       10540000
         B     GOODEXIT                                                 10550000
*                                                                       10560000
*        Figure out where to place the logical tab                      10570000
*                                                                       10580000
TABHIGH  DS    0H                                                       10590000
         IC    R7,0(,R5)               Get target tab stop column       10600000
         L     R5,SAVER1               Restore ptr to tab stops         10610000
         LA    R4,BUFDATA              And ptr to the current input     10620000
         SLR   R3,R3                   Init ctr for logical tab loc     10630000
         IC    R6,VMGRFTAB             Get user's logical tab char      10640000
*                                                                       10650000
TABLOOP  DS    0H                                                       10660000
         CLI   0(R4),0                 Have we hit the end of data?     10670000
         BE    TABCHAR                 Yes, put logical tab here        10680000
         CLM   R6,1,0(R4)              Previous logical tab here?       10690000
         BE    TABUPDT                 Yes, must update tab location    10700000
         LA    R3,1(,R3)               Bump logical tab location        10710000
         CLM   R3,1,0(R5)              Is this also a tab stop?         10720000
         BL    TABDATA                 If not, just keep checking       10730000
         LA    R5,1(,R5)               Point to next tab stop           10740000
TABDATA  DS    0H                                                       10750000
         LA    R4,1(,R4)               Bump to next input character     10760000
         CR    R3,R7                   Reached the target tab stop?     10770000
         BL    TABLOOP                 No, leep looking at input        10780000
         B     TABONE                  Yes, no need for logical tab     10790000
*                                                                       10800000
TABUPDT  DS    0H                                                       10810000
         IC    R3,0(,R5)               Bump logical tab location        10820000
         LA    R5,1(,R5)               Point to next tab stop           10830000
         B     TABDATA                 and keep checking the input data 10840000
*                                                                       10850000
TABCHAR  DS    0H                                                       10860000
         LR    R5,R7                   Save cursor target location      10870000
         LR    R7,R3                   Get logical tab location         10880000
         STC   R6,TAB77TAB             Put logical tab in data stream   10890000
         BAL   R6,TABADDR              Cvt R7 addr & put in data strm   10900000
         LA    R2,TAB77DSP(,R2)        Bump data stream pointer for IC  10910000
         LR    R7,R5                   Restore new cursor target addr   10920000
         B     TABTWO                  and go add IC to data stream     10930000
         SPACE 2                                                        10940000
*                                                                       10950000
*        Little subroutine to convert & store buffer address            10960000
*                                                                       10970000
TABADDR  DS    0H                                                       10980000
         AH    R7,GRFXORGI             Add back the input area origin   10990000
         LR    R1,R7                   pass it in R1                    11000000
         BAL   R14,CVT12               Make proper buffer address       11010000
         STCM  R1,3,3(R2)              Put result in data stream        11020000
         BR    R6                      Return to caller                 11030000
         SPACE 1                                                        11040000
         POP   USING                                                    11050000
         SPACE 3                                                        11060000
*-------------------------------------------------------------          11070000
*        TAB Channel Program template                                   11080000
*-------------------------------------------------------------          11090000
         SPACE 1                                                        11100000
TAB77CP  DS    0D                                                       11110000
         CCW   CCWSEL,0,SILI+CC,1      Select                           11120000
         CCW   CCWWRT,*-*,SILI,*-*     Write: WCC, etc heading          11130000
TAB77CPL EQU   *-TAB77CP                                                11140000
         SPACE 1                                                        11150000
*-------------------------------------------------------------          11160000
*        TAB Data Stream template                                       11170000
*-------------------------------------------------------------          11180000
         SPACE 1                                                        11190000
TAB77DS  EQU   *                                                        11200000
         DC    AL1(WCCUNLK)                                             11210000
         DC    AL1(SBA)                                                 11220000
TAB77AD1 DC    AL2(*-*)                where to put logical tab         11230000
TAB77TAB DC    AL1(*-*)                logical tab char (or IC)         11240000
*                                                                       11250000
TAB77LN1 EQU   *-TAB77DS               length w/o logical tab           11260000
*                                                                       11270000
         DC    AL1(SBA)                                                 11280000
TAB77AD2 DC    AL2(*-*)                target column                    11290000
         DC    AL1(IC)                                                  11300000
*                                                                       11310000
TAB77DSP EQU   TAB77AD2-TAB77AD1 2nd SBA displacement                   11320000
*                                                                       11330000
TAB77DSL EQU   *-TAB77DS               data stream length               11340000
         EJECT ,                                                        11350000
* +--------------------------------------------------------+            11360000
* |                                                        |            11370000
* |      H L D : Set status area to HOLDING                |            11380000
* |      M O R : Set status area to MORE...                |            11390000
* |      N A C : Set status area to NOT ACCEPTED           |            11400000
* |                                                        |            11410000
* |      Input:                                            |            11420000
* |      none                                              |            11430000
* |                                                        |            11440000
* |      0B    (Select)                                    |            11450000
* |      01    (Write) WCC krreset+alarm                   |            11460000
* |                    SBA @stat                           |            11470000
* |                    SF prot-low                         |            11480000
* |                    CL9'HOLDING' or MORE... or ...      |            11490000
* |                    SF prot-low                         |            11500000
* |                    CL8'sysid'                          |            11510000
* |                    SF prot-low   s/b last screen cell  |            11520000
* |                                                        |            11530000
* +--------------------------------------------------------+            11540000
         SPACE 1                                                        11550000
         PUSH  USING                                                    11560000
BLD77HLD DS    0H                                                       11570000
         LA    R5,HLD77OPT             Display options + status         11580000
         B     BLDSTAT                 Join common                      11590000
         SPACE 1                                                        11600000
HLD77OPT EQU   *                                                        11610000
         DC    AL1(WCCUNLK,FLDHIPRO,FLDPROT)                            11620000
         DC    CL9'HOLDING'                                             11630000
         SPACE 2                                                        11640000
BLD77MOR DS    0H                                                       11650000
         LA    R5,MOR77OPT             Display options + status         11660000
         B     BLDSTAT                 Join common                      11670000
         SPACE 1                                                        11680000
MOR77OPT EQU   *                                                        11690000
         DC    AL1(WCCUNLK,FLDHIPRO,FLDPROT)                            11700000
         DC    CL9'MORE...'                                             11710000
         SPACE 2                                                        11720000
BLD77NAC DS    0H                                                       11730000
         LA    R5,NAC77OPT             Display options + status         11740000
         B     BLDSTAT                 Join common                      11750000
         SPACE 1                                                        11760000
NAC77OPT EQU   *                                                        11770000
         DC    AL1(WCCBEEP,FLDHIPRO,0)                                  11780000
         DC    CL18'NOT ACCEPTED'                                       11790000
         SPACE 3                                                        11800000
STATOPT  DSECT ,                                                        11810000
STATWCC  DS    XL1                                                      11820000
STATATT1 DS    XL1                                                      11830000
STATATT2 DS    XL1                                                      11840000
STATMSG  DS    0C                                                       11850000
         SPACE 1                                                        11860000
HDKGRC   CSECT ,                                                        11870000
* +---------------------------------------------------------            11880000
* +      Common status area update channel program                      11890000
* +---------------------------------------------------------            11900000
         SPACE 1                                                        11910000
BLDSTAT  DS    0H                                                       11920000
         USING STATOPT,R5              Address the options              11930000
         MVC   GRFCCW1(STA77CPL),STA77CP  Channel program               11940000
         MVC   GRFXBUFF(STA77DSL),STA77DS Data stream                   11950000
*                                                                       11960000
         LA    R1,STA77DSL             Set data stream length           11970000
         STH   R1,GRFCCW2+6              into the write CCW             11980000
         LA    R1,GRFXBUFF             Data stream goes here            11990000
         STCM  R1,7,GRFCCW2+1          plug in CCW address              12000000
*                                                                       12010000
         USING STA77DS,R1              Fill in variables                12020000
         MVC   STA77WCC,STATWCC        Set WCC from options             12030000
         MVC   STA77SBA,GRFX@STA       ... status area buffer addr      12040000
         MVC   STA77AT1,STATATT1       ... status area attribute        12050000
*                                                                       12060000
         CLI   STATATT2,0              long status?                     12070000
         BNE   STASTD                  ..no, continue below             12080000
         MVC   STA77LMS,STATMSG        ..yes...move it                  12090000
         MVI   STA77SF4,SF             Set ending attribute             12100000
         MVC   STA77AT4,GRFXATOA       .. maybe hilite row 0?           12110000
*                                                                       12120000
         LA    R0,STA77LML             Set correct length               12130000
         STH   R0,GRFCCW2+6            ...                              12140000
         B     GOODEXIT                and return to caller             12150000
*                                                                       12160000
STASTD   DS    0H                                                       12170000
         MVC   STA77SMS,STATMSG        Set status                       12180000
         MVI   STA77SF2,SF             SysId attr                       12190000
         MVC   STA77AT2,STATATT2       as per options                   12200000
         MVC   STA77SID,GRFXSID        Move in systemId                 12210000
         MVI   STA77SF3,SF             Set ending attribute             12220000
         MVC   STA77AT3,GRFXATOA       .. maybe hilite row 0?           12230000
*                                                                       12240000
         LA    R0,STA77SML             Set correct length               12250000
         STH   R0,GRFCCW2+6            ...                              12260000
         B     GOODEXIT                and return to caller             12270000
         SPACE 1                                                        12280000
         POP   USING                                                    12290000
         SPACE 3                                                        12300000
*-------------------------------------------------------------          12310000
*        Status update Channel Program template                         12320000
*-------------------------------------------------------------          12330000
         SPACE 1                                                        12340000
STA77CP  DS    0D                                                       12350000
         CCW   CCWSEL,0,SILI+CC,1      Select                           12360000
         CCW   CCWWRT,*-*,SILI,*-*     Write: WCC, etc                  12370000
STA77CPL EQU   *-STA77CP                                                12380000
         SPACE 1                                                        12390000
*-------------------------------------------------------------          12400000
*        Status update Data Stream template                             12410000
*-------------------------------------------------------------          12420000
         SPACE 1                                                        12430000
STA77DS  EQU   *                                                        12440000
STA77WCC DC    AL1(*-*)                WCC depends on options           12450000
         DC    AL1(SBA)                                                 12460000
STA77SBA DC    AL2(*-*)                Status Area buffer address       12470000
         DC    AL1(SF)                                                  12480000
STA77AT1 DC    AL1(*-*)                Attribute from options           12490000
*                                                                       12500000
STA77STA EQU   *                       Variable based on option         12510000
*                                                                       12520000
STA77SMS DC    CL9'*-*'                Short status                     12530000
STA77SF2 DC    AL1(SF)                                                  12540000
STA77AT2 DC    AL1(*-*)                SysId attr                       12550000
STA77SID DC    CL8'*-*'                                                 12560000
STA77SF3 DC    AL1(SF)                 Output area attr                 12570000
STA77AT3 DC    AL1(*-*)                                                 12580000
STA77SML EQU   *-STA77DS                                                12590000
*                                                                       12600000
         ORG   STA77STA                Redefine for long status         12610000
STA77LMS DC    CL18'*-*'               long status                      12620000
STA77SF4 DC    AL1(SF)                 Output area attr                 12630000
STA77AT4 DC    AL1(*-*)                row 9 attribute                  12640000
STA77LML EQU   *-STA77DS                                                12650000
         ORG   ,                                                        12660000
STA77DSL EQU   *-STA77DS                                                12670000
         EJECT ,                                                        12680000
* +--------------------------------------------------------+            12690000
* |                                                        |            12700000
* |      R U N : Set status area to RUNNING                |            12710000
* |                                                        |            12720000
* |      Input:                                            |            12730000
* |      none                                              |            12740000
* |                                                        |            12750000
* |      0B    (Select)                                    |            12760000
* |      01    (Write) WCC krreset+clear MDTs              |            12770000
* |                    SBA @inpt                           |            12780000
* |                    SF prot-low+MDT                     |            12790000
* |                    SBA @stat                           |            12800000
* |                    SF prot-low                         |            12810000
* |                    CL9'RUNNING'                        |            12820000
* |                    SF prot-low                         |            12830000
* |                    CL8'sysid'                          |            12840000
* |                    SF prot-low   s/b last screen cell  |            12850000
* |                                                        |            12860000
* +--------------------------------------------------------+            12870000
         SPACE 1                                                        12880000
         PUSH  USING                                                    12890000
BLD77RUN DS    0H                                                       12900000
         MVC   GRFCCW1(RUN77CPL),RUN77CP  Channel program               12910000
         MVC   GRFXBUFF(RUN77DSL),RUN77DS Data stream                   12920000
*                                                                       12930000
         LA    R1,RUN77DSL             Set data stream length           12940000
         STH   R1,GRFCCW2+6              into the write CCW             12950000
         LA    R1,GRFXBUFF             Data stream goes here            12960000
         STCM  R1,7,GRFCCW2+1          plug in CCW address              12970000
*                                                                       12980000
         USING RUN77DS,R1              Fill in variables                12990000
         MVC   RUN77AD1,GRFX@INP       ... input area buffer addr       13000000
         MVC   RUN77AD2,GRFX@STA       ... status area buffer addr      13010000
         MVC   RUN77SID,GRFXSID        Move in systemId                 13020000
         MVC   RUN77ATT,GRFXATOA       .. maybe hilite row 0?           13030000
*                                                                       13040000
         B     GOODEXIT                and return to caller             13050000
         SPACE 1                                                        13060000
         POP   USING                                                    13070000
         SPACE 3                                                        13080000
*-------------------------------------------------------------          13090000
*        RUNNUNG status Channel Program template                        13100000
*-------------------------------------------------------------          13110000
         SPACE 1                                                        13120000
RUN77CP  DS    0D                                                       13130000
         CCW   CCWSEL,0,SILI+CC,1      Select                           13140000
         CCW   CCWWRT,*-*,SILI,*-*     Write: WCC, etc                  13150000
RUN77CPL EQU   *-RUN77CP                                                13160000
         SPACE 1                                                        13170000
*-------------------------------------------------------------          13180000
*        RUNNUNG status Data Stream template                            13190000
*-------------------------------------------------------------          13200000
         SPACE 1                                                        13210000
RUN77DS  EQU   *                                                        13220000
         DC    AL1(WCCNMDT)            Reset kbd and clear MDTs         13230000
         DC    AL1(SBA)                                                 13240000
RUN77AD1 DC    AL2(*-*)                Input area buffer address        13250000
         DC    AL1(SF)                                                  13260000
         DC    AL1(FLDCHNG)            Unprotected, low, mdt            13270000
         DC    AL1(SBA)                                                 13280000
RUN77AD2 DC    AL2(*-*)                Status area buffer address       13290000
         DC    AL1(SF,FLDPROT)                                          13300000
         DC    CL9'RUNNING'                                             13310000
         DC    AL1(SF,FLDPROT)         Sysid attr                       13320000
RUN77SID DC    CL8'sysid'                                               13330000
         DC    AL1(SF)                                                  13340000
RUN77ATT DC    AL1(*-*)                Hilite for row 0                 13350000
RUN77DSL EQU   *-RUN77DS                                                13360000
         EJECT ,                                                        13370000
* +--------------------------------------------------------+            13380000
* |                                                        |            13390000
* |      V M R : Set status area to VM READ                |            13400000
* |      V M P : Set status area to VM READ (w/inhibit)    |            13410000
* |      C P R : Set status area to CP READ                |            13420000
* |      C P P : Set status area to CP READ (w/inhibit)    |            13430000
* |                                                        |            13440000
* |      Input:                                            |            13450000
* |      none                                              |            13460000
* |                                                        |            13470000
* |      0B    (Select)                                    |            13480000
* |      01    (Write) WCC krreset+clear MDTs              |            13490000
* |                    SBA @inpt                           |            13500000
* |                    SF not-prot+MDT  or hidden+MDT      |            13510000
* |                    SBA @stat                           |            13520000
* |                    SF prot-high                        |            13530000
* |                    CL9'xx READ                         |            13540000
* |                    SF prot-low                         |            13550000
* |                    CL8'sysid'                          |            13560000
* |                    SF prot-low   s/b last screen cell  |            13570000
* |                                                        |            13580000
* +--------------------------------------------------------+            13590000
         SPACE 1                                                        13600000
         PUSH  USING                                                    13610000
BLD77VMR DS    0H                                                       13620000
         LA    R0,FLDCHNG              Input area attribute             13630000
         B     BLD77VMX                join common code                 13640000
         SPACE 1                                                        13650000
BLD77VMP DS    0H                                                       13660000
         LA    R0,FLDHIDMT             Hide input area                  13670000
BLD77VMX DS    0H                                                       13680000
         LA    R2,=CL9'VM READ'        Status area value                13690000
         B     BLDREAD                 join common code                 13700000
         SPACE 1                                                        13710000
BLD77CPR DS    0H                                                       13720000
         LA    R0,FLDCHNG              Input area attribute             13730000
         B     BLD77CPX                join common code                 13740000
         SPACE 1                                                        13750000
BLD77CPP DS    0H                                                       13760000
         LA    R0,FLDHIDMT             Hide input area                  13770000
BLD77CPX DS    0H                                                       13780000
         LA    R2,=CL9'CP READ'        Status area value                13790000
*        B     BLDREAD                 join common code                 13800000
         SPACE 2                                                        13810000
* +---------------------------------------------------------            13820000
* +      Common VM/CP READ status area logic                            13830000
* +---------------------------------------------------------            13840000
         SPACE 1                                                        13850000
BLDREAD  DS    0H                                                       13860000
         MVC   GRFCCW1(RDR77CPL),RDR77CP  Channel program               13870000
         MVC   GRFXBUFF(RDR77DSL),RDR77DS Data stream                   13880000
*                                                                       13890000
         LA    R1,RDR77DSL             Set data stream length           13900000
         STH   R1,GRFCCW2+6              into the write CCW             13910000
         LA    R1,GRFXBUFF             Data stream goes here            13920000
         STCM  R1,7,GRFCCW2+1          plug in CCW address              13930000
*                                                                       13940000
         USING RDR77DS,R1              Fill in variables                13950000
         MVC   RDR77AD1,GRFX@INP       ... input area buffer addr       13960000
         STC   R0,RDR77ATT             ... input area attribute         13970000
*                                                                       13980000
         MVC   RDR77AD2,GRFX@STA       Status area buffer address       13990000
         MVC   RDR77STA,0(R2)          Status message                   14000000
         MVC   RDR77SID,GRFXSID        Move in systemId                 14010000
         MVC   RDR77ATZ,GRFXATOA       .. maybe hilite row 0?           14020000
*                                                                       14030000
         B     GOODEXIT                and return to caller             14040000
         SPACE 1                                                        14050000
         POP   USING                                                    14060000
         SPACE 3                                                        14070000
*-------------------------------------------------------------          14080000
*        VM/CP READ Channel Program template                            14090000
*-------------------------------------------------------------          14100000
         SPACE 1                                                        14110000
RDR77CP  DS    0D                                                       14120000
         CCW   CCWSEL,0,SILI+CC,1      Select                           14130000
         CCW   CCWWRT,*-*,SILI,*-*     Write: WCC, etc                  14140000
RDR77CPL EQU   *-RDR77CP                                                14150000
         SPACE 1                                                        14160000
*-------------------------------------------------------------          14170000
*        VM/CP READ Data Stream template                                14180000
*-------------------------------------------------------------          14190000
         SPACE 1                                                        14200000
RDR77DS  EQU   *                                                        14210000
         DC    AL1(WCCNMDT)            WCC depends on options           14220000
         DC    AL1(SBA)                                                 14230000
RDR77AD1 DC    AL2(*-*)                Input Area buffer address        14240000
         DC    AL1(SF)                                                  14250000
RDR77ATT DC    AL1(*-*)                Input area attribute             14260000
         DC    AL1(SBA)                                                 14270000
RDR77AD2 DC    AL2(*-*)                Status area buffer address       14280000
         DC    AL1(SF,FLDHIPRO)        Attribute from options           14290000
RDR77STA DC    CL9'*-*'                Short status                     14300000
         DC    AL1(SF,FLDPROT)                                          14310000
RDR77SID DC    CL8'sysid'                                               14320000
         DC    AL1(SF)                                                  14330000
RDR77ATZ DC    AL1(*-*)                Hilite for row 0                 14340000
RDR77DSL EQU   *-RDR77DS                                                14350000
         EJECT ,                                                        14360000
* +--------------------------------------------------------+            14370000
* |                                                        |            14380000
* |      W N G : Sound the alarm on the terminal           |            14390000
* |                                                        |            14400000
* |      0B (Select)                                       |            14410000
* |      01 (Write) WCC                                    |            14420000
* |                 SBA @inpt                              |            14430000
* |      06 (RM)    buffer                                 |            14440000
* |                                                        |            14450000
* +--------------------------------------------------------+            14460000
         SPACE 1                                                        14470000
         PUSH  USING                                                    14480000
BLD77WNG DS    0H                                                       14490000
         MVC   GRFCCW1(WNG77CPL),WNG77CP  Channel program               14500000
         MVC   GRFXBUFF(WNG77DSL),WNG77DS Data stream                   14510000
*                                                                       14520000
         LA    R1,WNG77DSL             Set data stream length           14530000
         STH   R1,GRFCCW2+6              into the write CCW             14540000
         LA    R1,GRFXBUFF             Data stream goes here            14550000
         STCM  R1,7,GRFCCW2+1          plug in CCW address              14560000
         B     GOODEXIT                                                 14570000
         SPACE 1                                                        14580000
         POP   USING                                                    14590000
         SPACE 3                                                        14600000
*-------------------------------------------------------------          14610000
*        WNG (warning) Channel Program template                         14620000
*-------------------------------------------------------------          14630000
         SPACE 1                                                        14640000
WNG77CP  DS    0D                                                       14650000
         CCW   CCWSEL,0,SILI+CC,1      Select                           14660000
         CCW   CCWWRT,*-*,SILI,*-*     Write: WCC, etc                  14670000
WNG77CPL EQU   *-RDR77CP                                                14680000
         SPACE 1                                                        14690000
*-------------------------------------------------------------          14700000
*        Warning Data Stream template                                   14710000
*-------------------------------------------------------------          14720000
         SPACE 1                                                        14730000
WNG77DS  EQU   *                                                        14740000
         DC    AL1(WCCBEEP)                                             14750000
WNG77DSL EQU   *-WNG77DS                                                14760000
         TITLE 'HDKGRC:HDKGRCRL  (CP)  VM370CE: VIRTUAL MACHINE/370 COMX14770000
               MUNITY EDITION'                                          14780000
***************************************************************         14790000
*                                                                       14800000
* METHOD NAME -                                                         14810000
*                                                                       14820000
*        HDKGRCRL                                                       14830000
*                                                                       14840000
* FUNCTION -                                                            14850000
*                                                                       14860000
*        Release any RDEV resources used building 327x                  14870000
*        channel programs                                               14880000
*                                                                       14890000
* ENTRY CONDITIONS -                                                    14900000
*                                                                       14910000
*        R8  = Address of the RDEVBLOK                                  14920000
*        R10 = IOBLOK pointer                                           14930000
*        R12 = Address of HDKGRCRL entry point                          14940000
*        R13 = Address of standard SAVEAREA                             14950000
*                                                                       14960000
* EXIT CONDITIONS -                                                     14970000
*                                                                       14980000
*        R15 = 0 : All resources released                               14990000
*                                                                       15000000
***************************************************************         15010000
         SPACE 3                                                        15020000
HDKGRCRL RELOC ,                                                        15030000
         SPACE 3                                                        15040000
*-------------------------------------------------------------          15050000
*        Clear any prior workareas, buffers, etc.                       15060000
*-------------------------------------------------------------          15070000
         SPACE 1                                                        15080000
         ICM   R7,15,IOBCCWRK          Access the GRFCCWS               15090000
         BZ    NOCCWRK                 do nothing if not there          15100000
         BAL   R14,RELEASE             clean out large buffer           15110000
         LA    R0,GRFCCWLD               and release IOBLOK linked      15120000
         LR    R1,R7                       CCW build/work area          15130000
         CALL  DMKFRET                 ...                              15140000
         SR    R0,R0                   and clear IOBLOK link            15150000
         ST    R0,IOBCCWRK             Chain it off the IOBLOK          15160000
NOCCWRK  DS    0H                                                       15170000
         SR    R15,R15                 CLean return code                15180000
         EXIT  ,                                                        15190000
         SPACE 3                                                        15200000
*-------------------------------------------------------------          15210000
*                                                                       15220000
*        RELEASE                                                        15230000
*                                                                       15240000
*        Common routine to clean up any workareas or buffers            15250000
*        left over from prior calls                                     15260000
*                                                                       15270000
*        Input:                                                         15280000
*        R7  = GRFCCWs pointer                                          15290000
*        R14 = return address                                           15300000
*                                                                       15310000
*        Exit:                                                          15320000
*        R0-R1 = zeroes                                                 15330000
*        GRFBUFFA = zeroes                                              15340000
*                                                                       15350000
*-------------------------------------------------------------          15360000
         SPACE 1                                                        15370000
RELEASE  DS    0H                                                       15380000
         ICM   R1,15,GRFBUFFA          Release prior large buffer       15390000
         BZR   R14                     not there.. just return          15400000
         ST    R14,SAVEWRK2            Save return address              15410000
         LH    R0,GRFBUFFL             Dword size                       15420000
         CALL  DMKFRET                 Release the storage              15430000
         SR    R0,R0                   Clear the pointer                15440000
         LR    R1,R0                   and address                      15450000
         ST    R0,GRFBUFFA             ...                              15460000
         STH   R0,GRFBUFFL             and length                       15470000
         L     R14,SAVEWRK2            Restore reurn address            15480000
         BR    R14                     Return to caller                 15490000
         TITLE 'HDKGRC           (CP)  VM370CE: VIRTUAL MACHINE/370 COMX15500000
               MUNITY EDITION'                                          15510000
         LTORG ,                                                        15520000
         EJECT ,                                                        15530000
         COPY  EQU                                                      15540000
         COPY  DEVTYPES                                                 15550000
         COPY  GRCWORK                                                  15560000
         COPY  HDK3270                                                  15570000
         COPY  VMBLOK                                                   15580000
         COPY  RBLOKS                                                   15590000
         COPY  GRFXBLOK                                                 15600000
         COPY  IOBLOKS                                                  15610000
         COPY  CONBUF                                                   15620000
         COPY  SAVE                                                     15630000
         COPY  TIMER                                                    15640000
         PSA                                                            15650000
         SPACE 3                                                        15660000
HDKGRC   CSECT ,                                                        15670000
         ORG   ,                                                        15680000
MODEND   DS    0D                      *** Mark module's end ***        15690000
         END                                                            15700000
