GRC      TITLE 'HDKGRC           (CP)  VM370CE: VIRTUAL MACHINE/370 COMX00010000
               MUNITY EDITION'                                          00020000
         ISEQ  73,80          Validate sequence numbers                 00030000
**********************************************************************  00040000
*                                                                       00050000
* MODULE NAME -                                                         00060000
*                                                                       00070000
*        HDKGRC                                                         00080000
*                                                                       00090000
* FUNCTION -                                                            00100000
*                                                                       00110000
*        Build all of the Channel Programs needed to manage             00120000
*        local display devices. The CCWs and associated data            00130000
*        streams will be tailored to fit the device type and            00140000
*        screen geometry.                                               00150000
*                                                                       00160000
* ATTRIBUTES -                                                          00170000
*                                                                       00180000
*        Reenterable, resident                                          00190000
*                                                                       00200000
* ENTRY POINTS -                                                        00210000
*                                                                       00220000
*        DMKGRCCW - Prepare channel programs                            00230000
*        DMKGRCRL - Release CCW resources from IOBLOK                   00240000
*                                                                       00250000
**********************************************************************  00260000
         EJECT ,                                                        00270000
         COPY  OPTIONS                                                  00280000
         COPY  LOCAL                                                    00290000
         SPACE 3                                                        00300000
HDKGRC   CSECT ,                                                        00310000
         DC    CL8'HDKGRC'             Module Id                        00320000
         DC    AL2(MODEND-HDKGRC)      Module length                    00330000
         DC    C'&SYSDATE',C'-'        Compile date                     00340000
         DC    C'&SYSTIME'             Compile time                     00350000
         SPACE 3                                                        00360000
         USING PSA,0                                                    00370000
         USING TRQBLOK,R5                                               00380000
         USING CONTASK,R6                                               00390000
         USING RDEVBLOK,R8                                              00400000
         USING GRFXBLOK,R9                                              00410000
         USING IOBLOK,R10                                               00420000
         USING VMBLOK,R11                                               00430000
         USING SAVEAREA,R13                                             00440000
         SPACE 3                                                        00450000
         EXTRN DMKBOXDS,DMKBOXBX,DMKBOX80                               00460000
         EXTRN DMKCVT12,DMKCVT14                                        00470000
         EXTRN HDKG66CP                                                 00480000
         TITLE 'HDKGRC:HDKGRCCW  (CP)  VM370CE: VIRTUAL MACHINE/370 COMX00490000
               MUNITY EDITION'                                          00500000
***************************************************************         00510000
*                                                                       00520000
* METHOD NAME -                                                         00530000
*                                                                       00540000
*        HDKGRCCW                                                       00550000
*                                                                       00560000
* FUNCTION -                                                            00570000
*                                                                       00580000
*        Build a local display device channel program                   00590000
*        and its associated data stream.                                00600000
*                                                                       00610000
* ENTRY CONDITIONS -                                                    00620000
*                                                                       00630000
*        R0  = Index of channel program to be built                     00640000
*        R8  = Address of the RDEVBLOK                                  00650000
*        R10 = Address of the IOBLOK                                    00660000
*        R11 = Address of the user's VMBLOK                             00670000
*        R12 = Address of HDKGRCCW entry point                          00680000
*        R13 = Address of standard SAVEAREA                             00690000
*                                                                       00700000
* EXIT CONDITIONS -                                                     00710000
*                                                                       00720000
*        R15 = 0 : The RDEVBLOK has been initialized                    00730000
*                                                                       00740000
*        R15 = 4 : A Read Partition Query was issued.                   00750000
*                  Wait for the Attention interrupt that                00760000
*                  will be generated. A call to HDKGINRD                00770000
*                  needs to be made when that interrupt occurs.         00780000
*                                                                       00790000
*        R15 = 8 : An I/O error occurred while trying th                00800000
*                  initialize the display device.                       00810000
*                                                                       00820000
* NOTES -                                                               00830000
*                                                                       00840000
*        Local display device initialization is invoked                 00850000
*        when an unsolicited Device-End is detected for                 00860000
*        an enabled device or when an ENABLE command is                 00870000
*        issued for a disabled device                                   00880000
*                                                                       00890000
***************************************************************         00900000
         SPACE 3                                                        00910000
HDKGRCCW RELOC ,                                                        00920000
         SPACE 3                                                        00930000
*-------------------------------------------------------------          00940000
*        3066 gets its own happy place                                  00950000
*-------------------------------------------------------------          00960000
         SPACE 1                                                        00970000
         CLI   RDEVTYPE,TYP3066        Ship old 3066 stuff              00980000
         BNE   CCW327X                 ... off to buffalo               00990000
         GOTO  HDKG66CP                3066 CCWs in separate place      01000000
         SPACE 3                                                        01010000
*-------------------------------------------------------------          01020000
*        Generate 327x channel programs and data streams                01030000
*-------------------------------------------------------------          01040000
         SPACE 1                                                        01050000
CCW327X  DS    0H                                                       01060000
         LR    R2,R0                   Save input parameter             01070000
         L     R9,RDEVGRFX             Get GRFXBLOK addressability      01080000
*
         ICM   R7,15,IOBCCWRK          Get channel program addressing   01080000
         BNZ   ROUTCALL                have it already                  01090000
         LA    R0,GRFCCWLD             1st call.. allocate the storage  01100000
         CALL  DMKFREE                 ...                              01110000
         XC    0(GRFCCWLN,R1),0(R1)    Clear it out
         ST    R1,IOBCCWRK             Chain it off the IOBLOK          01120000
         LR    R7,R1                   Set permanent aaddressing        01130000
         USING GRFCCWS,R7              ...                              01140000
         SPACE 1                                                        01100000
*-------------------------------------------------------------          01110000
*        Route based on display device type                             01120000
*-------------------------------------------------------------          01130000
         SPACE 1                                                        01140000
ROUTCALL DS    0H                                                       01150000
         BAL   R14,RELEASE             Release any prior work areas     01090000
*
         B     VECTOR77(R2)                                             01160000
VECTOR77 DS    0H                                                       01170000
         B     BADCALL        CPIX=0  bad call                          01180000
         B     BLD77RMI       CPIX=1  Read Manual Input                 01190000
         B     BLD77FMT       CPIX=2  Format screen w/logo              01200000
         B     BLD77WRT       CPIX=3  Write to output area              01210000
         B     BLD77CLR       CPIX=4  Clear screen                      01220000
         B     BLD77CLS       CPIX=5  Clear screen with Erase Write     01230000
         B     BLD77CRD       CPIX=6  Clear input area w/RUNNING        01240000
         B     BLD77MRD       CPIX=7  Clear input area w/o status       01250000
         B     BLD77IDS       CPIX=8  Write to input area               01260000
         B     BLD77TAB       CPIX=9  Insert a logical tab              01270000
         B     BLD77HLD       CPIX=10 Set status = HOLDING              01280000
         B     BLD77MOR       CPIX=11 Set status = MORE...              01290000
         B     BLD77NAC       CPIX=12 Set status = NOT ACCEPTED         01300000
         B     BLD77RUN       CPIX=13 Set status = RUNNING              01310000
         B     BLD77VMR       CPIX=14 Set status = VM READ              01320000
         B     BLD77CPR       CPIX=15 Set status = CP READ              01330000
         B     BLD77VMP       CPIX=16 Set status = VM READ inhibit      01340000
         B     BLD77CPP       CPIX=17 Set status = CP READ inhibit      01350000
         B     BLD77WNG       CPIX=18 Sound warning alarm               01360000
         SPACE 3                                                        01370000
GOODEXIT DS    0H                                                       01380000
         LA    R1,GRFCCW1              Default channel program          01390000
EXITR1   DS    0H                                                       01400000
         ST    R1,SAVER1               Return R1 = channel program      01410000
         XR    R15,R15                 and RC=0                         01420000
DOEXIT   DS    0H                                                       01430000
         EXIT  ,                                                        01440000
BADCALL  DS    0H                                                       01450000
         LA    R15,8                                                    01460000
         B     DOEXIT                                                   01470000
         EJECT ,                                                        01480000
***************************************************************         01490000
*                                                                       01500000
*        C V T 1 2                                                      01510000
*                                                                       01520000
*        Convert buffer address to encoded 12-bit if needed             01530000
*                                                                       01540000
***************************************************************         01550000
         SPACE 1                                                        01560000
CVT12    DS    0H                                                       01570000
         TM    RDEVGRIC,RDEVAD14       14-bit addressing                01580000
         BOR   R14                     yes, use addr as-is              01590000
         ST    R14,SAVEWRK2            Save return address              01600000
         CALL  DMKCVT12                Convert to 12-bit                01610000
         L     R14,SAVEWRK2            and return to caller             01620000
         BR    R14                                                      01630000
         SPACE 3                                                        01640000
***************************************************************         01650000
*                                                                       01660000
*        C V T 1 4                                                      01670000
*                                                                       01680000
*        Convert possibly encoded buffer address to                     01690000
*        14-bit linear buffer location                                  01700000
*                                                                       01710000
***************************************************************         01720000
         SPACE 1                                                        01730000
CVT14    DS    0H                                                       01740000
         ST    R14,SAVEWRK2            Save return address              01750000
         CALL  DMKCVT14                Convert to 12-bit                01760000
         L     R14,SAVEWRK2            and return to caller             01770000
         BR    R14                                                      01780000
         EJECT ,                                                        01790000
* +--------------------------------------------------------+            01800000
* |                                                        |            01810000
* |      R M I : Read Manual Input (327x)                  |            01820000
* |                                                        |            01830000
* |      Input:                                            |            01840000
* |      IOBMISC = read buffer address                     |            01850000
* |                                                        |            01860000
* |      0B (Select)                                       |            01870000
* |      01 (Write) WCC                                    |            01880000
* |                 SBA @inpt                              |            01890000
* |      06 (RM)    buffer                                 |            01900000
* |                                                        |            01910000
* +--------------------------------------------------------+            01920000
         SPACE 1                                                        01930000
         PUSH  USING                                                    01940000
BLD77RMI DS    0H                                                       01950000
         MVC   GRFCCW1(RMI77CPL),RMI77CP  Channel program               01960000
         MVC   GRFXBUFF(RMI77DSL),RMI77DS Data stream                   01970000
*                                                                       01980000
         LA    R1,RMI77DSL             Set data stream length           01990000
         STH   R1,GRFCCW2+6              into the write CCW             02000000
         LA    R1,GRFXBUFF             Data stream goes here            02010000
         STCM  R1,7,GRFCCW2+1          plug in CCW address              02020000
*                                                                       02030000
         USING RMI77DS,R1              Fill in variables                02040000
         MVC   RMI77SBA,GRFX@INP       ... input area buffer addr       02050000
*                                                                       02060000
         L     R1,IOBMISC              Caller-provided input buffer     02070000
         STCM  R1,7,GRFCCW3+1            goes into the RM CCW           02080000
         LA    R1,BUFINLTH*2           along with the buffer size       02090000
         STH   R1,GRFCCW3+6            ...                              02100000
*                                                                       02110000
         B     GOODEXIT                and all finished                 02120000
         SPACE 1                                                        02130000
         POP   USING                                                    02140000
         SPACE 3                                                        02150000
*-------------------------------------------------------------          02160000
*        RMI Channel Program template                                   02170000
*-------------------------------------------------------------          02180000
         SPACE 1                                                        02190000
RMI77CP  DS    0D                                                       02200000
         CCW   CCWSEL,0,SILI+CC,1       Select                          02210000
         CCW   CCWWRT,*-*,SILI+CC,*-*   Write: WCC, SBA @inpt           02220000
         CCW   CCWRM,*-*,SILI,*-*       Read Modified                   02230000
RMI77CPL EQU   *-RMI77CP                                                02240000
         SPACE 1                                                        02250000
*-------------------------------------------------------------          02260000
*        RMI Data Stream template                                       02270000
*-------------------------------------------------------------          02280000
         SPACE 1                                                        02290000
RMI77DS  EQU   *                                                        02300000
         DC    AL1(WCCDFLT)                                             02310000
         DC    AL1(SBA)                                                 02320000
RMI77SBA DC    AL2(*-*)                Input Area buffer address        02330000
RMI77DSL EQU   *-RMI77DS                                                02340000
         EJECT ,                                                        02350000
* +--------------------------------------------------------+            02360000
* |                                                        |            02370000
* |      F M T : Format screen with logo                   |            02380000
* |                                                        |            02390000
* |      Input:                                            |            02400000
* |      none                                              |            02410000
* |                                                        |            02420000
* |      05/0D (EW[A]) WCC kbreset+alarm                   |            02430000
* |                    SBA @stat                           |            02440000
* |                    SF prot-low                         |            02450000
* |                    CL9'ENABLED'                        |            02460000
* |                    SF prot-low                         |            02470000
* |                    CL8'sysid'                          |            02480000
* |                    SF prot-low   s/b last screen cell  |            02490000
* |                    C'VM/370 Online'                    |            02500000
* |                                                        |            02510000
* |                    for each logo row [                 |            02520000
* |                       SBA logo-addr                    |            02530000
* |                       logo data row                    |            02540000
* |                    ]                                   |            02550000
* |      03    (NOP)                                       |            02560000
* |                                                        |            02570000
* +--------------------------------------------------------+            02580000
         SPACE 1                                                        02590000
         PUSH  USING                                                    02600000
BLD77FMT DS    0H                                                       02610000
         MVC   GRFCCW1(FMT77CPL),FMT77CP                                02620000
         MVC   GRFCCW1(1),GRFXERAS     Put correct EW[A] opcode         02630000
*                                                                       02640000
         L     R5,=A(DMKBOXDS)         Access logo descriptor           02650000
         LH    R2,0(,R5)               Get row size                     02660000
         LH    R3,2(,R5)               Get row count                    02670000
*                                                                       02680000
*        Calculate the space needed                                     02690000
*                                                                       02700000
         LA    R5,3(,R2)               (row.size + 3)                   02710000
         MR    R4,R3                   * row.ct                         02720000
         LA    R5,FMT77DSL(,R5)        + preamble                       02730000
         STH   R5,GRFCCW1+6            = write length                   02740000
*                                                                       02750000
*        Allocate large datastream buffer                               02760000
*                                                                       02770000
         BAL   R14,RELEASE             Release any prior workarea       02780000
*                                                                       02790000
         LA    R0,7(,R5)               Alloc size in dwords             02800000
         SRL   R0,3                    dwords please                    02810000
         CALL  DMKFREE                 ... get it                       02830000
         STH   R0,GRFBUFFL             Save dwword length               02840000
         ST    R1,GRFBUFFA             save address                     02850000
         LR    R6,R1                   set addressability               02860000
*                                                                       02870000
*        Build orders in work area                                      02880000
*                                                                       02890000
FMT77OK1 DS    0H                                                       02900000
         STCM  R6,7,GRFCCW1+1          Set order addr in CCW            02910000
         L     R5,=A(DMKBOXBX)         Use the default logo             02920000
         CLI   INSTWRD1,C'8'           Is it really VM/380??            02930000
         BNE   *+8                     no.. all set to build logo       02940000
         L     R5,=A(DMKBOX80)         yes.. use alternate logo         02950000
*                                                                       02960000
         MVC   0(FMT77DSL,R6),FMT77DS                                   02970000
         USING FMT77DS,R6                                               02980000
         MVC   FMT77AD1,GRFX@INP       Input area attr addr             02990000
         MVC   FMT77SBA,GRFX@STA       Status area attr addr            03000000
         MVC   FMT77SID,GRFXSID        Move in systemId                 03010000
*                                                                       03020000
*        If we are running on Hercules-380, then update                 03030000
*        the "VM/370 Online" message to say "VM/380 Online"             03040000
*                                                                       03050000
         MVC   FMT77VMO+4(1),INSTWRD1  zap with 7 or 8 from PSA         03060000
*                                                                       03070000
*        Calculate starting buffer address                              03080000
*                                                                       03090000
         LH    R4,GRFXROWS             Screen rows                      03100000
         S     R4,F2                   - 2                              03110000
         SR    R4,R3                   - logo rows                      03120000
         SRL   R4,1                    / 2 = starting row               03130000
         MH    R4,GRFXCOLS             * cols = address                 03140000
*                                                                       03150000
         LH    R1,GRFXCOLS             Screen cols                      03160000
         SR    R1,R2                   - logo cols                      03170000
         SRL   R1,1                    / 2 = starting col               03180000
*                                                                       03190000
         AR    R4,R1                   row+col = buffer addr            03200000
*                                                                       03210000
         LA    R6,FMT77DSL(,R6)        Build the logo here              03220000
         BCTR  R2,0                    row size - 1 for EX              03230000
*                                                                       03240000
FMT77LP  DS    0H                                                       03250000
         LR    R1,R4                   Current buffer address           03260000
         BAL   R14,CVT12               Make the proper buffer address   03270000
         MVI   0(R6),SBA               Move to next row                 03280000
         STCM  R1,3,1(R6)              ...                              03290000
*                                                                       03300000
         EX    R2,FMT77MVC             Move in next logo row            03310000
*                                                                       03320000
         LA    R6,3+1(R2,R6)           Bump buffer target               03330000
         LA    R5,1(R2,R5)             Bump to next logo row            03340000
         AH    R4,GRFXCOLS             Bump buffer addr                 03350000
*                                                                       03360000
         BCT   R3,FMT77LP              and build the whole logo         03370000
*                                                                       03380000
         MVI   GRFXATOA,FLDPROT        Attribute in lower right         03390000
*                                                                       03400000
         B     GOODEXIT                                                 03410000
         SPACE 1                                                        03420000
FMT77MVC MVC   3(*-*,R6),0(R5)         *** Executed ***                 03430000
         SPACE 1                                                        03440000
         POP   USING                                                    03450000
         SPACE 3                                                        03460000
*-------------------------------------------------------------          03470000
*        FMT Channel Program template                                   03480000
*-------------------------------------------------------------          03490000
         SPACE 1                                                        03500000
FMT77CP  DS    0D                                                       03510000
         CCW   CCWEW,*-*,SILI+CC,*-*   Erase Write [Alternate]          03520000
         CCW   CCWNOP,0,SILI,1         NOP to get CE+DE together        03530000
FMT77CPL EQU   *-FMT77CP                                                03540000
         SPACE 1                                                        03550000
*-------------------------------------------------------------          03560000
*        FMT Data Stream template                                       03570000
*-------------------------------------------------------------          03580000
         SPACE 1                                                        03590000
FMT77DS  EQU   *                                                        03600000
         DC    AL1(WCCUNLK+WCCALARM)                                    03610000
         DC    AL1(SBA)                                                 03620000
FMT77AD1 DC    AL2(*-*)                input area buffer address        03630000
         DC    AL1(SF,FLDPROT+FAHIDE)  Hidden/protected                 03640000
         DC    AL1(IC)                                                  03650000
         DC    AL1(SBA)                                                 03660000
FMT77SBA DC    AL2(*-*)                status area buffer address       03670000
         DC    AL1(SF,FLDPROT)                                          03680000
         DC    CL9'ENABLED'                                             03690000
         DC    AL1(SF,FLDPROT)                                          03700000
FMT77SID DC    CL8'sysid'                                               03710000
         DC    AL1(SF,FLDPROT)                                          03720000
FMT77VMO DC    CL20'VM/370 Online'                                      03730000
FMT77DSL EQU   *-FMT77DS                                                03740000
         EJECT ,                                                        03750000
* +--------------------------------------------------------+            03760000
* |                                                        |            03770000
* |      W R T : Write to output area                      |            03780000
* |                                                        |            03790000
* |      Input:                                            |            03800000
* |      R4:       number of screen lines to write         |            03810000
* |      R5:       TRQBLOK address                         |            03820000
* |      R6:       CONTASK address                         |            03830000
* |      CONCNT:   length of data                          |            03840000
* |      CONDATA:  data to write                           |            03850000
* |      RDEVCORD: 1st screen line to write                |            03860000
* |                                                        |            03870000
* |      0B (Select)                                       |            03880000
* |                                                        |            03890000
* |      01 (Write) or 05 (EW) or 0D (EWA)                 |            03900000
* |                                                        |            03910000
* |         WCC kbreset                                    |            03920000
* |         if !hilight:                                   |            03930000
* |            SBA target-row, col-0                       |            03940000
* |         else                                           |            03950000
* |            if target-row == 0:                         |            03960000
* |               SBA 0,0                                  |            03970000
* |            else:                                       |            03980000
* |               SBA (target-row, 0) - 1                  |            03990000
* |               SF prot-high                             |            04000000
* |                                                        |            04010000
* |      00 data chained                                   |            04020000
* |                                                        |            04030000
* |          caller's data                                 |            04040000
* |                                                        |            04050000
* |      00 data chained                                   |            04060000
* |                                                        |            04070000
* |         if hilight && not ending on last row:          |            04080000
* |            SBA last row, end col                       |            04090000
* |            SF  prot-low                                |            04100000
* |                                                        |            04110000
* |         SBA @inpt                                      |            04120000
* |         SF  unprot+mdt                                 |            04130000
* |         SBA @stat                                      |            04140000
* |         SF  prot-low                                   |            04150000
* |         RUNNING                                        |            04160000
* |         SF  prot-low                                   |            04170000
* |         sysid                                          |            04180000
* |         if target-row == 0:                            |            04190000
* |            SF  prot-high                               |            04200000
* |         else                                           |            04210000
* |            SF  prot-low                                |            04220000
* |                                                        |            04230000
* +--------------------------------------------------------+            04240000
         SPACE 1                                                        04250000
         PUSH  USING                                                    04260000
BLD77WRT DS    0H                                                       04270000
         MVC   GRFCCW1(WRT77CPL),WRT77CP  Move in model                 04280000
*! TODO  DMKGRF is expecting this value here but it
*        should probably be put in its own place..
*        maybe a new, separate field in CONTASK?         
         STC   R4,CONCCW1+5               Save number of lines          04290000
         MVC   GRFXBUFF(WRT77DSL),WRT77DS Data stream model             04300000
*                                                                       04310000
         LA    R3,GRFXBUFF             Address the data stream          04320000
         STCM  R3,7,GRFCCW2+1          Set the preamble CCW data addr   04330000
         USING WRT77DS,R3                                               04340000
*                                                                       04350000
         TM    RDEVSTA3,RDEVEWRT       Erase/write required?            04360000
         BZ    WRTNOEW                 No                               04370000
         NI    RDEVSTA3,255-RDEVEWRT   Turn off flag                    04380000
         MVC   GRFCCW2(1),GRFXERAS     Set erase CCW opcode             04390000
WRTNOEW  DS    0H                                                       04400000
*                                                                       04410000
*        Calculate starting buffer address                              04420000
*                                                                       04430000
         SR    R1,R1                   Get current line position        04440000
         IC    R1,RDEVCORD             ...                              04450000
         TM    TRQBFLAG,CRTSIO         Diag58 writing to input area?    04460000
         BZ    *+8                     no, RDEVCORD is good             04470000
         IC    R1,TRQBLINE             yes, get Diag58 line number      04480000
         STC   R1,SAVEWRK1             (save starting buffer address)   04490000
         AR    R4,R1                   also calc ending line number     04500000
         MH    R1,GRFXCOLS             * col count = raw buffer addr    04510000
*                                                                       04520000
*        Build preamble data stream                                     04530000
*                                                                       04540000
         TM    CONPARM2,HILIGHT/256    Is the HILIGHT option on?        04550000
         BZ    WRTNOHI1                no, take the simple path         04560000
         LTR   R1,R1                   Writing to first line?           04570000
         BZ    WRTLN0                  yes, special case                04580000
         BCTR  R1,0                    no, set attr on line above       04590000
         LA    R2,WRT77LN2             Set preamble data length         04600000
         B     WRTADDR1                join below                       04610000
*                                                                       04620000
*        Here, the first line on the screen is to be hilighted.         04630000
*        We will just set a value of the bottom right attribute         04640000
*        that also referenced whenever the status area is displayed.    04650000
*                                                                       04660000
WRTLN0   DS    0H                                                       04670000
         MVI   GRFXATOA,FLDHIPRO       Set hilite attr for first line   04680000
*                                                                       04690000
*        Here for all non-hilighted and when the 1st line               04700000
*        is to be lighted. In this case, the SBA to set the             04710000
*        output line is the same: the start og the target line          04720000
*        This is setting up for just: WCC SBA(line#,0) preamble.        04730000
*                                                                       04740000
WRTNOHI1 DS    0H                                                       04750000
         LA    R2,WRT77LN1             Set basic prefix data length     04760000
*                                                                       04770000
WRTADDR1 DS    0H                                                       04780000
         STH   R2,GRFCCW2+6            Set preamble data stream length  04790000
*                                                                       04800000
         BAL   R14,CVT12               Make a proper buffer address     04810000
         STCM  R1,3,WRT77AD1           Set addr in data stream          04820000
*                                                                       04830000
*        Fill in user's data adr & length                               04840000
*                                                                       04850000
         LA    R1,CONDATA              User's data address              04860000
         STCM  R1,7,GRFCCW3+1          ...                              04870000
         LH    R1,CONCNT               and its length                   04880000
         STH   R1,GRFCCW3+6            ...                              04890000
*                                                                       04900000
*        Build footer based on HILITE and ending row                    04910000
*                                                                       04920000
         TM    CONPARM2,HILIGHT/256    Is the HILIGHT option on?        04930000
         BZ    WRTNOHI2                no, take the simple path         04940000
         CLM   R4,1,GRFXINL1           Ended on last output line        04970000
         BE    WRTNOHI2                yes, the InArea attr is enough   04980000
*                                                                       04990000
*        Suffix needs to first end the HILITE                           05000000
*                                                                       05010000
         MH    R4,GRFXCOLS             put attr at end of last line     05020000
         BCTR  R4,0                      of HILITE output               05030000
         LR    R1,R4                   Convert hilite end addr          05040000
         BAL   R14,CVT12                 to a proper buffer address     05050000
         STCM  R1,3,WRT77AD2           end-HILITE addr to data stream   05060000
         LA    R1,WRT77SF1             use large suffix                 05070000
         LA    R2,WRT77LN3             ...                              05080000
         B     WRTDOSFX                and join below                   05090000
*                                                                       05100000
*        Simple suffix if not HILITE                                    05110000
*        or HILITE ended on last output area line                       05130000
*                                                                       05140000
WRTNOHI2 DS    0H                                                       05150000
         LA    R1,WRT77SF2             use shorter suffix               05160000
         LA    R2,WRT77LN4             ...                              05170000
*                                                                       05180000
*        Build the common part of suffix                                05190000
*                                                                       05200000
WRTDOSFX DS    0H                                                       05210000
         STCM  R1,7,GRFCCW4+1          Set suffix address               05220000
         STH   R2,GRFCCW4+6              and length in the CCW          05230000
*                                                                       05240000
         MVC   WRT77AD3,GRFX@INP       Set @inpt buffer address         05250000
         MVC   WRT77AD4,GRFX@STA       Set @stat buffer address         05260000
         MVC   WRT77SID,GRFXSID        Move in systemId                 05270000
         MVC   WRT77ATT,GRFXATOA       Set lower right attr             05280000
*                                                                       05290000
         TM    CONPARM,ALARM           Alarm with message??             05310000
         BZ    GOODEXIT                no, just exit                    05320000
         OI    TRQBFLAG,CRTALRM        Flag screen alarm                05330000
         OI    WRT77WCC,WCCALARM       Add alaarm bit to WCC            05340000
         B     GOODEXIT                  and return to caller           05350000
*                                                                       05360000
         POP   USING                                                    05370000
         SPACE 3                                                        05380000
*-------------------------------------------------------------          05390000
*        WRT Channel Program template                                   05400000
*-------------------------------------------------------------          05410000
         SPACE 1                                                        05420000
WRT77CP  DS    0D                                                       05430000
         CCW   CCWSEL,0,SILI+CC,1       Select                          05440000
         CCW   CCWWRT,*-*,SILI+CD,*-*   Write: WCC, etc heading         05450000
         CCW   0,*-*,SILI+CD,*-*        Write output data               05460000
         CCW   0,*-*,SILI,*-*           Write trailer                   05470000
WRT77CPL EQU   *-WRT77CP                                                05480000
         SPACE 1                                                        05490000
*-------------------------------------------------------------          05500000
*        WRT Data Stream template                                       05510000
*-------------------------------------------------------------          05520000
         SPACE 1                                                        05530000
WRT77DS  EQU   *                                                        05540000
WRT77WCC DC    AL1(WCCUNLK)            unlock keyboard                  05550000
         DC    AL1(SBA)                                                 05560000
WRT77AD1 DC    AL2(*-*)                line addr                        05570000
WRT77LN1 EQU   *-WRT77DS               heading len (!hilite or line 0)  05580000
*                                                                       05590000
         DC    AL1(SF,FLDHIPRO)        hilite not line 0                05600000
WRT77LN2 EQU   *-WRT77DS               heading len (w/hilite not row 0) 05610000
*                                                                       05620000
*        then output data goes here                                     05630000
*                                                                       05640000
WRT77SF1 EQU   *                       footer (hilite not row 0)        05650000
         DC    AL1(SBA)                                                 05660000
WRT77AD2 DC    AL2(*-*)                line end addr                    05670000
         DC    AL1(SF,FLDPROT)                                          05680000
*                                                                       05690000
WRT77SF2 EQU   *                                                        05700000
         DC    AL1(SBA)                                                 05710000
WRT77AD3 DC    AL2(*-*)                Input area buffer address        05720000
         DC    AL1(SF,FLDCHNG)                                          05730000
         DC    AL1(SBA)                                                 05740000
WRT77AD4 DC    AL2(*-*)                Status area buffer address       05750000
         DC    AL1(SF,FLDPROT)                                          05760000
         DC    CL9'RUNNING'                                             05770000
         DC    AL1(SF,FLDPROT)                                          05780000
WRT77SID DC    CL8'sysid'                                               05790000
         DC    AL1(SF)                 Output area attr                 05800000
WRT77ATT DC    AL1(*-*)                FLDPROT or HIPRO if hilite ln 0  05810000
*                                                                       05820000
WRT77LN3 EQU   *-WRT77SF1              len of hilite not row 0          05830000
WRT77LN4 EQU   *-WRT77SF2              others                           05840000
*                                                                       05850000
WRT77DSL EQU   *-WRT77DS               total length for move            05860000
         EJECT ,                                                        05870000
* +--------------------------------------------------------+            05880000
* |                                                        |            05890000
* |      C L R : Clear & format the whole screen           |            05900000
* |                                                        |            05910000
* |      Input:                                            |            05920000
* |      none                                              |            05930000
* |                                                        |            05940000
* |      0B (Select)                                       |            05950000
* |      01 (Write) WCC kbreset                            |            05960000
* |                 SBA 0,0                                |            05970000
* |                 RA  @inpt;0                            |            05980000
* |                 SF  unprotected, low, mdt              |            05990000
* |                 IC                                     |            06000000
* |                 SBA @stat                              |            06010000
* |                 SF  prot-low                           |            06020000
* |                 CL9'RUNNING'                           |            06030000
* |                 SF  prot-low                           |            06040000
* |                 CL8'sysid'                             |            06050000
* |                 SF  prot-low                           |            06060000
* |                                                        |            06070000
* |      note: Vanilla VM/370 does the RA in 480-byte      |            06080000
* |            chunks. The component description manuals   |            06090000
* |            only talk about that limitation for the     |            06100000
* |            remote terminals: 3275 and 3172 controller  |            06110000
* |                                                        |            06120000
* +--------------------------------------------------------+            06130000
         SPACE 1                                                        06140000
         PUSH  USING                                                    06150000
BLD77CLR DS    0H                                                       06160000
         MVC   GRFCCW1(CLR77CPL),CLR77CP  Channel program               06170000
         MVC   GRFXBUFF(CLR77DSL),CLR77DS Data stream                   06180000
*                                                                       06190000
         LA    R1,CLR77DSL             Set data stream length           06200000
         STH   R1,GRFCCW2+6              into the write CCW             06210000
         LA    R3,GRFXBUFF             Data stream goes here            06220000
         STCM  R3,7,GRFCCW2+1          plug in CCW address              06230000
*                                                                       06240000
         USING CLR77DS,R3              Fill in variables                06250000
         SR    R1,R1                   Set home addr                    06260000
         BAL   R14,CVT12               Make a proper buffer address     06270000
         STCM  R1,3,CLR77AD1           Set top-left buffer addr         06280000
         MVC   CLR77AD2,GRFX@INP       Set input area addr              06290000
         MVC   CLR77AD3,GRFX@STA       Set status area addr             06300000
         MVC   CLR77SID,GRFXSID        Move in systemId                 06310000
*                                                                       06320000
         MVI   GRFXATOA,FLDPROT        reset bottom right attr          06330000
*                                                                       06340000
         B     GOODEXIT                all set.. return to caller       06350000
         SPACE 1                                                        06360000
         POP   USING                                                    06370000
         SPACE 3                                                        06380000
*-------------------------------------------------------------          06390000
*        CLR Channel Program template                                   06400000
*-------------------------------------------------------------          06410000
         SPACE 1                                                        06420000
CLR77CP  DS    0D                                                       06430000
         CCW   CCWSEL,0,SILI+CC,1       Select                          06440000
         CCW   CCWWRT,*-*,SILI,*-*      Write: WCC, etc heading         06450000
CLR77CPL EQU   *-CLR77CP                                                06460000
         SPACE 1                                                        06470000
*-------------------------------------------------------------          06480000
*        CLR Data Stream template                                       06490000
*-------------------------------------------------------------          06500000
         SPACE 1                                                        06510000
CLR77DS  EQU   *                                                        06520000
         DC    AL1(WCCUNLK)            unlock keyboard                  06530000
         DC    AL1(SBA)                                                 06540000
CLR77AD1 DC    AL2(*-*)                0,0                              06550000
         DC    AL1(RA)                                                  06560000
CLR77AD2 DC    AL2(*-*)                input area buffer address        06570000
         DC    AL1(SF,FLDCHNG)                                          06580000
         DC    AL1(IC)                                                  06590000
         DC    AL1(SBA)                                                 06600000
CLR77AD3 DC    AL2(*-*)                Status area buffer address       06610000
         DC    AL1(SF,FLDPROT)                                          06620000
         DC    CL9'RUNNING'                                             06630000
         DC    AL1(SF,FLDPROT)                                          06640000
CLR77SID DC    CL8'sysid'                                               06650000
         DC    AL1(SF,FLDPROT)         Bottom-right (OutArea) attr      06660000
*                                                                       06670000
CLR77DSL EQU   *-CLR77DS               data stream length               06680000
         EJECT ,                                                        06690000
* +--------------------------------------------------------+            06700000
* |                                                        |            06710000
* |      C L S : Clear screen with Erase Write             |            06720000
* |                                                        |            06730000
* |      Input:                                            |            06740000
* |      none                                              |            06750000
* |                                                        |            06760000
* |      05/0D (EW) WCC kbreset                            |            06770000
* |                 SBA @inpt                              |            06780000
* |                 SF  unprot+hidden+mdt                  |            06790000
* |                 IC                                     |            06800000
* |                 EUA @stat                              |            06810000
* |                 SBA @inpt                              |            06820000
* |                 SF  unprot+low+mdt                     |            06830000
* |                 SBA @stat                              |            06840000
* |                 SF  prot-low                           |            06850000
* |                 CL9'RUNNING'                           |            06860000
* |                 SF  prot-low                           |            06870000
* |                 CL8'sysid'                             |            06880000
* |                 SF  prot-low                           |            06890000
* |                                                        |            06900000
* +--------------------------------------------------------+            06910000
         SPACE 1                                                        06920000
         PUSH  USING                                                    06930000
BLD77CLS DS    0H                                                       06940000
         MVC   GRFCCW1(CLS77CPL),CLS77CP  Channel program               06950000
         MVC   GRFXBUFF(CLS77DSL),CLS77DS Data stream                   06960000
*                                                                       06970000
         MVC   GRFCCW1(1),GRFXERAS     Set EW/EWA CCW opcode            06980000
*                                                                       06990000
         LA    R1,CLS77DSL             Set data stream length           07000000
         STH   R1,GRFCCW1+6              into the write CCW             07010000
         LA    R3,GRFXBUFF             Data stream goes here            07020000
         STCM  R3,7,GRFCCW1+1          plug in CCW address              07030000
*                                                                       07040000
         USING CLS77DS,R3              Fill in variables                07050000
         MVC   CLS77AD1,GRFX@INP       Set input area addr              07060000
         MVC   CLS77AD2,GRFX@STA       Set status area addr             07070000
         MVC   CLS77AD3,GRFX@INP       Set input area addr              07080000
         MVC   CLS77AD4,GRFX@STA       Set status area addr             07090000
         MVC   CLS77SID,GRFXSID        Move in systemId                 07100000
*                                                                       07110000
         MVI   GRFXATOA,FLDPROT        reset bottom right attr          07120000
*                                                                       07130000
         B     GOODEXIT                all set.. return to caller       07140000
         SPACE 1                                                        07150000
         POP   USING                                                    07160000
         SPACE 3                                                        07170000
*-------------------------------------------------------------          07180000
*        CLS Channel Program template                                   07190000
*-------------------------------------------------------------          07200000
         SPACE 1                                                        07210000
CLS77CP  DS    0D                                                       07220000
         CCW   *-*,*-*,SILI,*-*        Erase Write (Alternate)          07230000
CLS77CPL EQU   *-CLS77CP                                                07240000
         SPACE 1                                                        07250000
*-------------------------------------------------------------          07260000
*        CLS Data Stream template                                       07270000
*-------------------------------------------------------------          07280000
         SPACE 1                                                        07290000
CLS77DS  EQU   *                                                        07300000
         DC    AL1(WCCUNLK)                                             07310000
         DC    AL1(SBA)                                                 07320000
CLS77AD1 DC    AL2(*-*)                input area buffer addr           07330000
         DC    AL1(SF,FLDHIDMT)                                         07340000
         DC    AL1(IC)                                                  07350000
         DC    AL1(EUA)                                                 07360000
CLS77AD2 DC    AL2(*-*)                status area buffer address       07370000
         DC    AL1(SBA)                                                 07380000
CLS77AD3 DC    AL2(*-*)                input area buffer address        07390000
         DC    AL1(SF,FLDCHNG)                                          07400000
         DC    AL1(SBA)                                                 07410000
CLS77AD4 DC    AL2(*-*)                status area buffer address       07420000
         DC    AL1(SF,FLDPROT)                                          07430000
         DC    CL9'RUNNING'                                             07440000
         DC    AL1(SF,FLDPROT)                                          07450000
CLS77SID DC    CL8'sysid'                                               07460000
         DC    AL1(SF,FLDPROT)         Bottom-right (OutArea) attr      07470000
*                                                                       07480000
CLS77DSL EQU   *-CLS77DS               data stream length               07490000
         EJECT ,                                                        07500000
* +--------------------------------------------------------+            07510000
* |                                                        |            07520000
* |      C R D : Clear the input area                      |            07530000
* |                                                        |            07540000
* |      Input:                                            |            07550000
* |      none                                              |            07560000
* |                                                        |            07570000
* |      0B (Select)                                       |            07580000
* |      01 (Write) WCC kbreset                            |            07590000
* |                 SBA @inpt                              |            07600000
* |                 SF  unprot+hidden+mdt                  |            07610000
* |                 IC                                     |            07620000
* |                 EUA @stat                              |            07630000
* |                 SBA @inpt                              |            07640000
* |                 SF  unprot+low+mdt                     |            07650000
* |                 SBA @stat                              |            07660000
* |                 SF  prot-low                           |            07670000
* |                 CL9'RUNNING'                           |            07680000
* |                 SF  prot-low                           |            07690000
* |                 CL8'sysid'                             |            07700000
* |                 SF  OutArea-attr                       |            07710000
* |                                                        |            07720000
* +--------------------------------------------------------+            07730000
         SPACE 1                                                        07740000
         PUSH  USING                                                    07750000
BLD77CRD DS    0H                                                       07760000
         MVC   GRFCCW1(CRD77CPL),CRD77CP  Channel program               07770000
         MVC   GRFXBUFF(CRD77DSL),CRD77DS Data stream                   07780000
*                                                                       07790000
         LA    R1,CRD77DSL             Set data stream length           07800000
         STH   R1,GRFCCW2+6              into the write CCW             07810000
         LA    R3,GRFXBUFF             Data stream goes here            07820000
         STCM  R3,7,GRFCCW2+1          plug in CCW address              07830000
*                                                                       07840000
         USING CRD77DS,R3              Fill in variables                07850000
         MVC   CRD77AD1,GRFX@INP       Set input area addr              07860000
         MVC   CRD77AD2,GRFX@STA       Set status area addr             07870000
         MVC   CRD77AD3,GRFX@INP       Set input area addr              07880000
         MVC   CRD77AD4,GRFX@STA       Set status area addr             07890000
         MVC   CRD77SID,GRFXSID        Move in systemId                 07900000
         MVC   CRD77ATT,GRFXATOA       Set lower right attr             07910000
*                                                                       07920000
         B     GOODEXIT                all set.. return to caller       07930000
         SPACE 1                                                        07940000
         POP   USING                                                    07950000
         SPACE 3                                                        07960000
*-------------------------------------------------------------          07970000
*        CRD Channel Program template                                   07980000
*-------------------------------------------------------------          07990000
         SPACE 1                                                        08000000
CRD77CP  DS    0D                                                       08010000
         CCW   CCWSEL,0,SILI+CC,1       Select                          08020000
         CCW   CCWWRT,*-*,SILI,*-*      Write: WCC, etc heading         08030000
CRD77CPL EQU   *-CRD77CP                                                08040000
         SPACE 1                                                        08050000
*-------------------------------------------------------------          08060000
*        CRD Data Stream template                                       08070000
*-------------------------------------------------------------          08080000
         SPACE 1                                                        08090000
CRD77DS  EQU   *                                                        08100000
         DC    AL1(WCCUNLK)                                             08110000
         DC    AL1(SBA)                                                 08120000
CRD77AD1 DC    AL2(*-*)                input area buffer addr           08130000
         DC    AL1(SF,FLDHIDMT)                                         08140000
         DC    AL1(IC)                                                  08150000
         DC    AL1(EUA)                                                 08160000
CRD77AD2 DC    AL2(*-*)                status area buffer address       08170000
         DC    AL1(SBA)                                                 08180000
CRD77AD3 DC    AL2(*-*)                input area buffer address        08190000
         DC    AL1(SF,FLDCHNG)                                          08200000
         DC    AL1(SBA)                                                 08210000
CRD77AD4 DC    AL2(*-*)                status area buffer address       08220000
         DC    AL1(SF,FLDPROT)                                          08230000
         DC    CL9'RUNNING'                                             08240000
         DC    AL1(SF,FLDPROT)                                          08250000
CRD77SID DC    CL8'sysid'                                               08260000
         DC    AL1(SF)                 Output area attr                 08270000
CRD77ATT DC    AL1(*-*)                FLDPROT or HIPRO if hilite ln 0  08280000
*                                                                       08290000
CRD77DSL EQU   *-CRD77DS               data stream length               08300000
         EJECT ,                                                        08310000
* +--------------------------------------------------------+            08320000
* |                                                        |            08330000
* |      M R D : Clear input area when in MORE or HOLDING  |            08340000
* |                                                        |            08350000
* |      Input:                                            |            08360000
* |      none                                              |            08370000
* |                                                        |            08380000
* |      0B (Select)                                       |            08390000
* |      01 (Write) WCC kbreset                            |            08400000
* |                 SBA @inpt                              |            08410000
* |                 SF  unprot+hidden+mdt                  |            08420000
* |                 IC                                     |            08430000
* |                 EUA @stat                              |            08440000
* |                 SBA @inpt                              |            08450000
* |                 SF  unprot+low+mdt                     |            08460000
* |                                                        |            08470000
* +--------------------------------------------------------+            08480000
         SPACE 1                                                        08490000
         PUSH  USING                                                    08500000
BLD77MRD DS    0H                                                       08510000
         MVC   GRFCCW1(MRD77CPL),MRD77CP  Channel program               08520000
         MVC   GRFXBUFF(MRD77DSL),MRD77DS Data stream                   08530000
*                                                                       08540000
         LA    R1,MRD77DSL             Set data stream length           08550000
         STH   R1,GRFCCW2+6              into the write CCW             08560000
         LA    R3,GRFXBUFF             Data stream goes here            08570000
         STCM  R3,7,GRFCCW2+1          plug in CCW address              08580000
*                                                                       08590000
         USING MRD77DS,R3              Fill in variables                08600000
         MVC   MRD77AD1,GRFX@INP       Set input area addr              08610000
         MVC   MRD77AD2,GRFX@STA       Set status area addr             08620000
         MVC   MRD77AD3,GRFX@INP       Set input area addr              08630000
*                                                                       08640000
         B     GOODEXIT                all set.. return to caller       08650000
         SPACE 1                                                        08660000
         POP   USING                                                    08670000
         SPACE 3                                                        08680000
*-------------------------------------------------------------          08690000
*        MRD Channel Program template                                   08700000
*-------------------------------------------------------------          08710000
         SPACE 1                                                        08720000
MRD77CP  DS    0D                                                       08730000
         CCW   CCWSEL,0,SILI+CC,1      Select                           08740000
         CCW   CCWWRT,*-*,SILI,*-*     Write: WCC, etc heading          08750000
MRD77CPL EQU   *-MRD77CP                                                08760000
         SPACE 1                                                        08770000
*-------------------------------------------------------------          08780000
*        MRD Data Stream template                                       08790000
*-------------------------------------------------------------          08800000
         SPACE 1                                                        08810000
MRD77DS  EQU   *                                                        08820000
         DC    AL1(WCCUNLK)                                             08830000
         DC    AL1(SBA)                                                 08840000
MRD77AD1 DC    AL2(*-*)                input area buffer addr           08850000
         DC    AL1(SF,FLDHIDMT)                                         08860000
         DC    AL1(IC)                                                  08870000
         DC    AL1(EUA)                                                 08880000
MRD77AD2 DC    AL2(*-*)                status area buffer address       08890000
         DC    AL1(SBA)                                                 08900000
MRD77AD3 DC    AL2(*-*)                input area buffer address        08910000
         DC    AL1(SF,FLDCHNG)                                          08920000
*                                                                       08930000
MRD77DSL EQU   *-MRD77DS               data stream length               08940000
         EJECT ,                                                        08950000
* +--------------------------------------------------------+            08960000
* |                                                        |            08970000
* |      I D S : Write to input area                       |            08980000
* |                                                        |            08990000
* |      Input:                                            |            09000000
* |      R3:   length of data to display                   |            09010000
* |      R4:   address of data to display                  |            09020000
* |                                                        |            09030000
* |      0B (Select)                                       |            09040000
* |      01 (Write)  WCC kbreset                           |            09050000
* |                  SBA @inpt                             |            09060000
* |                  EUA @stat                             |            09070000
* |                  SBA @inpt                             |            09080000
* |                  SF  attr7                             |            09090000
* |                  IC                                    |            09100000
* |                                                        |            09110000
* |      00 data chained for caller's data                 |            09120000
* |                                                        |            09130000
* +--------------------------------------------------------+            09140000
         SPACE 1                                                        09150000
         PUSH  USING                                                    09160000
BLD77IDS DS    0H                                                       09170000
         MVC   GRFCCW1(IDS77CPL),IDS77CP  Channel program               09180000
         MVC   GRFXBUFF(IDS77DSL),IDS77DS Data stream                   09190000
*                                                                       09200000
         STCM  R4,7,GRFCCW3+1          Set caller's data address        09210000
         STH   R3,GRFCCW3+6              and length                     09220000
*                                                                       09230000
         LA    R1,IDS77DSL             Set data stream length           09240000
         STH   R1,GRFCCW2+6              into the write CCW             09250000
         LA    R3,GRFXBUFF             Data stream goes here            09260000
         STCM  R3,7,GRFCCW2+1          plug in CCW address              09270000
*                                                                       09280000
         USING IDS77DS,R3              Fill in variables                09290000
         MVC   IDS77AD1,GRFX@INP       Set input area addr              09300000
         MVC   IDS77AD2,GRFX@STA       Set status area addr             09310000
         MVC   IDS77AD3,GRFX@INP       Set input area addr              09320000
*                                                                       09330000
         B     GOODEXIT                all set.. return to caller       09340000
         SPACE 1                                                        09350000
         POP   USING                                                    09360000
         SPACE 3                                                        09370000
*-------------------------------------------------------------          09380000
*        IDS Channel Program template                                   09390000
*-------------------------------------------------------------          09400000
         SPACE 1                                                        09410000
IDS77CP  DS    0D                                                       09420000
         CCW   CCWSEL,0,SILI+CC,1      Select                           09430000
         CCW   CCWWRT,*-*,SILI+CD,*-*  Write: WCC, etc heading          09440000
         CCW   0,*-*,SILI,*-*          write caller's data              09450000
IDS77CPL EQU   *-IDS77CP                                                09460000
         SPACE 1                                                        09470000
*-------------------------------------------------------------          09480000
*        IDS Data Stream template                                       09490000
*-------------------------------------------------------------          09500000
         SPACE 1                                                        09510000
IDS77DS  EQU   *                                                        09520000
         DC    AL1(WCCUNLK)                                             09530000
         DC    AL1(SBA)                                                 09540000
IDS77AD1 DC    AL2(*-*)                input area buffer addr           09550000
         DC    AL1(EUA)                                                 09560000
IDS77AD2 DC    AL2(*-*)                status area buffer address       09570000
         DC    AL1(SBA)                                                 09580000
IDS77AD3 DC    AL2(*-*)                input area buffer address        09590000
         DC    AL1(SF,FLDCHNG)                                          09600000
         DC    AL1(IC)                                                  09610000
*                                                                       09620000
IDS77DSL EQU   *-IDS77DS               data stream length               09630000
         EJECT ,                                                        09640000
* +--------------------------------------------------------+            09650000
* |                                                        |            09660000
* |      T A B : Insert tab character & move cursor        |            09670000
* |                                                        |            09680000
* |      Input:                                            |            09690000
* |      R0  = Length of TAB set list                      |            09700000
* |      R1  = address of TAB set list                     |            09710000
* |      R3  = current input BUFFER                        |            09720000
* |                                                        |            09730000
* |      0B (Select)                                       |            09740000
* |      01 (Write) WCC                                    |            09750000
* |                 SBA @inpt                              |            09760000
* |      06 (RM)    buffer                                 |            09770000
* |                                                        |            09780000
* +--------------------------------------------------------+            09790000
         SPACE 1                                                        09800000
         PUSH  USING                                                    09810000
BLD77TAB DS    0H                                                       09820000
         USING BUFFER,R3               Need access to current input     09830000
         SPACE 1                                                        09840000
         LR    R4,R0                   Save input parms                 09850000
         LR    R5,R1                   ...                              09860000
*                                                                       09870000
*        Initialize resulting channel program                           09880000
*                                                                       09890000
         MVC   GRFCCW1(TAB77CPL),TAB77CP  Channel program               09900000
         MVC   GRFXBUFF(TAB77DSL),TAB77DS Data stream                   09910000
*                                                                       09920000
         LA    R1,TAB77DSL             Set data stream length           09930000
         STH   R1,GRFCCW2+6              into the write CCW             09940000
         LA    R2,GRFXBUFF             Data stream goes here            09950000
         STCM  R2,7,GRFCCW2+1          plug in CCW address              09960000
*                                                                       09970000
         USING TAB77DS,R2              Fill in variables                09980000
*                                                                       09990000
*        Get current relative column number                             10000000
*                                                                       10010000
         SR    R1,R1                                                    10020000
         ICM   R1,3,BUFCSR             Get current cursor address       10030000
         BAL   R14,CVT14               ...                              10040000
         SH    R1,GRFXORGI             R1 = current 0-based column      10050000
         LR    R7,R1                   (keep in R7)                     10060000
*                                                                       10070000
*        Scan TAB sets to find target column                            10080000
*                                                                       10090000
         LTR   R4,R4                   Are there any                    10100000
         BNP   TABEGIN                 No, put cursor at start          10110000
*                                                                       10120000
TABSCAN  DS    0H                                                       10130000
         CLM   R7,1,0(R5)              Is this the place to tab to?     10140000
         BL    TABHIGH                 Yes if current column is lower   10150000
         LA    R5,1(,R5)               Bump to next tab stop            10160000
         BCT   R4,TABSCAN              Scan all the tab stops           10170000
*                                                                       10180000
TABEGIN  DS    0H                                                       10190000
         SR    R7,R7                   Put cursor back at the start     10200000
*                                                                       10210000
*        No logical tab needed.. Just the IC                            10220000
*                                                                       10230000
TABONE   DS    0H                                                       10240000
         LA    R1,TAB77LN1             Set length w/o logical tab       10250000
         STH   R1,GRFCCW2+6            ...                              10260000
*                                                                       10270000
TABTWO   DS    0H                      Both logical tab and IC needed   10280000
         BAL   R6,TABADDR              Convert & store buffer address   10290000
         MVI   TAB77TAB,IC               and add Insert Cursor order    10300000
*                                                                       10310000
         B     GOODEXIT                                                 10320000
*                                                                       10330000
*        Figure out where to place the logical tab                      10340000
*                                                                       10350000
TABHIGH  DS    0H                                                       10360000
         IC    R7,0(,R5)               Get target tab stop column       10370000
         L     R5,SAVER1               Restore ptr to tab stops         10380000
         LA    R4,BUFDATA              And ptr to the current input     10390000
         SLR   R3,R3                   Init ctr for logical tab loc     10400000
         IC    R6,VMGRFTAB             Get user's logical tab char      10410000
*                                                                       10420000
TABLOOP  DS    0H                                                       10430000
         CLI   0(R4),0                 Have we hit the end of data?     10440000
         BE    TABCHAR                 Yes, put logical tab here        10450000
         CLM   R6,1,0(R4)              Previous logical tab here?       10460000
         BE    TABUPDT                 Yes, must update tab location    10470000
         LA    R3,1(,R3)               Bump logical tab location        10480000
         CLM   R3,1,0(R5)              Is this also a tab stop?         10490000
         BL    TABDATA                 If not, just keep checking       10500000
         LA    R5,1(,R5)               Point to next tab stop           10510000
TABDATA  DS    0H                                                       10520000
         LA    R4,1(,R4)               Bump to next input character     10530000
         CR    R3,R7                   Reached the target tab stop?     10540000
         BL    TABLOOP                 No, leep looking at input        10550000
         B     TABONE                  Yes, no need for logical tab     10560000
*                                                                       10570000
TABUPDT  DS    0H                                                       10580000
         IC    R3,0(,R5)               Bump logical tab location        10590000
         LA    R5,1(,R5)               Point to next tab stop           10600000
         B     TABDATA                 and keep checking the input data 10610000
*                                                                       10620000
TABCHAR  DS    0H                                                       10630000
         LR    R5,R7                   Save cursor target location      10640000
         LR    R7,R3                   Get logical tab location         10650000
         STC   R6,TAB77TAB             Put logical tab in data stream   10660000
         BAL   R6,TABADDR              Cvt R7 addr & put in data strm   10670000
         LA    R2,TAB77DSP(,R2)        Bump data stream pointer for IC  10680000
         LR    R7,R5                   Restore new cursor target addr   10690000
         B     TABTWO                  and go add IC to data stream     10700000
         SPACE 2                                                        10710000
*                                                                       10720000
*        Little subroutine to convert & store buffer address            10730000
*                                                                       10740000
TABADDR  DS    0H                                                       10750000
         AH    R7,GRFXORGI             Add back the input area origin   10760000
         LR    R1,R7                   pass it in R1                    10770000
         BAL   R14,CVT12               Make proper buffer address       10780000
         STCM  R1,3,3(R2)              Put result in data stream        10790000
         BR    R6                      Return to caller                 10800000
         SPACE 1                                                        10810000
         POP   USING                                                    10820000
         SPACE 3                                                        10830000
*-------------------------------------------------------------          10840000
*        TAB Channel Program template                                   10850000
*-------------------------------------------------------------          10860000
         SPACE 1                                                        10870000
TAB77CP  DS    0D                                                       10880000
         CCW   CCWSEL,0,SILI+CC,1      Select                           10890000
         CCW   CCWWRT,*-*,SILI,*-*     Write: WCC, etc heading          10900000
TAB77CPL EQU   *-TAB77CP                                                10910000
         SPACE 1                                                        10920000
*-------------------------------------------------------------          10930000
*        TAB Data Stream template                                       10940000
*-------------------------------------------------------------          10950000
         SPACE 1                                                        10960000
TAB77DS  EQU   *                                                        10970000
         DC    AL1(WCCUNLK)                                             10980000
         DC    AL1(SBA)                                                 10990000
TAB77AD1 DC    AL2(*-*)                where to put logical tab         11000000
TAB77TAB DC    AL1(*-*)                logical tab char (or IC)         11010000
*                                                                       11020000
TAB77LN1 EQU   *-TAB77DS               length w/o logical tab           11030000
*                                                                       11040000
         DC    AL1(SBA)                                                 11050000
TAB77AD2 DC    AL2(*-*)                target column                    11060000
         DC    AL1(IC)                                                  11070000
*                                                                       11080000
TAB77DSP EQU   TAB77AD2-TAB77AD1 2nd SBA displacement                   11090000
*                                                                       11100000
TAB77DSL EQU   *-TAB77DS               data stream length               11110000
         EJECT ,                                                        11120000
* +--------------------------------------------------------+            11130000
* |                                                        |            11140000
* |      H L D : Set status area to HOLDING                |            11150000
* |      M O R : Set status area to MORE...                |            11160000
* |      N A C : Set status area to NOT ACCEPTED           |            11170000
* |                                                        |            11180000
* |      Input:                                            |            11190000
* |      none                                              |            11200000
* |                                                        |            11210000
* |      0B    (Select)                                    |            11220000
* |      01    (Write) WCC krreset+alarm                   |            11230000
* |                    SBA @stat                           |            11240000
* |                    SF prot-low                         |            11250000
* |                    CL9'HOLDING' or MORE... or ...      |            11260000
* |                    SF prot-low                         |            11270000
* |                    CL8'sysid'                          |            11280000
* |                    SF prot-low   s/b last screen cell  |            11290000
* |                                                        |            11300000
* +--------------------------------------------------------+            11310000
         SPACE 1                                                        11320000
         PUSH  USING                                                    11330000
BLD77HLD DS    0H                                                       11340000
         LA    R5,HLD77OPT             Display options + status         11350000
         B     BLDSTAT                 Join common                      11360000
         SPACE 1                                                        11370000
HLD77OPT EQU   *                                                        11380000
         DC    AL1(WCCUNLK,FLDHIPRO,FLDPROT)                            11390000
         DC    CL9'HOLDING'                                             11400000
         SPACE 2                                                        11410000
BLD77MOR DS    0H                                                       11420000
         LA    R5,MOR77OPT             Display options + status         11430000
         B     BLDSTAT                 Join common                      11440000
         SPACE 1                                                        11450000
MOR77OPT EQU   *                                                        11460000
         DC    AL1(WCCUNLK,FLDHIPRO,FLDPROT)                            11470000
         DC    CL9'MORE...'                                             11480000
         SPACE 2                                                        11490000
BLD77NAC DS    0H                                                       11500000
         LA    R5,NAC77OPT             Display options + status         11510000
         B     BLDSTAT                 Join common                      11520000
         SPACE 1                                                        11530000
NAC77OPT EQU   *                                                        11540000
         DC    AL1(WCCBEEP,FLDHIPRO,0)                                  11550000
         DC    CL18'NOT ACCEPTED'                                       11560000
         SPACE 3                                                        11570000
STATOPT  DSECT ,                                                        11580000
STATWCC  DS    XL1                                                      11590000
STATATT1 DS    XL1                                                      11600000
STATATT2 DS    XL1                                                      11610000
STATMSG  DS    0C                                                       11620000
         SPACE 1                                                        11630000
HDKGRC   CSECT ,                                                        11640000
* +---------------------------------------------------------            11650000
* +      Common status area update channel program                      11660000
* +---------------------------------------------------------            11670000
         SPACE 1                                                        11680000
BLDSTAT  DS    0H                                                       11690000
         USING STATOPT,R5              Address the options              11700000
         MVC   GRFCCW1(STA77CPL),STA77CP  Channel program               11710000
         MVC   GRFXBUFF(STA77DSL),STA77DS Data stream                   11720000
*                                                                       11730000
         LA    R1,STA77DSL             Set data stream length           11740000
         STH   R1,GRFCCW2+6              into the write CCW             11750000
         LA    R1,GRFXBUFF             Data stream goes here            11760000
         STCM  R1,7,GRFCCW2+1          plug in CCW address              11770000
*                                                                       11780000
         USING STA77DS,R1              Fill in variables                11790000
         MVC   STA77WCC,STATWCC        Set WCC from options             11800000
         MVC   STA77SBA,GRFX@STA       ... status area buffer addr      11810000
         MVC   STA77AT1,STATATT1       ... status area attribute        11820000
*                                                                       11830000
         CLI   STATATT2,0              long status?                     11840000
         BNE   STASTD                  ..no, continue below             11850000
         MVC   STA77LMS,STATMSG        ..yes...move it                  11860000
         MVI   STA77SF4,SF             Set ending attribute             11870000
         MVC   STA77AT4,GRFXATOA       .. maybe hilite row 0?           11880000
*                                                                       11890000
         LA    R0,STA77LML             Set correct length               11900000
         STH   R0,GRFCCW2+6            ...                              11910000
         B     GOODEXIT                and return to caller             11920000
*                                                                       11930000
STASTD   DS    0H                                                       11940000
         MVC   STA77SMS,STATMSG        Set status                       11950000
         MVI   STA77SF2,SF             SysId attr                       11960000
         MVC   STA77AT2,STATATT2       as per options                   11970000
         MVC   STA77SID,GRFXSID        Move in systemId                 11980000
         MVI   STA77SF3,SF             Set ending attribute             11990000
         MVC   STA77AT3,GRFXATOA       .. maybe hilite row 0?           12000000
*                                                                       12010000
         LA    R0,STA77SML             Set correct length               12020000
         STH   R0,GRFCCW2+6            ...                              12030000
         B     GOODEXIT                and return to caller             12040000
         SPACE 1                                                        12050000
         POP   USING                                                    12060000
         SPACE 3                                                        12070000
*-------------------------------------------------------------          12080000
*        Status update Channel Program template                         12090000
*-------------------------------------------------------------          12100000
         SPACE 1                                                        12110000
STA77CP  DS    0D                                                       12120000
         CCW   CCWSEL,0,SILI+CC,1      Select                           12130000
         CCW   CCWWRT,*-*,SILI,*-*     Write: WCC, etc                  12140000
STA77CPL EQU   *-STA77CP                                                12150000
         SPACE 1                                                        12160000
*-------------------------------------------------------------          12170000
*        Status update Data Stream template                             12180000
*-------------------------------------------------------------          12190000
         SPACE 1                                                        12200000
STA77DS  EQU   *                                                        12210000
STA77WCC DC    AL1(*-*)                WCC depends on options           12220000
         DC    AL1(SBA)                                                 12230000
STA77SBA DC    AL2(*-*)                Status Area buffer address       12240000
         DC    AL1(SF)                                                  12250000
STA77AT1 DC    AL1(*-*)                Attribute from options           12260000
*                                                                       12270000
STA77STA EQU   *                       Variable based on option         12280000
*                                                                       12290000
STA77SMS DC    CL9'*-*'                Short status                     12300000
STA77SF2 DC    AL1(SF)                                                  12310000
STA77AT2 DC    AL1(*-*)                SysId attr                       12320000
STA77SID DC    CL8'*-*'                                                 12330000
STA77SF3 DC    AL1(SF)                 Output area attr                 12340000
STA77AT3 DC    AL1(*-*)                                                 12350000
STA77SML EQU   *-STA77DS                                                12360000
*                                                                       12370000
         ORG   STA77STA                Redefine for long status         12380000
STA77LMS DC    CL18'*-*'               long status                      12390000
STA77SF4 DC    AL1(SF)                 Output area attr                 12400000
STA77AT4 DC    AL1(*-*)                row 9 attribute                  12410000
STA77LML EQU   *-STA77DS                                                12420000
         ORG   ,                                                        12430000
STA77DSL EQU   *-STA77DS                                                12440000
         EJECT ,                                                        12450000
* +--------------------------------------------------------+            12460000
* |                                                        |            12470000
* |      R U N : Set status area to RUNNING                |            12480000
* |                                                        |            12490000
* |      Input:                                            |            12500000
* |      none                                              |            12510000
* |                                                        |            12520000
* |      0B    (Select)                                    |            12530000
* |      01    (Write) WCC krreset+clear MDTs              |            12540000
* |                    SBA @inpt                           |            12550000
* |                    SF prot-low+MDT                     |            12560000
* |                    SBA @stat                           |            12570000
* |                    SF prot-low                         |            12580000
* |                    CL9'RUNNING'                        |            12590000
* |                    SF prot-low                         |            12600000
* |                    CL8'sysid'                          |            12610000
* |                    SF prot-low   s/b last screen cell  |            12620000
* |                                                        |            12630000
* +--------------------------------------------------------+            12640000
         SPACE 1                                                        12650000
         PUSH  USING                                                    12660000
BLD77RUN DS    0H                                                       12670000
         MVC   GRFCCW1(RUN77CPL),RUN77CP  Channel program               12680000
         MVC   GRFXBUFF(RUN77DSL),RUN77DS Data stream                   12690000
*                                                                       12700000
         LA    R1,RUN77DSL             Set data stream length           12710000
         STH   R1,GRFCCW2+6              into the write CCW             12720000
         LA    R1,GRFXBUFF             Data stream goes here            12730000
         STCM  R1,7,GRFCCW2+1          plug in CCW address              12740000
*                                                                       12750000
         USING RUN77DS,R1              Fill in variables                12760000
         MVC   RUN77AD1,GRFX@INP       ... input area buffer addr       12770000
         MVC   RUN77AD2,GRFX@STA       ... status area buffer addr      12780000
         MVC   RUN77SID,GRFXSID        Move in systemId                 12790000
         MVC   RUN77ATT,GRFXATOA       .. maybe hilite row 0?           12800000
*                                                                       12810000
         B     GOODEXIT                and return to caller             12820000
         SPACE 1                                                        12830000
         POP   USING                                                    12840000
         SPACE 3                                                        12850000
*-------------------------------------------------------------          12860000
*        RUNNUNG status Channel Program template                        12870000
*-------------------------------------------------------------          12880000
         SPACE 1                                                        12890000
RUN77CP  DS    0D                                                       12900000
         CCW   CCWSEL,0,SILI+CC,1      Select                           12910000
         CCW   CCWWRT,*-*,SILI,*-*     Write: WCC, etc                  12920000
RUN77CPL EQU   *-RUN77CP                                                12930000
         SPACE 1                                                        12940000
*-------------------------------------------------------------          12950000
*        RUNNUNG status Data Stream template                            12960000
*-------------------------------------------------------------          12970000
         SPACE 1                                                        12980000
RUN77DS  EQU   *                                                        12990000
         DC    AL1(WCCNMDT)            Reset kbd and clear MDTs         13000000
         DC    AL1(SBA)                                                 13010000
RUN77AD1 DC    AL2(*-*)                Input area buffer address        13020000
         DC    AL1(SF)                                                  13030000
         DC    AL1(FLDCHNG)            Unprotected, low, mdt            13040000
         DC    AL1(SBA)                                                 13050000
RUN77AD2 DC    AL2(*-*)                Status area buffer address       13060000
         DC    AL1(SF,FLDPROT)                                          13070000
         DC    CL9'RUNNING'                                             13080000
         DC    AL1(SF,FLDPROT)         Sysid attr                       13090000
RUN77SID DC    CL8'sysid'                                               13100000
         DC    AL1(SF)                                                  13110000
RUN77ATT DC    AL1(*-*)                Hilite for row 0                 13120000
RUN77DSL EQU   *-RUN77DS                                                13130000
         EJECT ,                                                        13140000
* +--------------------------------------------------------+            13150000
* |                                                        |            13160000
* |      V M R : Set status area to VM READ                |            13170000
* |      V M P : Set status area to VM READ (w/inhibit)    |            13180000
* |      C P R : Set status area to CP READ                |            13190000
* |      C P P : Set status area to CP READ (w/inhibit)    |            13200000
* |                                                        |            13210000
* |      Input:                                            |            13220000
* |      none                                              |            13230000
* |                                                        |            13240000
* |      0B    (Select)                                    |            13250000
* |      01    (Write) WCC krreset+clear MDTs              |            13260000
* |                    SBA @inpt                           |            13270000
* |                    SF not-prot+MDT  or hidden+MDT      |            13280000
* |                    SBA @stat                           |            13290000
* |                    SF prot-high                        |            13300000
* |                    CL9'xx READ                         |            13310000
* |                    SF prot-low                         |            13320000
* |                    CL8'sysid'                          |            13330000
* |                    SF prot-low   s/b last screen cell  |            13340000
* |                                                        |            13350000
* +--------------------------------------------------------+            13360000
         SPACE 1                                                        13370000
         PUSH  USING                                                    13380000
BLD77VMR DS    0H                                                       13390000
         LA    R0,FLDCHNG              Input area attribute             13400000
         B     BLD77VMX                join common code                 13410000
         SPACE 1                                                        13420000
BLD77VMP DS    0H                                                       13430000
         LA    R0,FLDHIDMT             Hide input area                  13440000
BLD77VMX DS    0H                                                       13450000
         LA    R2,=CL9'VM READ'        Status area value                13460000
         B     BLDREAD                 join common code                 13470000
         SPACE 1                                                        13480000
BLD77CPR DS    0H                                                       13490000
         LA    R0,FLDCHNG              Input area attribute             13500000
         B     BLD77CPX                join common code                 13510000
         SPACE 1                                                        13520000
BLD77CPP DS    0H                                                       13530000
         LA    R0,FLDHIDMT             Hide input area                  13540000
BLD77CPX DS    0H                                                       13550000
         LA    R2,=CL9'CP READ'        Status area value                13560000
*        B     BLDREAD                 join common code                 13570000
         SPACE 2                                                        13580000
* +---------------------------------------------------------            13590000
* +      Common VM/CP READ status area logic                            13600000
* +---------------------------------------------------------            13610000
         SPACE 1                                                        13620000
BLDREAD  DS    0H                                                       13630000
         MVC   GRFCCW1(RDR77CPL),RDR77CP  Channel program               13640000
         MVC   GRFXBUFF(RDR77DSL),RDR77DS Data stream                   13650000
*                                                                       13660000
         LA    R1,RDR77DSL             Set data stream length           13670000
         STH   R1,GRFCCW2+6              into the write CCW             13680000
         LA    R1,GRFXBUFF             Data stream goes here            13690000
         STCM  R1,7,GRFCCW2+1          plug in CCW address              13700000
*                                                                       13710000
         USING RDR77DS,R1              Fill in variables                13720000
         MVC   RDR77AD1,GRFX@INP       ... input area buffer addr       13730000
         STC   R0,RDR77ATT             ... input area attribute         13740000
*                                                                       13750000
         MVC   RDR77AD2,GRFX@STA       Status area buffer address       13760000
         MVC   RDR77STA,0(R2)          Status message                   13770000
         MVC   RDR77SID,GRFXSID        Move in systemId                 13780000
         MVC   RDR77ATZ,GRFXATOA       .. maybe hilite row 0?           13790000
*                                                                       13800000
         B     GOODEXIT                and return to caller             13810000
         SPACE 1                                                        13820000
         POP   USING                                                    13830000
         SPACE 3                                                        13840000
*-------------------------------------------------------------          13850000
*        VM/CP READ Channel Program template                            13860000
*-------------------------------------------------------------          13870000
         SPACE 1                                                        13880000
RDR77CP  DS    0D                                                       13890000
         CCW   CCWSEL,0,SILI+CC,1      Select                           13900000
         CCW   CCWWRT,*-*,SILI,*-*     Write: WCC, etc                  13910000
RDR77CPL EQU   *-RDR77CP                                                13920000
         SPACE 1                                                        13930000
*-------------------------------------------------------------          13940000
*        VM/CP READ Data Stream template                                13950000
*-------------------------------------------------------------          13960000
         SPACE 1                                                        13970000
RDR77DS  EQU   *                                                        13980000
         DC    AL1(WCCNMDT)            WCC depends on options           13990000
         DC    AL1(SBA)                                                 14000000
RDR77AD1 DC    AL2(*-*)                Input Area buffer address        14010000
         DC    AL1(SF)                                                  14020000
RDR77ATT DC    AL1(*-*)                Input area attribute             14030000
         DC    AL1(SBA)                                                 14040000
RDR77AD2 DC    AL2(*-*)                Status area buffer address       14050000
         DC    AL1(SF,FLDHIPRO)        Attribute from options           14060000
RDR77STA DC    CL9'*-*'                Short status                     14070000
         DC    AL1(SF,FLDPROT)                                          14080000
RDR77SID DC    CL8'sysid'                                               14090000
         DC    AL1(SF)                                                  14100000
RDR77ATZ DC    AL1(*-*)                Hilite for row 0                 14110000
RDR77DSL EQU   *-RDR77DS                                                14120000
         EJECT ,                                                        14130000
* +--------------------------------------------------------+            14140000
* |                                                        |            14150000
* |      W N G : Sound the alarm on the terminal           |            14160000
* |                                                        |            14170000
* |      0B (Select)                                       |            14180000
* |      01 (Write) WCC                                    |            14190000
* |                 SBA @inpt                              |            14200000
* |      06 (RM)    buffer                                 |            14210000
* |                                                        |            14220000
* +--------------------------------------------------------+            14230000
         SPACE 1                                                        14240000
         PUSH  USING                                                    14250000
BLD77WNG DS    0H                                                       14260000
         MVC   GRFCCW1(WNG77CPL),WNG77CP  Channel program               14270000
         MVC   GRFXBUFF(WNG77DSL),WNG77DS Data stream                   14280000
*                                                                       14290000
         LA    R1,WNG77DSL             Set data stream length           14300000
         STH   R1,GRFCCW2+6              into the write CCW             14310000
         LA    R1,GRFXBUFF             Data stream goes here            14320000
         STCM  R1,7,GRFCCW2+1          plug in CCW address              14330000
         B     GOODEXIT                                                 14340000
         SPACE 1                                                        14350000
         POP   USING                                                    14360000
         SPACE 3                                                        14370000
*-------------------------------------------------------------          14380000
*        WNG (warning) Channel Program template                         14390000
*-------------------------------------------------------------          14400000
         SPACE 1                                                        14410000
WNG77CP  DS    0D                                                       14420000
         CCW   CCWSEL,0,SILI+CC,1      Select                           14430000
         CCW   CCWWRT,*-*,SILI,*-*     Write: WCC, etc                  14440000
WNG77CPL EQU   *-RDR77CP                                                14450000
         SPACE 1                                                        14460000
*-------------------------------------------------------------          14470000
*        Warning Data Stream template                                   14480000
*-------------------------------------------------------------          14490000
         SPACE 1                                                        14500000
WNG77DS  EQU   *                                                        14510000
         DC    AL1(WCCBEEP)                                             14520000
WNG77DSL EQU   *-WNG77DS                                                14530000
         TITLE 'HDKGRC:HDKGRCRL  (CP)  VM370CE: VIRTUAL MACHINE/370 COMX14540000
               MUNITY EDITION'                                          14550000
***************************************************************         14560000
*                                                                       14570000
* METHOD NAME -                                                         14580000
*                                                                       14590000
*        HDKGRCRL                                                       14600000
*                                                                       14610000
* FUNCTION -                                                            14620000
*                                                                       14630000
*        Release any RDEV resources used building 327x                  14640000
*        channel programs                                               14650000
*                                                                       14660000
* ENTRY CONDITIONS -                                                    14670000
*                                                                       14680000
*        R8  = Address of the RDEVBLOK                                  14690000
*        R10 = IOBLOK pointer
*        R12 = Address of HDKGRCRL entry point                          14700000
*        R13 = Address of standard SAVEAREA                             14710000
*                                                                       14720000
* EXIT CONDITIONS -                                                     14730000
*                                                                       14740000
*        R15 = 0 : All resources released                               14750000
*                                                                       14760000
***************************************************************         14770000
         SPACE 3                                                        14780000
HDKGRCRL RELOC ,                                                        14790000
         SPACE 3                                                        14800000
*-------------------------------------------------------------          14810000
*        Clear any prior workareas, buffers, etc.                       14820000
*-------------------------------------------------------------          14830000
         SPACE 1                                                        14840000
         ICM   R7,15,IOBCCWRK          Access the GRFCCWS               14850000
         BZ    NOCCWRK                 do nothing if not there          14860000
         BAL   R14,RELEASE             clean out large buffer           14870000
         LA    R0,GRFCCWLD               and release IOBLOK linked      01100000
         LR    R1,R7                       CCW build/work area
         CALL  DMKFRET                 ...                              01110000
         SR    R0,R0                   and clear IOBLOK link
         ST    R0,IOBCCWRK             Chain it off the IOBLOK          01120000
NOCCWRK  DS    0H
         SR    R15,R15                 CLean return code
         EXIT  ,                                                        14880000
         SPACE 3                                                        14890000
*-------------------------------------------------------------          14900000
*                                                                       14910000
*        RELEASE                                                        14920000
*                                                                       14930000
*        Common routine to clean up any workareas or buffers            14940000
*        left over from prior calls                                     14950000
*                                                                       14960000
*        Input:                                                         14970000
*        R7  = GRFCCWs pointer                                          14990000
*        R14 = return address
*                                                                       15000000
*        Exit:                                                          15010000
*        R0-R1 = zeroes                                                 15020000
*        GRFBUFFA = zeroes                                              15030000
*                                                                       15040000
*-------------------------------------------------------------          15050000
         SPACE 1                                                        15060000
RELEASE  DS    0H                                                       15070000
         ICM   R1,15,GRFBUFFA          Release prior large buffer       15080000
         BZR   R14                     not there.. just return          15090000
         ST    R14,SAVEWRK2            Save return address
         LH    R0,GRFBUFFL             Dword size                       15100000
         CALL  DMKFRET                 Release the storage              15110000
         SR    R0,R0                   Clear the pointer                15120000
         LR    R1,R0                   and address                      15130000
         ST    R0,GRFBUFFA             ...                              15140000
         STH   R0,GRFBUFFL             and length
         L     R14,SAVEWRK2            Restore reurn address
         BR    R14                     Return to caller                 15150000
         TITLE 'HDKGRC           (CP)  VM370CE: VIRTUAL MACHINE/370 COMX15160000
               MUNITY EDITION'                                          15170000
         LTORG ,                                                        15180000
         EJECT ,                                                        15190000
         COPY  EQU                                                      15200000
         COPY  DEVTYPES                                                 15210000
         COPY  GRCWORK                                                  15220000
         COPY  HDK3270                                                  15230000
         COPY  VMBLOK                                                   15240000
         COPY  RBLOKS                                                   15250000
         COPY  GRFXBLOK                                                 15260000
         COPY  IOBLOKS                                                  15270000
         COPY  CONBUF                                                   15280000
         COPY  SAVE                                                     15290000
         COPY  TIMER                                                    15300000
         PSA                                                            15310000
         SPACE 3                                                        15320000
HDKGRC   CSECT ,                                                        15330000
         ORG   ,                                                        15340000
MODEND   DS    0D                      *** Mark module's end ***        15350000
         END                                                            15360000
