GRC      TITLE 'HDKGRC           (CP)  VM370CE: VIRTUAL MACHINE/370 COMX00010000
               MUNITY EDITION'                                          00020000
         ISEQ  73,80          Validate sequence numbers                 00030000
**********************************************************************  00040000
*                                                                       00050000
* MODULE NAME -                                                         00060000
*                                                                       00070000
*        HDKGRC                                                         00080000
*                                                                       00090000
* FUNCTION -                                                            00100000
*                                                                       00110000
*        Build all of the Channel Programs needed to manage             00120000
*        local display devices. The CCWs and associated data            00130000
*        streams will be tailored to fit the device type and            00140000
*        screen geometry.                                               00150000
*                                                                       00160000
* ATTRIBUTES -                                                          00170000
*                                                                       00180000
*        Reenterable, resident                                          00190000
*                                                                       00200000
* ENTRY POINTS -                                                        00210000
*                                                                       00220000
*        DMKGRCCW - Prepare channel programs                            00230000
*        DMKGRCRL - Release CCW resources from IOBLOK                   00240000
*                                                                       00250000
**********************************************************************  00260000
         EJECT ,                                                        00270000
         COPY  OPTIONS                                                  00280000
         COPY  LOCAL                                                    00290000
         SPACE 3                                                        00300000
HDKGRC   CSECT ,                                                        00310000
         DC    CL8'HDKGRC'        Module Id                             00320000
         DC    AL2(MODEND-HDKGRC) Module length                         00330000
         DC    C'&SYSDATE',C'-'   Compile date                          00340000
         DC    C'&SYSTIME'        Compile time                          00350000
         SPACE 3                                                        00360000
         USING PSA,0                                                    00370000
         USING TRQBLOK,R5                                               00380000
         USING CONTASK,R6                                               00390000
         USING RDEVBLOK,R8                                              00400000
         USING GRFXBLOK,R9                                              00410000
         USING IOBLOK,R10                                               00420000
         USING VMBLOK,R11                                               00430000
         USING SAVEAREA,R13                                             00440000
         SPACE 3                                                        00450000
         EXTRN DMKBOXDS,DMKBOXBX,DMKBOX80                               00460000
         EXTRN DMKCVT12,DMKCVT14                                        00470000
         EXTRN HDKG66CP,DMKSYSID                                        00480000
         TITLE 'HDKGRC:HDKGRCCW  (CP)  VM370CE: VIRTUAL MACHINE/370 COMX00490000
               MUNITY EDITION'                                          00500000
***************************************************************         00510000
*                                                                       00520000
* METHOD NAME -                                                         00530000
*                                                                       00540000
*        HDKGRCCW                                                       00550000
*                                                                       00560000
* FUNCTION -                                                            00570000
*                                                                       00580000
*        Build a local display device channel program                   00590000
*        and its associated data stream.                                00600000
*                                                                       00610000
* ENTRY CONDITIONS -                                                    00620000
*                                                                       00630000
*        R0  = Index of channel program to be built                     00640000
*        R8  = Address of the RDEVBLOK                                  00650000
*        R10 = Address of the IOBLOK                                    00660000
*        R11 = Address of the user's VMBLOK                             00670000
*        R12 = Address of HDKGINIT entry point                          00680000
*        R13 = Address of standard SAVEAREA                             00690000
*                                                                       00700000
* EXIT CONDITIONS -                                                     00710000
*                                                                       00720000
*        R15 = 0 : The RDEVBLOK has been initialized                    00730000
*                                                                       00740000
*        R15 = 4 : A Read Partition Query was issued.                   00750000
*                  Wait for the Attention interrupt that                00760000
*                  will be generated. A call to HDKGINRD                00770000
*                  needs to be made when that interrupt occurs.         00780000
*                                                                       00790000
*        R15 = 8 : An I/O error occurred while trying th                00800000
*                  initialize the display device.                       00810000
*                                                                       00820000
* NOTES -                                                               00830000
*                                                                       00840000
*        Local display device initialization is invoked                 00850000
*        when an unsolicited Device-End is detected for                 00860000
*        an enabled device or when an ENABLE command is                 00870000
*        issued for a disabled device                                   00880000
*                                                                       00890000
***************************************************************         00900000
         SPACE 3                                                        00910000
HDKGRCCW RELOC ,                                                        00920000
         SPACE 3                                                        00930000
*-------------------------------------------------------------          00940000
*        3066 gets its own happy place                                  00950000
*-------------------------------------------------------------          00960000
         SPACE 1                                                        00970000
         CLI   RDEVTYPE,TYP3066   Ship old 3066 stuff                   00980000
         BNE   CCW327X            ... off to buffalo                    00990000
         GOTO  HDKG66CP           3066 CCWs in separate place           01000000
         SPACE 3                                                        01010000
*-------------------------------------------------------------          01020000
*        Generate 327x channel programs and data streams                01030000
*-------------------------------------------------------------          01040000
         SPACE 1                                                        01050000
CCW327X  DS    0H                                                       01060000
         L     R9,RDEVGRFX    Get GRFXBLOK addressability               01070000
         ICM   R7,15,IOBCHPRG Get channel program addressing            01080000
         BNZ   ROUTCALL       have it already                           01090000
         LA    R0,GRFCCWLD    1st call.. allocate the storage           01100000
         CALL  DMKFREE        ...                                       01110000
         ST    R1,IOBCHPRG    Chain it off the IOBLOK                   01120000
         LR    R7,R1          Set permanent aaddressing                 01130000
         USING GRFCCWS,R7     ...                                       01140000
         SPACE 1                                                        01150000
*-------------------------------------------------------------          01160000
*        Route based on display device type                             01170000
*-------------------------------------------------------------          01180000
         SPACE 1                                                        01190000
ROUTCALL DS    0H                                                       01200000
         B     VECTOR77(R1)                                             01210000
VECTOR77 DS    0H                                                       01220000
         B     BADCALL        CPIX=0  bad call                          01230000
         B     BLD77RMI       CPIX=1  Read Manual Input                 01240000
         B     BLD77FMT       CPIX=2  Format screen w/logo              01250000
         B     BLD77WRT       CPIX=3  Write to output area              01260000
         B     BLD77CLR       CPIX=4  Clear screen                      01270000
         B     BLD77CLS       CPIX=5  Clear screen with Erase Write     01280000
         B     BLD77CRD       CPIX=6  Clear input area w/RUNNING        01290000
         B     BLD77MRD       CPIX=7  Clear input area w/o status       01300000
         B     BLD77IDS       CPIX=8  Write to input area               01310000
         B     BLD77TAB       CPIX=9  Insert a logical tab              01320000
         B     BLD77HLD       CPIX=10 Set status = HOLDING              01330000
         B     BLD77MOR       CPIX=11 Set status = MORE...              01340000
         B     BLD77NAC       CPIX=12 Set status = NOT ACCEPTED         01350000
         B     BLD77RUN       CPIX=13 Set status = RUNNING              01360000
         B     BLD77VMR       CPIX=14 Set status = VM READ              01370000
         B     BLD77CPR       CPIX=15 Set status = CP READ              01380000
         B     BLD77VMP       CPIX=16 Set status = VM READ inhibit      01390000
         B     BLD77CPP       CPIX=17 Set status = CP READ inhibit      01400000
         B     BLD77WNG       CPIX=18 Sound warning alarm               01410000
         SPACE 3                                                        01420000
GOODEXIT DS    0H                                                       01430000
         LA    R1,GRFCCW1                                               01440000
EXITR1   DS    0H                                                       01450000
         ST    R1,SAVER1      Return R1 = channel program               01460000
         XR    R15,R15        and RC=0                                  01470000
DOEXIT   DS    0H                                                       01480000
         EXIT  ,                                                        01490000
BADCALL  DS    0H                                                       01500000
         LA    R15,8                                                    01510000
         B     DOEXIT                                                   01520000
         EJECT ,                                                        01530000
* +--------------------------------------------------------+            01540000
* |                                                        |            01550000
* |      R M I : Read Manual Input (327x)                  |            01560000
* |                                                        |            01570000
* |      Input:                                            |            01580000
* |      IOBMISC = read buffer address                     |            01590000
* |                                                        |            01600000
* |      0B (Select)                                       |            01610000
* |      01 (Write) WCC                                    |            01620000
* |                 SBA @inpt                              |            01630000
* |      06 (RM)    buffer                                 |            01640000
* |                                                        |            01650000
* +--------------------------------------------------------+            01660000
         SPACE 1                                                        01670000
         PUSH  USING                                                    01680000
BLD77RMI DS    0H                                                       01690000
         MVC   GRFCCW1(RMI77CPL),RMI77CP  Channel program               01700000
         MVC   GRFXBUFF(RMI77DSL),RMI77DS Data stream                   01710000
*                                                                       01720000
         LA    R1,RMI77DSL        Set data stream length                01730000
         STH   R1,GRFCCW2+6         into the write CCW                  01740000
         LA    R1,GRFXBUFF        Data stream goes here                 01750000
         STCM  R1,7,GRFCCW2+1     plug in CCW address                   01760000
*                                                                       01770000
         USING RMI77DS,R1         Fill in variables                     01780000
         MVC   RMI77SBA,GRFX@INP  ... input area buffer addr            01790000
*                                                                       01800000
         L     R1,IOBMISC         Caller-provided input buffer          01810000
         STCM  R1,7,GRFCCW3+1       goes into the RM CCW                01820000
         LA    R1,BUFINLTH*2      along with the buffer size            01830000
         STH   R1,GRFCCW3+6       ...                                   01840000
*                                                                       01850000
         B     GOODEXIT           and all finished                      01860000
         SPACE 1                                                        01870000
         POP   USING                                                    01880000
         SPACE 3                                                        01890000
*-------------------------------------------------------------          01900000
*        RMI Channel Program template                                   01910000
*-------------------------------------------------------------          01920000
         SPACE 1                                                        01930000
RMI77CP  DS    0D                                                       01940000
         CCW   CCWSEL,0,SILI+CC,1       Select                          01950000
         CCW   CCWWRT,*-*,SILI+CC,*-*   Write: WCC, SBA @inpt           01960000
         CCW   CCWRM,*-*,SILI,*-*       Read Modified                   01970000
RMI77CPL EQU   *-RMI77CP                                                01980000
         SPACE 1                                                        01990000
*-------------------------------------------------------------          02000000
*        RMI Data Stream template                                       02010000
*-------------------------------------------------------------          02020000
         SPACE 1                                                        02030000
RMI77DS  EQU   *                                                        02040000
         DC    AL1(WCCDFLT)                                             02050000
         DC    AL1(SBA)                                                 02060000
RMI77SBA DC    AL2(*-*)       Input Area buffer address                 02070000
RMI77DSL EQU   *-RMI77DS                                                02080000
         EJECT ,                                                        02090000
* +--------------------------------------------------------+            02100000
* |                                                        |            02110000
* |      F M T : Format screen with logo                   |            02120000
* |                                                        |            02130000
* |      Input:                                            |            02140000
* |      none                                              |            02150000
* |                                                        |            02160000
* |      05/0D (EW[A]) WCC kbreset+alarm                   |            02170000
* |                    SBA @stat                           |            02180000
* |                    SF prot-low                         |            02190000
* |                    CL9'ENABLED'                        |            02200000
* |                    SF prot-low                         |            02210000
* |                    CL8'sysid'                          |            02220000
* |                    SF prot-low   s/b last screen cell  |            02230000
* |                    C'VM/370 Online'                    |            02240000
* |                                                        |            02250000
* |                    for each logo row [                 |            02260000
* |                       SBA logo-addr                    |            02270000
* |                       logo data row                    |            02280000
* |                    ]                                   |            02290000
* |      03    (NOP)                                       |            02300000
* |                                                        |            02310000
* +--------------------------------------------------------+            02320000
         SPACE 1                                                        02330000
         PUSH  USING                                                    02340000
BLD77FMT DS    0H                                                       02350000
         MVC   GRFCCW1(FMT77CPL),FMT77CP                                02360000
         MVC   GRFCCW1(1),GRFXERAS Put correct EW[A] opcode             02370000
*                                                                       02380000
         L     R5,=A(DMKBOXDS) Access logo descriptor                   02390000
         LH    R2,0(,R5)      Get row size                              02400000
         LH    R3,2(,R5)      Get row count                             02410000
*                                                                       02420000
*        Calculate the space needed                                     02430000
*                                                                       02440000
         LA    R5,3(,R2)      (row.size + 3)                            02450000
         MR    R4,R3          * row.ct                                  02460000
         LA    R5,FMT77DSL(,R5) + preamble                              02470000
         STH   R5,GRFCCW1+6   = write length                            02480000
*                                                                       02490000
*        (Re)allocate as needed                                         02500000
*                                                                       02510000
         ICM   R6,15,GRFBUFFA Is there a work area?                     02520000
         BZ    FMT77ALO                                                 02530000
         CH    R5,GRFBUFFL                                              02540000
         BNH   FMT77OK1                                                 02550000
*                                                                       02560000
*        release current.. it's too small                               02570000
*                                                                       02580000
         LR    R1,R6          release current                           02590000
         LH    R0,GRFBUFFL    ...                                       02600000
         SRL   R0,3           ... (dwords)                              02610000
         CALL  DMKFRET        ...                                       02620000
*                                                                       02630000
*        Allocate logo buffer wrk                                       02640000
*                                                                       02650000
FMT77ALO DS    0H                                                       02660000
         LA    R0,7(,R5)      Alloc size in dwords                      02670000
         SRL   R0,3           dwords please                             02680000
         LR    R5,R0          save it...                                02690000
         SLL   R5,3           ... as byte count                         02700000
         STH   R5,GRFBUFFL    (save new size)                           02710000
         CALL  DMKFREE        ... get it                                02720000
         ST    R1,GRFBUFFA    save address                              02730000
         LR    R6,R1          set addressability                        02740000
*                                                                       02750000
*        Build orders in work area                                      02760000
*                                                                       02770000
FMT77OK1 DS    0H                                                       02780000
         STCM  R6,7,GRFCCW1+1 Set order addr in CCW                     02790000
         L     R5,=A(DMKBOXBX) Use the default logo                     02800000
*                                                                       02810000
         MVC   0(FMT77DSL,R6),FMT77DS                                   02820000
         USING FMT77DS,R6                                               02830000
         MVC   FMT77SBA,GRFX@STA  Status area attr addr                 02840000
         L     R14,=A(DMKSYSID)   Move in systemId                      02850000
         MVC   FMT77SID,0(R14)    ...                                   02860000
*                                                                       02870000
*        If we are running on Hercules-380, then update                 02880000
*        the "VM/370 Online" message to say "VM/380 Online"             02890000
*                                                                       02900000
         MVC   FMT77VMO+4(1),INSTWRD1 zap with 7 or 8 from PSA          02910000
         CLI   INSTWRD1,C'8'  Is it really VM/380??                     02920000
         BNE   *+8            no.. all set to build logo                02930000
         L     R5,=A(DMKBOX80) yes.. use alternate logo                 02940000
*                                                                       02950000
*        Calculate starting buffer address                              02960000
*                                                                       02970000
         LH    R4,GRFXROWS    Screen rows                               02980000
         S     R4,F2          - 2                                       02990000
         SR    R4,R3          - logo rows                               03000000
         SRL   R4,1           / 2 = starting row                        03010000
         MH    R4,GRFXCOLS    * cols = address                          03020000
*                                                                       03030000
         LH    R1,GRFXCOLS    Screen cols                               03040000
         SR    R1,R2          - logo cols                               03050000
         SRL   R1,1           / 2 = starting col                        03060000
*                                                                       03070000
         AR    R4,R1          row+col = buffer addr                     03080000
*                                                                       03090000
         LA    R6,FMT77DSL(,R6) Build the logo here                     03100000
         BCTR  R2,0           row size - 1 for EX                       03110000
*                                                                       03120000
FMT77LP  DS    0H                                                       03130000
         LR    R1,R4          Current buffer address                    03140000
         TM    RDEVGRIC,RDEVAD14 14-bit addressing                      03150000
         BO    FMT77ADD          yes, use addr as-is                    03160000
         CALL  DMKCVT12          no, convert to 12-bit                  03170000
FMT77ADD DS    0H                                                       03180000
         MVI   0(R6),SBA      Move to next row                          03190000
         STCM  R1,3,1(R6)     ...                                       03200000
*                                                                       03210000
         EX    R2,FMT77MVC    Move in next logo row                     03220000
*                                                                       03230000
         LA    R6,3+1(R2,R6)  Bump buffer target                        03240000
         LA    R5,1(R2,R5)    Bump to next logo row                     03250000
         AH    R4,GRFXCOLS    Bump buffer addr                          03260000
*                                                                       03270000
         BCT   R3,FMT77LP     and build the whole logo                  03280000
*                                                                       03290000
         MVI   GRFXATOA,FLDPROT Attribute in lower right                03300000
*                                                                       03310000
         B     GOODEXIT                                                 03320000
         SPACE 1                                                        03330000
FMT77MVC MVC   3(*-*,R6),0(R5)    *** Executed ***                      03340000
         SPACE 1                                                        03350000
         POP   USING                                                    03360000
         SPACE 3                                                        03370000
*-------------------------------------------------------------          03380000
*        FMT Channel Program template                                   03390000
*-------------------------------------------------------------          03400000
         SPACE 1                                                        03410000
FMT77CP  DS    0D                                                       03420000
         CCW   CCWEW,*-*,SILI+CC,*-*    Erase Write [Alternate]         03430000
         CCW   CCWNOP,0,SILI,1          NOP to get CE+DE together       03440000
FMT77CPL EQU   *-FMT77CP                                                03450000
         SPACE 1                                                        03460000
*-------------------------------------------------------------          03470000
*        FMT Data Stream template                                       03480000
*-------------------------------------------------------------          03490000
         SPACE 1                                                        03500000
FMT77DS  EQU   *                                                        03510000
         DC    AL1(WCCUNLK+WCCALARM)                                    03520000
         DC    AL1(SBA)                                                 03530000
FMT77SBA DC    AL2(*-*)         status area buffer address              03540000
         DC    AL1(SF,FLDPROT)                                          03550000
         DC    CL9'ENABLED'                                             03560000
         DC    AL1(SF,FLDPROT)                                          03570000
FMT77SID DC    CL8'sysid'                                               03580000
         DC    AL1(SF,FLDPROT)                                          03590000
FMT77VMO DC    CL20'VM/370 Online'                                      03600000
FMT77DSL EQU   *-FMT77DS                                                03610000
         EJECT ,                                                        03620000
* +--------------------------------------------------------+            03630000
* |                                                        |            03640000
* |      W R T : Write to output area                      |            03650000
* |                                                        |            03660000
* |      Input:                                            |            03670000
* |      R4:       number of screen lines to write         |            03680000
* |      R5:       TRQBLOK address                         |            03690000
* |      R6:       CONTASK address                         |            03700000
* |      CONCNT:   length of data                          |            03710000
* |      CONDATA:  data to write                           |            03720000
* |      RDEVCORD: 1st screen line to write                |            03730000
* |                                                        |            03740000
* |      0B (Select)                                       |            03750000
* |                                                        |            03760000
* |      01 (Write) or 05 (EW) or 0D (EWA)                 |            03770000
* |                                                        |            03780000
* |         WCC kbreset                                    |            03790000
* |         if !hilight:                                   |            03800000
* |            SBA target-row, col-0                       |            03810000
* |         else                                           |            03820000
* |            if target-row == 0:                         |            03830000
* |               SBA 0,0                                  |            03840000
* |            else:                                       |            03850000
* |               SBA (target-row, 0) - 1                  |            03860000
* |               SF prot-high                             |            03870000
* |                                                        |            03880000
* |      00 data chained                                   |            03890000
* |                                                        |            03900000
* |          caller's data                                 |            03910000
* |                                                        |            03920000
* |      00 data chained                                   |            03930000
* |                                                        |            03940000
* |         if hilight && not ending on last row:          |            03950000
* |            SBA last row, end col                       |            03960000
* |            SF  prot-low                                |            03970000
* |                                                        |            03980000
* |         SBA @inpt                                      |            03990000
* |         SF  unprot+mdt                                 |            04000000
* |         SBA @stat                                      |            04010000
* |         SF  prot-low                                   |            04020000
* |         RUNNING                                        |            04030000
* |         SF  prot-low                                   |            04040000
* |         sysid                                          |            04050000
* |         if target-row == 0:                            |            04060000
* |            SF  prot-high                               |            04070000
* |         else                                           |            04080000
* |            SF  prot-low                                |            04090000
* |                                                        |            04100000
* +--------------------------------------------------------+            04110000
         SPACE 1                                                        04120000
         PUSH  USING                                                    04130000
BLD77WRT DS    0H                                                       04140000
         MVC   CONCCW1(WRT77CPL),WRT77CP  Move in model                 04150000
         STC   R4,CONCCW1+5               Save number of lines          04160000
         MVC   GRFXBUFF(WRT77DSL),WRT77DS Data stream model             04170000
*                                                                       04180000
         LA    R3,GRFXBUFF             Address the data stream          04190000
         STCM  R3,7,CONCCW2+1          Set the preamble CCW data addr   04200000
         USING WRT77DS,R3     ...                                       04210000
*                                                                       04220000
         TM    RDEVSTA3,RDEVEWRT       Erase/write required?            04230000
         BZ    WRTNOEW                 No                               04240000
         NI    RDEVSTA3,255-RDEVEWRT   Turn off flag                    04250000
         MVC   CONCCW2(1),GRFXERAS     Set erase CCW opcode             04260000
WRTNOEW  DS    0H                                                       04270000
*                                                                       04280000
*        Calculate starting buffer address                              04290000
*                                                                       04300000
         SR    R1,R1               Get current line position            04310000
         IC    R1,RDEVCORD         ...                                  04320000
         TM    TRQBFLAG,CRTSIO     Diag58 writing to input area?        04330000
         BZ    *+8                 no, RDEVCORD is good                 04340000
         IC    R1,TRQBLINE         yes, get Diag58 line number          04350000
         STC   R1,SAVEWRK1         (save starting buffer address)       04360000
         AR    R4,R1               also calc ending line number         04370000
         MH    R1,GRFXCOLS         * col count = raw buffer addr        04380000
*                                                                       04390000
*        Build preamble data stream                                     04400000
*                                                                       04410000
         TM    CONPARM2,HILIGHT/256 Is the HILIGHT option in effect?    04420000
         BZ    WRTNOHI1            no, take the simple path             04430000
         LTR   R1,R1               Writing to first line?               04440000
         BZ    WRTLN0              yes, special case                    04450000
         BCTR  R1,0                no, set attr on line above           04460000
         LA    R2,WRT77LN2         Set preamble data length             04470000
         B     WRTADDR1            join below                           04480000
*                                                                       04490000
*        Here, the first line on the screen is to be hilighted.         04500000
*        We will just set a value of the bottom right attribute         04510000
*        that also referenced whenever the status area is displayed.    04520000
*                                                                       04530000
WRTLN0   DS    0H                                                       04540000
         MVI   GRFXATOA,FLDHIPRO   Set hilite attr for first line       04550000
*                                                                       04560000
*        Here for all non-hilighted and when the 1st line               04570000
*        is to be lighted. In this case, the SBA to set the             04580000
*        output line is the same: the start og the target line          04590000
*        This is setting up for just: WCC SBA(line#,0) preamble.        04600000
*                                                                       04610000
WRTNOHI1 DS    0H                                                       04620000
         LA    R2,WRT77LN1         Set basic prefix data length         04630000
*                                                                       04640000
WRTADDR1 DS    0H                                                       04650000
         STH   R2,CONCCW2+6        Set preamble data stream length      04660000
         TM    RDEVGRIC,RDEVAD14   14-bit addressing                    04670000
         BO    WRTADD1A            yes, use addr as-is                  04680000
         CALL  DMKCVT12            no, convert to 12-bit                04690000
WRTADD1A DS    0H                                                       04700000
         STCM  R1,3,WRT77AD1       Set addr in data stream              04710000
*                                                                       04720000
*        Fill in user's data adr & length                               04730000
*                                                                       04740000
         LA    R1,CONDATA          User's data address                  04750000
         STCM  R1,7,CONCCW3+1      ...                                  04760000
         LH    R1,CONCNT           and its length                       04770000
         STH   R1,CONCCW3+6        ...                                  04780000
*                                                                       04790000
*        Build footer based on HILITE and row 0                         04800000
*                                                                       04810000
         TM    CONPARM2,HILIGHT/256 Is the HILIGHT option in effect?    04820000
         BZ    WRTNOHI2            no, take the simple path             04830000
         CLI   SAVEWRK1,0          Started on line 0?                   04840000
         BE    WRTNOHI2            yes, also simple                     04850000
         CLM   R4,1,GRFXINL1       Ended on last output line            04860000
         BE    WRTNOHI2            yes, the InArea attr is enough       04870000
*                                                                       04880000
*        Suffix needs to first end the HILITE                           04890000
*                                                                       04900000
         MH    R4,GRFXCOLS         put attr at end of last line         04910000
         BCTR  R4,0                  of HILITE output                   04920000
         TM    RDEVGRIC,RDEVAD14   14-bit addressing                    04930000
         BO    WRTADD2A            yes, use addr as-is                  04940000
         CALL  DMKCVT12            no, convert to 12-bit                04950000
WRTADD2A DS    0H                                                       04960000
         STCM  R4,3,WRT77AD2       end-HILITE addr to data stream       04970000
         LA    R1,WRT77SF1         use large suffix                     04980000
         LA    R2,WRT77LN3         ...                                  04990000
         B     WRTDOSFX            and join below                       05000000
*                                                                       05010000
*        Simple suffix if not HILITE                                    05020000
*        or HILITE started on line 0                                    05030000
*        or HILITEended on last output area line                        05040000
*                                                                       05050000
WRTNOHI2 DS    0H                                                       05060000
         LA    R1,WRT77SF2         use shorter suffix                   05070000
         LA    R2,WRT77LN4         ...                                  05080000
*                                                                       05090000
*        Build the common part of suffix                                05100000
*                                                                       05110000
WRTDOSFX DS    0H                                                       05120000
         STCM  R1,7,CONCCW4+1      Set suffix address                   05130000
         STH   R2,CONCCW4+6           and length in the CCW             05140000
*                                                                       05150000
         MVC   WRT77AD3,GRFX@INP   Set @inpt buffer address             05160000
         MVC   WRT77AD4,GRFX@STA   Set @stat buffer address             05170000
         L     R14,=A(DMKSYSID)    Move in systemId                     05180000
         MVC   WRT77SID,0(R14)     ...                                  05190000
         MVC   WRT77ATT,GRFXATOA   Set lower right attr                 05200000
*                                                                       05210000
         LA    R1,CONCCW1          Use CCWs in CONTASK                  05220000
         TM    CONPARM,ALARM       Alarm with message??                 05230000
         BZ    EXITR1              no, just exit                        05240000
         OI    TRQBFLAG,CRTALRM    Flag screen alarm                    05250000
         OI    WRT77WCC,WCCALARM   Add alaarm bit to WCC                05260000
         B     EXITR1              and return to caller                 05270000
*                                                                       05280000
         POP   USING                                                    05290000
         SPACE 3                                                        05300000
*-------------------------------------------------------------          05310000
*        WRT Channel Program template                                   05320000
*-------------------------------------------------------------          05330000
         SPACE 1                                                        05340000
WRT77CP  DS    0D                                                       05350000
         CCW   CCWSEL,0,SILI+CC,1       Select                          05360000
         CCW   CCWWRT,*-*,SILI+CD,*-*   Write: WCC, etc heading         05370000
         CCW   0,*-*,SILI+CD,*-*        Write output data               05380000
         CCW   0,*-*,SILI,*-*           Write trailer                   05390000
WRT77CPL EQU   *-WRT77CP                                                05400000
         SPACE 1                                                        05410000
*-------------------------------------------------------------          05420000
*        WRT Data Stream template                                       05430000
*-------------------------------------------------------------          05440000
         SPACE 1                                                        05450000
WRT77DS  EQU   *                                                        05460000
WRT77WCC DC    AL1(WCCUNLK)   unlock keyboard                           05470000
         DC    AL1(SBA)                                                 05480000
WRT77AD1 DC    AL2(*-*)       line addr                                 05490000
WRT77LN1 EQU   *-WRT77DS      heading len (no hilite or line 0)         05500000
*                                                                       05510000
         DC    AL1(SF,FLDHIPRO) hilite not line 0                       05520000
WRT77LN2 EQU   *-WRT77DS      heading len (w/hilite not row 0)          05530000
*                                                                       05540000
*        then output data goes here                                     05550000
*                                                                       05560000
WRT77SF1 EQU   *              footer (hilite not row 0)                 05570000
         DC    AL1(SBA)                                                 05580000
WRT77AD2 DC    AL2(*-*)       line end addr                             05590000
         DC    AL1(SF,FLDPROT)                                          05600000
*                                                                       05610000
WRT77SF2 EQU   *                                                        05620000
         DC    AL1(SBA)                                                 05630000
WRT77AD3 DC    AL2(*-*)       Input area buffer address                 05640000
         DC    AL1(SF,FLDCHNG)                                          05650000
         DC    AL1(SBA)                                                 05660000
WRT77AD4 DC    AL2(*-*)       Status area buffer address                05670000
         DC    AL1(SF,FLDPROT)                                          05680000
         DC    CL9'RUNNING'                                             05690000
         DC    AL1(SF,FLDPROT)                                          05700000
WRT77SID DC    CL8'*-*'                                                 05710000
         DC    AL1(SF)        Output area attr                          05720000
WRT77ATT DC    AL1(*-*)       FLDPROT or HIPRO if hilite line 0         05730000
*                                                                       05740000
WRT77LN3 EQU   *-WRT77SF1     len of hilite not row 0                   05750000
WRT77LN4 EQU   *-WRT77SF2     others                                    05760000
*                                                                       05770000
WRT77DSL EQU   *-WRT77DS      total length for move                     05780000
         EJECT ,                                                        05790000
* +--------------------------------------------------------+            05800000
* |                                                        |            05810000
* |      C L R : Clear & format the whole screen           |            05820000
* |                                                        |            05830000
* |      Input:                                            |            05840000
* |      none                                              |            05850000
* |                                                        |            05860000
* |      0B (Select)                                       |            05870000
* |      01 (Write) WCC kbreset                            |            05880000
* |                 SBA 0,0                                |            05890000
* |                 RA  @inpt;0                            |            05900000
* |                 SF  unprotected, low, mdt              |            05910000
* |                 IC                                     |            05920000
* |                 SBA @stat                              |            05930000
* |                 SF  prot-low                           |            05940000
* |                 CL9'RUNNING'                           |            05950000
* |                 SF  prot-low                           |            05960000
* |                 CL8'sysid'                             |            05970000
* |                 SF  prot-low                           |            05980000
* |                                                        |            05990000
* |      note: Vanilla VM/370 does the RA in 480-byte      |            06000000
* |            chunks. The component description manuals   |            06010000
* |            only talk about that limitation for the     |            06020000
* |            remote terminals: 3275 and 3172 controller  |            06030000
* |                                                        |            06040000
* +--------------------------------------------------------+            06050000
         SPACE 1                                                        06060000
         PUSH  USING                                                    06070000
BLD77CLR DS    0H      Clear screen                                     06080000
         MVC   GRFCCW1(CLR77CPL),CLR77CP  Channel program               06090000
         MVC   GRFXBUFF(CLR77DSL),CLR77DS Data stream                   06100000
*                                                                       06110000
         LA    R1,CLR77DSL        Set data stream length                06120000
         STH   R1,GRFCCW2+6         into the write CCW                  06130000
         LA    R3,GRFXBUFF        Data stream goes here                 06140000
         STCM  R3,7,GRFCCW2+1     plug in CCW address                   06150000
*                                                                       06160000
         USING CLR77DS,R3         Fill in variables                     06170000
         SR    R1,R1              Set home addr                         06180000
         TM    RDEVGRIC,RDEVAD14  14-bit addressing                     06190000
         BO    CLRADDR1           yes, use addr as-is                   06200000
         CALL  DMKCVT12           no, convert to 12-bit                 06210000
CLRADDR1 DS    0H                                                       06220000
         STCM  R1,3,CLR77AD1      Set top-left buffer addr              06230000
         MVC   CLR77AD2,GRFX@INP  Set input area addr                   06240000
         MVC   CLR77AD3,GRFX@STA  Set status area addr                  06250000
         L     R14,=A(DMKSYSID)   Move in systemId                      06260000
         MVC   CLR77SID,0(R14)    ...                                   06270000
*                                                                       06280000
         MVI   GRFXATOA,FLDPROT   reset bottom right attr               06290000
*                                                                       06300000
         B     GOODEXIT           all set.. return to caller            06310000
         SPACE 1                                                        06320000
         POP   USING                                                    06330000
         SPACE 3                                                        06340000
*-------------------------------------------------------------          06350000
*        CLR Channel Program template                                   06360000
*-------------------------------------------------------------          06370000
         SPACE 1                                                        06380000
CLR77CP  DS    0D                                                       06390000
         CCW   CCWSEL,0,SILI+CC,1       Select                          06400000
         CCW   CCWWRT,*-*,SILI,*-*      Write: WCC, etc heading         06410000
CLR77CPL EQU   *-CLR77CP                                                06420000
         SPACE 1                                                        06430000
*-------------------------------------------------------------          06440000
*        CLR Data Stream template                                       06450000
*-------------------------------------------------------------          06460000
         SPACE 1                                                        06470000
CLR77DS  EQU   *                                                        06480000
         DC    AL1(WCCUNLK)   unlock keyboard                           06490000
         DC    AL1(SBA)                                                 06500000
CLR77AD1 DC    AL2(*-*)       0,0                                       06510000
         DC    AL1(RA)                                                  06520000
CLR77AD2 DC    AL2(*-*)       input area buffer address                 06530000
         DC    AL1(SF,FLDCHNG)                                          06540000
         DC    AL1(IC)                                                  06550000
         DC    AL1(SBA)                                                 06560000
CLR77AD3 DC    AL2(*-*)       Status area buffer address                06570000
         DC    AL1(SF,FLDPROT)                                          06580000
         DC    CL9'RUNNING'                                             06590000
         DC    AL1(SF,FLDPROT)                                          06600000
CLR77SID DC    CL8'*-*'                                                 06610000
         DC    AL1(SF,FLDPROT) Bottom-right (OutArea) attr              06620000
*                                                                       06630000
CLR77DSL EQU   *-CLR77DS      data stream length                        06640000
         EJECT ,                                                        06650000
* +--------------------------------------------------------+            06660000
* |                                                        |            06670000
* |      C L S : Clear screen with Erase Write             |            06680000
* |                                                        |            06690000
* |      Input:                                            |            06700000
* |      none                                              |            06710000
* |                                                        |            06720000
* |      05/0D (EW) WCC kbreset                            |            06730000
* |                 SBA @inpt                              |            06740000
* |                 SF  unprot+hidden+mdt                  |            06750000
* |                 IC                                     |            06760000
* |                 EUA @stat                              |            06770000
* |                 SBA @inpt                              |            06780000
* |                 SF  unprot+low+mdt                     |            06790000
* |                 SBA @stat                              |            06800000
* |                 SF  prot-low                           |            06810000
* |                 CL9'RUNNING'                           |            06820000
* |                 SF  prot-low                           |            06830000
* |                 CL8'sysid'                             |            06840000
* |                 SF  prot-low                           |            06850000
* |                                                        |            06860000
* +--------------------------------------------------------+            06870000
         SPACE 1                                                        06880000
         PUSH  USING                                                    06890000
BLD77CLS DS    0H      Clear screen                                     06900000
         MVC   GRFCCW1(CLS77CPL),CLS77CP  Channel program               06910000
         MVC   GRFXBUFF(CLS77DSL),CLS77DS Data stream                   06920000
*                                                                       06930000
         MVC   GRFCCW1(1),GRFXERAS Seet EW/EWA CCW opcode               06940000
*                                                                       06950000
         LA    R1,CLS77DSL        Set data stream length                06960000
         STH   R1,GRFCCW1+6         into the write CCW                  06970000
         LA    R3,GRFXBUFF        Data stream goes here                 06980000
         STCM  R3,7,GRFCCW1+1     plug in CCW address                   06990000
*                                                                       07000000
         USING CLS77DS,R3         Fill in variables                     07010000
         MVC   CLS77AD1,GRFX@INP  Set input area addr                   07020000
         MVC   CLS77AD2,GRFX@STA  Set status area addr                  07030000
         MVC   CLS77AD3,GRFX@INP  Set input area addr                   07040000
         MVC   CLS77AD4,GRFX@STA  Set status area addr                  07050000
         L     R14,=A(DMKSYSID)   Move in systemId                      07060000
         MVC   CLS77SID,0(R14)    ...                                   07070000
*                                                                       07080000
         MVI   GRFXATOA,FLDPROT   reset bottom right attr               07090000
*                                                                       07100000
         B     GOODEXIT           all set.. return to caller            07110000
         SPACE 1                                                        07120000
         POP   USING                                                    07130000
         SPACE 3                                                        07140000
*-------------------------------------------------------------          07150000
*        CLS Channel Program template                                   07160000
*-------------------------------------------------------------          07170000
         SPACE 1                                                        07180000
CLS77CP  DS    0D                                                       07190000
         CCW   *-*,*-*,SILI,*-*   Erase Write (Alternate)               07200000
CLS77CPL EQU   *-CLS77CP                                                07210000
         SPACE 1                                                        07220000
*-------------------------------------------------------------          07230000
*        CLS Data Stream template                                       07240000
*-------------------------------------------------------------          07250000
         SPACE 1                                                        07260000
CLS77DS  EQU   *                                                        07270000
         DC    AL1(WCCUNLK)                                             07280000
         DC    AL1(SBA)                                                 07290000
CLS77AD1 DC    AL2(*-*)       input area buffer addr                    07300000
         DC    AL1(SF,FLDHIDMT)                                         07310000
         DC    AL1(IC)                                                  07320000
         DC    AL1(EUA)                                                 07330000
CLS77AD2 DC    AL2(*-*)       status area buffer address                07340000
         DC    AL1(SBA)                                                 07350000
CLS77AD3 DC    AL2(*-*)       input area buffer address                 07360000
         DC    AL1(SF,FLDCHNG)                                          07370000
         DC    AL1(SBA)                                                 07380000
CLS77AD4 DC    AL2(*-*)       status area buffer address                07390000
         DC    AL1(SF,FLDPROT)                                          07400000
         DC    CL9'RUNNING'                                             07410000
         DC    AL1(SF,FLDPROT)                                          07420000
CLS77SID DC    CL8'*-*'                                                 07430000
         DC    AL1(SF,FLDPROT) Bottom-right (OutArea) attr              07440000
*                                                                       07450000
CLS77DSL EQU   *-CLS77DS      data stream length                        07460000
         EJECT ,                                                        07470000
* +--------------------------------------------------------+            07480000
* |                                                        |            07490000
* |      C R D : Clear the input area                      |            07500000
* |                                                        |            07510000
* |      Input:                                            |            07520000
* |      none                                              |            07530000
* |                                                        |            07540000
* |      0B (Select)                                       |            07550000
* |      01 (Write) WCC kbreset                            |            07560000
* |                 SBA @inpt                              |            07570000
* |                 SF  unprot+hidden+mdt                  |            07580000
* |                 IC                                     |            07590000
* |                 EUA @stat                              |            07600000
* |                 SBA @inpt                              |            07610000
* |                 SF  unprot+low+mdt                     |            07620000
* |                 SBA @stat                              |            07630000
* |                 SF  prot-low                           |            07640000
* |                 CL9'RUNNING'                           |            07650000
* |                 SF  prot-low                           |            07660000
* |                 CL8'sysid'                             |            07670000
* |                 SF  OutArea-attr                       |            07680000
* |                                                        |            07690000
* +--------------------------------------------------------+            07700000
         SPACE 1                                                        07710000
         PUSH  USING                                                    07720000
BLD77CRD DS    0H      Clear screen                                     07730000
         MVC   GRFCCW1(CRD77CPL),CRD77CP  Channel program               07740000
         MVC   GRFXBUFF(CRD77DSL),CRD77DS Data stream                   07750000
*                                                                       07760000
         LA    R1,CRD77DSL        Set data stream length                07770000
         STH   R1,GRFCCW2+6         into the write CCW                  07780000
         LA    R3,GRFXBUFF        Data stream goes here                 07790000
         STCM  R3,7,GRFCCW2+1     plug in CCW address                   07800000
*                                                                       07810000
         USING CRD77DS,R3         Fill in variables                     07820000
         MVC   CRD77AD1,GRFX@INP  Set input area addr                   07830000
         MVC   CRD77AD2,GRFX@STA  Set status area addr                  07840000
         MVC   CRD77AD3,GRFX@INP  Set input area addr                   07850000
         MVC   CRD77AD4,GRFX@STA  Set status area addr                  07860000
         L     R14,=A(DMKSYSID)   Move in systemId                      07870000
         MVC   CRD77SID,0(R14)    ...                                   07880000
         MVC   CRD77ATT,GRFXATOA  Set lower right attr                  07890000
*                                                                       07900000
         B     GOODEXIT           all set.. return to caller            07910000
         SPACE 1                                                        07920000
         POP   USING                                                    07930000
         SPACE 3                                                        07940000
*-------------------------------------------------------------          07950000
*        CRD Channel Program template                                   07960000
*-------------------------------------------------------------          07970000
         SPACE 1                                                        07980000
CRD77CP  DS    0D                                                       07990000
         CCW   CCWSEL,0,SILI+CC,1       Select                          08000000
         CCW   CCWWRT,*-*,SILI,*-*      Write: WCC, etc heading         08010000
CRD77CPL EQU   *-CRD77CP                                                08020000
         SPACE 1                                                        08030000
*-------------------------------------------------------------          08040000
*        CRD Data Stream template                                       08050000
*-------------------------------------------------------------          08060000
         SPACE 1                                                        08070000
CRD77DS  EQU   *                                                        08080000
         DC    AL1(WCCUNLK)                                             08090000
         DC    AL1(SBA)                                                 08100000
CRD77AD1 DC    AL2(*-*)       input area buffer addr                    08110000
         DC    AL1(SF,FLDHIDMT)                                         08120000
         DC    AL1(IC)                                                  08130000
         DC    AL1(EUA)                                                 08140000
CRD77AD2 DC    AL2(*-*)       status area buffer address                08150000
         DC    AL1(SBA)                                                 08160000
CRD77AD3 DC    AL2(*-*)       input area buffer address                 08170000
         DC    AL1(SF,FLDCHNG)                                          08180000
         DC    AL1(SBA)                                                 08190000
CRD77AD4 DC    AL2(*-*)       status area buffer address                08200000
         DC    AL1(SF,FLDPROT)                                          08210000
         DC    CL9'RUNNING'                                             08220000
         DC    AL1(SF,FLDPROT)                                          08230000
CRD77SID DC    CL8'*-*'                                                 08240000
         DC    AL1(SF)        Output area attr                          08250000
CRD77ATT DC    AL1(*-*)       FLDPROT or HIPRO if hilite line 0         08260000
*                                                                       08270000
CRD77DSL EQU   *-CRD77DS      data stream length                        08280000
         EJECT ,                                                        08290000
* +--------------------------------------------------------+            08300000
* |                                                        |            08310000
* |      M R D : Clear input area when in MORE or HOLDING  |            08320000
* |                                                        |            08330000
* |      Input:                                            |            08340000
* |      none                                              |            08350000
* |                                                        |            08360000
* |      0B (Select)                                       |            08370000
* |      01 (Write) WCC kbreset                            |            08380000
* |                 SBA @inpt                              |            08390000
* |                 SF  unprot+hidden+mdt                  |            08400000
* |                 IC                                     |            08410000
* |                 EUA @stat                              |            08420000
* |                 SBA @inpt                              |            08430000
* |                 SF  unprot+low+mdt                     |            08440000
* |                                                        |            08450000
* +--------------------------------------------------------+            08460000
         SPACE 1                                                        08470000
         PUSH  USING                                                    08480000
BLD77MRD DS    0H      Clear screen                                     08490000
         MVC   GRFCCW1(MRD77CPL),MRD77CP  Channel program               08500000
         MVC   GRFXBUFF(MRD77DSL),MRD77DS Data stream                   08510000
*                                                                       08520000
         LA    R1,MRD77DSL        Set data stream length                08530000
         STH   R1,GRFCCW2+6         into the write CCW                  08540000
         LA    R3,GRFXBUFF        Data stream goes here                 08550000
         STCM  R3,7,GRFCCW2+1     plug in CCW address                   08560000
*                                                                       08570000
         USING MRD77DS,R3         Fill in variables                     08580000
         MVC   MRD77AD1,GRFX@INP  Set input area addr                   08590000
         MVC   MRD77AD2,GRFX@STA  Set status area addr                  08600000
         MVC   MRD77AD3,GRFX@INP  Set input area addr                   08610000
*                                                                       08620000
         B     GOODEXIT           all set.. return to caller            08630000
         SPACE 1                                                        08640000
         POP   USING                                                    08650000
         SPACE 3                                                        08660000
*-------------------------------------------------------------          08670000
*        MRD Channel Program template                                   08680000
*-------------------------------------------------------------          08690000
         SPACE 1                                                        08700000
MRD77CP  DS    0D                                                       08710000
         CCW   CCWSEL,0,SILI+CC,1       Select                          08720000
         CCW   CCWWRT,*-*,SILI,*-*      Write: WCC, etc heading         08730000
MRD77CPL EQU   *-MRD77CP                                                08740000
         SPACE 1                                                        08750000
*-------------------------------------------------------------          08760000
*        MRD Data Stream template                                       08770000
*-------------------------------------------------------------          08780000
         SPACE 1                                                        08790000
MRD77DS  EQU   *                                                        08800000
         DC    AL1(WCCUNLK)                                             08810000
         DC    AL1(SBA)                                                 08820000
MRD77AD1 DC    AL2(*-*)       input area buffer addr                    08830000
         DC    AL1(SF,FLDHIDMT)                                         08840000
         DC    AL1(IC)                                                  08850000
         DC    AL1(EUA)                                                 08860000
MRD77AD2 DC    AL2(*-*)       status area buffer address                08870000
         DC    AL1(SBA)                                                 08880000
MRD77AD3 DC    AL2(*-*)       input area buffer address                 08890000
         DC    AL1(SF,FLDCHNG)                                          08900000
*                                                                       08910000
MRD77DSL EQU   *-MRD77DS      data stream length                        08920000
         EJECT ,                                                        08930000
* +--------------------------------------------------------+            08940000
* |                                                        |            08950000
* |      I D S : Write to input area                       |            08960000
* |                                                        |            08970000
* |      Input:                                            |            08980000
* |      R3:   length of data to display                   |            08990000
* |      R4:   address of data to display                  |            09000000
* |                                                        |            09010000
* |      0B (Select)                                       |            09020000
* |      01 (Write)  WCC kbreset                           |            09030000
* |                  SBA @inpt                             |            09040000
* |                  EUA @stat                             |            09050000
* |                  SBA @inpt                             |            09060000
* |                  SF  attr7                             |            09070000
* |                  IC                                    |            09080000
* |                                                        |            09090000
* |      00 data chained for caller's data                 |            09100000
* |                                                        |            09110000
* +--------------------------------------------------------+            09120000
         SPACE 1                                                        09130000
         PUSH  USING                                                    09140000
BLD77IDS DS    0H      Write to input area                              09150000
         MVC   GRFCCW1(IDS77CPL),IDS77CP  Channel program               09160000
         MVC   GRFXBUFF(IDS77DSL),IDS77DS Data stream                   09170000
*                                                                       09180000
         STCM  R4,7,GRFCCW3+1     Set caller's data address             09190000
         STH   R3,GRFCCW3+6          and length                         09200000
*                                                                       09210000
         LA    R1,IDS77DSL        Set data stream length                09220000
         STH   R1,GRFCCW2+6         into the write CCW                  09230000
         LA    R3,GRFXBUFF        Data stream goes here                 09240000
         STCM  R3,7,GRFCCW2+1     plug in CCW address                   09250000
*                                                                       09260000
         USING IDS77DS,R3         Fill in variables                     09270000
         MVC   IDS77AD1,GRFX@INP  Set input area addr                   09280000
         MVC   IDS77AD2,GRFX@STA  Set status area addr                  09290000
         MVC   IDS77AD3,GRFX@INP  Set input area addr                   09300000
*                                                                       09310000
         B     GOODEXIT           all set.. return to caller            09320000
         SPACE 1                                                        09330000
         POP   USING                                                    09340000
         SPACE 3                                                        09350000
*-------------------------------------------------------------          09360000
*        IDS Channel Program template                                   09370000
*-------------------------------------------------------------          09380000
         SPACE 1                                                        09390000
IDS77CP  DS    0D                                                       09400000
         CCW   CCWSEL,0,SILI+CC,1       Select                          09410000
         CCW   CCWWRT,*-*,SILI+CD,*-*   Write: WCC, etc heading         09420000
         CCW   0,*-*,SILI,*-*           write caller's data             09430000
IDS77CPL EQU   *-IDS77CP                                                09440000
         SPACE 1                                                        09450000
*-------------------------------------------------------------          09460000
*        IDS Data Stream template                                       09470000
*-------------------------------------------------------------          09480000
         SPACE 1                                                        09490000
IDS77DS  EQU   *                                                        09500000
         DC    AL1(WCCUNLK)                                             09510000
         DC    AL1(SBA)                                                 09520000
IDS77AD1 DC    AL2(*-*)       input area buffer addr                    09530000
         DC    AL1(EUA)                                                 09540000
IDS77AD2 DC    AL2(*-*)       status area buffer address                09550000
         DC    AL1(SBA)                                                 09560000
IDS77AD3 DC    AL2(*-*)       input area buffer address                 09570000
         DC    AL1(SF,FLDCHNG)                                          09580000
         DC    AL1(IC)                                                  09590000
*                                                                       09600000
IDS77DSL EQU   *-IDS77DS      data stream length                        09610000
         EJECT ,                                                        09620000
* +--------------------------------------------------------+            09630000
* |                                                        |            09640000
* |      T A B : Insert tab character & move cursor        |            09650000
* |                                                        |            09660000
* |      Input:                                            |            09670000
* |      R0  = Length of TAB set list                      |            09680000
* |      R1  = address of TAB set list                     |            09690000
* |      R3  = current input BUFFER                        |            09700000
* |                                                        |            09710000
* |      0B (Select)                                       |            09720000
* |      01 (Write) WCC                                    |            09730000
* |                 SBA @inpt                              |            09740000
* |      06 (RM)    buffer                                 |            09750000
* |                                                        |            09760000
* +--------------------------------------------------------+            09770000
         SPACE 1                                                        09780000
         PUSH  USING                                                    09790000
BLD77TAB DS    0H      Insert a logical tab & move cursor               09800000
         USING BUFFER,R3          Need access to current input          09810000
         SPACE 1                                                        09820000
         LR    R4,R0              Save input parms                      09830000
         LR    R5,R1              ...                                   09840000
*                                                                       09850000
*        Initialize resulting channel program                           09860000
*                                                                       09870000
         MVC   GRFCCW1(TAB77CPL),TAB77CP  Channel program               09880000
         MVC   GRFXBUFF(TAB77DSL),TAB77DS Data stream                   09890000
*                                                                       09900000
         LA    R1,TAB77DSL        Set data stream length                09910000
         STH   R1,GRFCCW2+6         into the write CCW                  09920000
         LA    R2,GRFXBUFF        Data stream goes here                 09930000
         STCM  R2,7,GRFCCW2+1     plug in CCW address                   09940000
*                                                                       09950000
         USING TAB77DS,R2         Fill in variables                     09960000
*                                                                       09970000
*        Get current relative column number                             09980000
*                                                                       09990000
         SR    R1,R1                                                    10000000
         ICM   R1,3,BUFCSR        Get current cursor address            10010000
         CALL  DMKCVT14           ...                                   10020000
         SH    R1,GRFXORGI        R1 = current 0-based column           10030000
         LR    R7,R1              (keep in R7)                          10040000
*                                                                       10050000
*        Scan TAB sets to find target column                            10060000
*                                                                       10070000
         LTR   R4,R4              Are there any                         10080000
         BNP   TABEGIN            No, put cursor at start               10090000
*                                                                       10100000
TABSCAN  DS    0H                                                       10110000
         CLM   R7,1,0(R5)         Is this the place to tab to?          10120000
         BL    TABHIGH            Yes if current column is lower        10130000
         LA    R5,1(,R5)          Bump to next tab stop                 10140000
         BCT   R4,TABSCAN         Scan all the tab stops                10150000
*                                                                       10160000
TABEGIN  DS    0H                                                       10170000
         SR    R7,R7              Put cursor back at the start          10180000
*                                                                       10190000
*        No logical tab needed.. Just the IC                            10200000
*                                                                       10210000
TABONE   DS    0H                                                       10220000
         LA    R1,TAB77LN1        Set length w/o logical tab            10230000
         STH   R1,GRFCCW2+6       ...                                   10240000
*                                                                       10250000
TABTWO   DS    0H             Both logical tab and IC needed            10260000
         BAL   R6,TABADDR         Convert & store buffer address        10270000
         MVI   TAB77TAB,IC        and add Insert Cursor order           10280000
*                                                                       10290000
         B     GOODEXIT                                                 10300000
*                                                                       10310000
*        Figure out where to place the logical tab                      10320000
*                                                                       10330000
TABHIGH  DS    0H                                                       10340000
         IC    R7,0(,R5)          Get target tab stop column            10350000
         L     R5,SAVER1          Restore ptr to tab stops              10360000
         LA    R4,BUFDATA         And ptr to the current input          10370000
         SLR   R3,R3              Init ctr for logical tab loc          10380000
         IC    R6,VMGRFTAB        Get user's logical tab char           10390000
*                                                                       10400000
TABLOOP  DS    0H                                                       10410000
         CLI   0(R4),0            Have we hit the end of data?          10420000
         BE    TABCHAR            Yes, put logical tab here             10430000
         CLM   R6,1,0(R4)         Previous logical tab here?            10440000
         BE    TABUPDT            Yes, must update tab location         10450000
         LA    R3,1(,R3)          Bump logical tab location             10460000
         CLM   R3,1,0(R5)         Is this also a tab stop?              10470000
         BL    TABDATA            If not, just keep checking            10480000
         LA    R5,1(,R5)          Point to next tab stop                10490000
TABDATA  DS    0H                                                       10500000
         LA    R4,1(,R4)          Bump to next input character          10510000
         CR    R3,R7              Reached the target tab stop?          10520000
         BL    TABLOOP            No, leep looking at input             10530000
         B     TABONE             Yes, no need for logical tab          10540000
*                                                                       10550000
TABUPDT  DS    0H                                                       10560000
         IC    R3,0(,R5)          Bump logical tab location             10570000
         LA    R5,1(,R5)          Point to next tab stop                10580000
         B     TABDATA            and keep checking the input data      10590000
*                                                                       10600000
TABCHAR  DS    0H                                                       10610000
         LR    R5,R7              Save cursor target location           10620000
         LR    R7,R3              Get logical tab location              10630000
         STC   R6,TAB77TAB        Put logical tab in data stream        10640000
         BAL   R6,TABADDR         Convert R7 addr & put in data stream  10650000
         LA    R2,TAB77DSP(,R2)   Bump data stream pointer for IC       10660000
         LR    R7,R5              Restore new cursor target address     10670000
         B     TABTWO             and go ad the IC to the data stream   10680000
         SPACE 2                                                        10690000
*                                                                       10700000
*        Little subroutine to convert & store buffer address            10710000
*                                                                       10720000
TABADDR  DS    0H                                                       10730000
         AH    R7,GRFXORGI        Add back the input area origin        10740000
         LR    R1,R7              pass it in R1                         10750000
         TM    RDEVGRIC,RDEVAD14  14-bit addressing                     10760000
         BO    TABADDR1           yes, use addr as-is                   10770000
         CALL  DMKCVT12           no, convert to 12-bit                 10780000
TABADDR1 DS    0H                                                       10790000
         STCM  R1,3,3(R2)         Put result in data stream             10800000
         BR    R6                 Return to caller                      10810000
         SPACE 1                                                        10820000
         POP   USING                                                    10830000
         SPACE 3                                                        10840000
*-------------------------------------------------------------          10850000
*        TAB Channel Program template                                   10860000
*-------------------------------------------------------------          10870000
         SPACE 1                                                        10880000
TAB77CP  DS    0D                                                       10890000
         CCW   CCWSEL,0,SILI+CC,1       Select                          10900000
         CCW   CCWWRT,*-*,SILI,*-*      Write: WCC, etc heading         10910000
TAB77CPL EQU   *-TAB77CP                                                10920000
         SPACE 1                                                        10930000
*-------------------------------------------------------------          10940000
*        TAB Data Stream template                                       10950000
*-------------------------------------------------------------          10960000
         SPACE 1                                                        10970000
TAB77DS  EQU   *                                                        10980000
         DC    AL1(WCCUNLK)                                             10990000
         DC    AL1(SBA)                                                 11000000
TAB77AD1 DC    AL2(*-*)       where to put logical tab                  11010000
TAB77TAB DC    AL1(*-*)       logical tab char (or IC)                  11020000
*                                                                       11030000
TAB77LN1 EQU   *-TAB77DS      length w/o logical tab                    11040000
*                                                                       11050000
         DC    AL1(SBA)                                                 11060000
TAB77AD2 DC    AL2(*-*)       target column                             11070000
         DC    AL1(IC)                                                  11080000
*                                                                       11090000
TAB77DSP EQU   TAB77AD2-TAB77AD1 2nd SBA displacement                   11100000
*                                                                       11110000
TAB77DSL EQU   *-TAB77DS      data stream length                        11120000
         EJECT ,                                                        11130000
* +--------------------------------------------------------+            11140000
* |                                                        |            11150000
* |      H L D : Set status area to HOLDING                |            11160000
* |      M O R : Set status area to MORE...                |            11170000
* |      N A C : Set status area to NOT ACCEPTED           |            11180000
* |                                                        |            11190000
* |      Input:                                            |            11200000
* |      none                                              |            11210000
* |                                                        |            11220000
* |      0B    (Select)                                    |            11230000
* |      01    (Write) WCC krreset+alarm                   |            11240000
* |                    SBA @stat                           |            11250000
* |                    SF prot-low                         |            11260000
* |                    CL9'HOLDING' or MORE... or ...      |            11270000
* |                    SF prot-low                         |            11280000
* |                    CL8'sysid'                          |            11290000
* |                    SF prot-low   s/b last screen cell  |            11300000
* |                                                        |            11310000
* +--------------------------------------------------------+            11320000
         SPACE 1                                                        11330000
         PUSH  USING                                                    11340000
BLD77HLD DS    0H                                                       11350000
         LA    R5,HLD77OPT    Display options + status                  11360000
         B     BLDSTAT        Join common                               11370000
         SPACE 1                                                        11380000
HLD77OPT EQU   *                                                        11390000
         DC    AL1(WCCUNLK,FLDHIPRO,FLDPROT)                            11400000
         DC    CL9'HOLDING'                                             11410000
         SPACE 2                                                        11420000
BLD77MOR DS    0H                                                       11430000
         LA    R5,MOR77OPT    Display options + status                  11440000
         B     BLDSTAT        Join common                               11450000
         SPACE 1                                                        11460000
MOR77OPT EQU   *                                                        11470000
         DC    AL1(WCCUNLK,FLDHIPRO,FLDPROT)                            11480000
         DC    CL9'MORE...'                                             11490000
         SPACE 2                                                        11500000
BLD77NAC DS    0H                                                       11510000
         LA    R5,NAC77OPT    Display options + status                  11520000
         B     BLDSTAT        Join common                               11530000
         SPACE 1                                                        11540000
NAC77OPT EQU   *                                                        11550000
         DC    AL1(WCCBEEP,FLDHIPRO,0)                                  11560000
         DC    CL18'NOT ACCEPTED'                                       11570000
         SPACE 3                                                        11580000
STATOPT  DSECT ,                                                        11590000
STATWCC  DS    XL1                                                      11600000
STATATT1 DS    XL1                                                      11610000
STATATT2 DS    XL1                                                      11620000
STATMSG  DS    0C                                                       11630000
         SPACE 1                                                        11640000
HDKGRC   CSECT ,                                                        11650000
* +---------------------------------------------------------            11660000
* +      Common status area update channel program                      11670000
* +---------------------------------------------------------            11680000
         SPACE 1                                                        11690000
BLDSTAT  DS    0H                                                       11700000
         USING STATOPT,R5         Address the options                   11710000
         MVC   GRFCCW1(STA77CPL),STA77CP  Channel program               11720000
         MVC   GRFXBUFF(STA77DSL),STA77DS Data stream                   11730000
*                                                                       11740000
         LA    R1,STA77DSL        Set data stream length                11750000
         STH   R1,GRFCCW2+6         into the write CCW                  11760000
         LA    R1,GRFXBUFF        Data stream goes here                 11770000
         STCM  R1,7,GRFCCW2+1     plug in CCW address                   11780000
*                                                                       11790000
         USING STA77DS,R1         Fill in variables                     11800000
         MVC   STA77WCC,STATWCC   Set WCC from options                  11810000
         MVC   STA77SBA,GRFX@STA  ... status area buffer addr           11820000
         MVC   STA77AT1,STATATT1  ... status area attribute             11830000
*                                                                       11840000
         CLI   STATATT2,0         long status?                          11850000
         BNE   STASTD             ..NO                                  11860000
         MVC   STA77LMS,STATMSG   ..yes...move it                       11870000
         MVI   STA77SF4,SF        Set ending attribute                  11880000
         MVC   STA77AT4,GRFXATOA  .. maybe hilite row 0?                11890000
*                                                                       11900000
         LA    R0,STA77LML        Set correct length                    11910000
         STH   R0,GRFCCW2+6       ...                                   11920000
         B     GOODEXIT           and return to caller                  11930000
*                                                                       11940000
STASTD   DS    0H                                                       11950000
         MVC   STA77SMS,STATMSG   Set status                            11960000
         MVI   STA77SF2,SF        SysId attr                            11970000
         MVC   STA77AT2,STATATT2  as per options                        11980000
         L     R14,=A(DMKSYSID)   Move in systemId                      11990000
         MVC   STA77SID,0(R14)    ...                                   12000000
         MVI   STA77SF3,SF        Set ending attribute                  12010000
         MVC   STA77AT3,GRFXATOA  .. maybe hilite row 0?                12020000
*                                                                       12030000
         LA    R0,STA77SML        Set correct length                    12040000
         STH   R0,GRFCCW2+6       ...                                   12050000
         B     GOODEXIT           and return to caller                  12060000
         SPACE 1                                                        12070000
         POP   USING                                                    12080000
         SPACE 3                                                        12090000
*-------------------------------------------------------------          12100000
*        Status update Channel Program template                         12110000
*-------------------------------------------------------------          12120000
         SPACE 1                                                        12130000
STA77CP  DS    0D                                                       12140000
         CCW   CCWSEL,0,SILI+CC,1       Select                          12150000
         CCW   CCWWRT,*-*,SILI,*-*      Write: WCC, etc                 12160000
STA77CPL EQU   *-STA77CP                                                12170000
         SPACE 1                                                        12180000
*-------------------------------------------------------------          12190000
*        Status update Data Stream template                             12200000
*-------------------------------------------------------------          12210000
         SPACE 1                                                        12220000
STA77DS  EQU   *                                                        12230000
STA77WCC DC    AL1(*-*)       WCC depends on options                    12240000
         DC    AL1(SBA)                                                 12250000
STA77SBA DC    AL2(*-*)       Status Area buffer address                12260000
         DC    AL1(SF)                                                  12270000
STA77AT1 DC    AL1(*-*)       Attribute from options                    12280000
*                                                                       12290000
STA77STA EQU   *              Variable based on option                  12300000
*                                                                       12310000
STA77SMS DC    CL9'*-*'       Short status                              12320000
STA77SF2 DC    AL1(SF)                                                  12330000
STA77AT2 DC    AL1(*-*)       SysId attr                                12340000
STA77SID DC    CL8'*-*'                                                 12350000
STA77SF3 DC    AL1(SF)        Output area attr                          12360000
STA77AT3 DC    AL1(*-*)                                                 12370000
STA77SML EQU   *-STA77DS                                                12380000
*                                                                       12390000
         ORG   STA77STA       Redefine for long status                  12400000
STA77LMS DC    CL18'*-*'      long status                               12410000
STA77SF4 DC    AL1(SF)        Output area attr                          12420000
STA77AT4 DC    AL1(*-*)                                                 12430000
STA77LML EQU   *-STA77DS                                                12440000
         ORG   ,                                                        12450000
STA77DSL EQU   *-STA77DS                                                12460000
         EJECT ,                                                        12470000
* +--------------------------------------------------------+            12480000
* |                                                        |            12490000
* |      R U N : Set status area to RUNNING                |            12500000
* |                                                        |            12510000
* |      Input:                                            |            12520000
* |      none                                              |            12530000
* |                                                        |            12540000
* |      0B    (Select)                                    |            12550000
* |      01    (Write) WCC krreset+clear MDTs              |            12560000
* |                    SBA @inpt                           |            12570000
* |                    SF prot-low+MDT                     |            12580000
* |                    SBA @stat                           |            12590000
* |                    SF prot-low                         |            12600000
* |                    CL9'RUNNING'                        |            12610000
* |                    SF prot-low                         |            12620000
* |                    CL8'sysid'                          |            12630000
* |                    SF prot-low   s/b last screen cell  |            12640000
* |                                                        |            12650000
* +--------------------------------------------------------+            12660000
         SPACE 1                                                        12670000
         PUSH  USING                                                    12680000
BLD77RUN DS    0H                                                       12690000
         MVC   GRFCCW1(RUN77CPL),RUN77CP  Channel program               12700000
         MVC   GRFXBUFF(RUN77DSL),RUN77DS Data stream                   12710000
*                                                                       12720000
         LA    R1,RUN77DSL        Set data stream length                12730000
         STH   R1,GRFCCW2+6         into the write CCW                  12740000
         LA    R1,GRFXBUFF        Data stream goes here                 12750000
         STCM  R1,7,GRFCCW2+1     plug in CCW address                   12760000
*                                                                       12770000
         USING RUN77DS,R1         Fill in variables                     12780000
         MVC   RUN77AD1,GRFX@INP  ... input area buffer addr            12790000
         MVC   RUN77AD2,GRFX@STA  ... status area buffer addr           12800000
         L     R14,=A(DMKSYSID)   Move in systemId                      12810000
         MVC   RUN77SID,0(R14)    ...                                   12820000
         MVC   RUN77ATT,GRFXATOA  .. maybe hilite row 0?                12830000
*                                                                       12840000
         B     GOODEXIT           and return to caller                  12850000
         SPACE 1                                                        12860000
         POP   USING                                                    12870000
         SPACE 3                                                        12880000
*-------------------------------------------------------------          12890000
*        RUNNUNG status Channel Program template                        12900000
*-------------------------------------------------------------          12910000
         SPACE 1                                                        12920000
RUN77CP  DS    0D                                                       12930000
         CCW   CCWSEL,0,SILI+CC,1       Select                          12940000
         CCW   CCWWRT,*-*,SILI,*-*      Write: WCC, etc                 12950000
RUN77CPL EQU   *-RUN77CP                                                12960000
         SPACE 1                                                        12970000
*-------------------------------------------------------------          12980000
*        RUNNUNG status Data Stream template                            12990000
*-------------------------------------------------------------          13000000
         SPACE 1                                                        13010000
RUN77DS  EQU   *                                                        13020000
         DC    AL1(WCCNMDT)   Reset kbd and clear MDTs                  13030000
         DC    AL1(SBA)                                                 13040000
RUN77AD1 DC    AL2(*-*)       Input area buffer address                 13050000
         DC    AL1(SF)                                                  13060000
         DC    AL1(FLDCHNG)   Unprotected, low, mdt                     13070000
         DC    AL1(SBA)                                                 13080000
RUN77AD2 DC    AL2(*-*)       Status area buffer address                13090000
         DC    AL1(SF,FLDPROT)                                          13100000
         DC    CL9'RUNNING'                                             13110000
         DC    AL1(SF,FLDPROT) Sysid attr                               13120000
RUN77SID DC    CL8'*-*'                                                 13130000
         DC    AL1(SF)                                                  13140000
RUN77ATT DC    AL1(*-*)       Hilite for row 0                          13150000
RUN77DSL EQU   *-RUN77DS                                                13160000
         EJECT ,                                                        13170000
* +--------------------------------------------------------+            13180000
* |                                                        |            13190000
* |      V M R : Set status area to VM READ                |            13200000
* |      V M P : Set status area to VM READ (w/inhibit)    |            13210000
* |      C P R : Set status area to CP READ                |            13220000
* |      C P P : Set status area to CP READ (w/inhibit)    |            13230000
* |                                                        |            13240000
* |      Input:                                            |            13250000
* |      none                                              |            13260000
* |                                                        |            13270000
* |      0B    (Select)                                    |            13280000
* |      01    (Write) WCC krreset+clear MDTs              |            13290000
* |                    SBA @inpt                           |            13300000
* |                    SF not-prot+MDT  or hidden+MDT      |            13310000
* |                    SBA @stat                           |            13320000
* |                    SF prot-high                        |            13330000
* |                    CL9'xx READ                         |            13340000
* |                    SF prot-low                         |            13350000
* |                    CL8'sysid'                          |            13360000
* |                    SF prot-low   s/b last screen cell  |            13370000
* |                                                        |            13380000
* +--------------------------------------------------------+            13390000
         SPACE 1                                                        13400000
         PUSH  USING                                                    13410000
BLD77VMR DS    0H                                                       13420000
         LA    R0,FLDCHNG         Input area attribute                  13430000
         B     BLD77VMX           join common code                      13440000
         SPACE 1                                                        13450000
BLD77VMP DS    0H                                                       13460000
         LA    R0,FLDHIDMT        Hide input area                       13470000
BLD77VMX DS    0H                                                       13480000
         LA    R2,=CL9'VM READ'   Status area value                     13490000
         B     BLDREAD            join common code                      13500000
         SPACE 1                                                        13510000
BLD77CPR DS    0H                                                       13520000
         LA    R0,FLDCHNG         Input area attribute                  13530000
         B     BLD77CPX           join common code                      13540000
         SPACE 1                                                        13550000
BLD77CPP DS    0H                                                       13560000
         LA    R0,FLDHIDMT        Hide input area                       13570000
BLD77CPX DS    0H                                                       13580000
         LA    R2,=CL9'CP READ'   Status area value                     13590000
*        B     BLDREAD            join common code                      13600000
         SPACE 2                                                        13610000
* +---------------------------------------------------------            13620000
* +      Common VM/CP READ status area logic                            13630000
* +---------------------------------------------------------            13640000
         SPACE 1                                                        13650000
BLDREAD  DS    0H                                                       13660000
         MVC   GRFCCW1(RDR77CPL),RDR77CP  Channel program               13670000
         MVC   GRFXBUFF(RDR77DSL),RDR77DS Data stream                   13680000
*                                                                       13690000
         LA    R1,RDR77DSL        Set data stream length                13700000
         STH   R1,GRFCCW2+6         into the write CCW                  13710000
         LA    R1,GRFXBUFF        Data stream goes here                 13720000
         STCM  R1,7,GRFCCW2+1     plug in CCW address                   13730000
*                                                                       13740000
         USING RDR77DS,R1         Fill in variables                     13750000
         MVC   RDR77AD1,GRFX@INP  ... input area buffer addr            13760000
         STC   R0,RDR77ATT        ... input area attribute              13770000
*                                                                       13780000
         MVC   RDR77AD2,GRFX@STA  Status area buffer address            13790000
         MVC   RDR77STA,0(R2)     Status message                        13800000
         L     R14,=A(DMKSYSID)   Move in systemId                      13810000
         MVC   RDR77SID,0(R14)    ...                                   13820000
         MVC   RDR77ATZ,GRFXATOA  .. maybe hilite row 0?                13830000
*                                                                       13840000
         B     GOODEXIT           and return to caller                  13850000
         SPACE 1                                                        13860000
         POP   USING                                                    13870000
         SPACE 3                                                        13880000
*-------------------------------------------------------------          13890000
*        VM/CP READ Channel Program template                            13900000
*-------------------------------------------------------------          13910000
         SPACE 1                                                        13920000
RDR77CP  DS    0D                                                       13930000
         CCW   CCWSEL,0,SILI+CC,1       Select                          13940000
         CCW   CCWWRT,*-*,SILI,*-*      Write: WCC, etc                 13950000
RDR77CPL EQU   *-RDR77CP                                                13960000
         SPACE 1                                                        13970000
*-------------------------------------------------------------          13980000
*        VM/CP READ Data Stream template                                13990000
*-------------------------------------------------------------          14000000
         SPACE 1                                                        14010000
RDR77DS  EQU   *                                                        14020000
         DC    AL1(WCCNMDT)   WCC depends on options                    14030000
         DC    AL1(SBA)                                                 14040000
RDR77AD1 DC    AL2(*-*)       Input Area buffer address                 14050000
         DC    AL1(SF)                                                  14060000
RDR77ATT DC    AL1(*-*)       Input area attribute                      14070000
         DC    AL1(SBA)                                                 14080000
RDR77AD2 DC    AL2(*-*)       Status area buffer address                14090000
         DC    AL1(SF,FLDHIPRO)  Attribute from options                 14100000
RDR77STA DC    CL9'*-*'       Short status                              14110000
         DC    AL1(SF,FLDPROT)                                          14120000
RDR77SID DC    CL8'*-*'                                                 14130000
         DC    AL1(SF)                                                  14140000
RDR77ATZ DC    AL1(*-*)       Hilite for row 0                          14150000
RDR77DSL EQU   *-RDR77DS                                                14160000
         EJECT ,                                                        14170000
* +--------------------------------------------------------+            14180000
* |                                                        |            14190000
* |      W N G : Sound the alarm on the terminal           |            14200000
* |                                                        |            14210000
* |      Input:                                            |            14220000
* |      IOBMISC = read buffer address                     |            14230000
* |                                                        |            14240000
* |      0B (Select)                                       |            14250000
* |      01 (Write) WCC                                    |            14260000
* |                 SBA @inpt                              |            14270000
* |      06 (RM)    buffer                                 |            14280000
* |                                                        |            14290000
* +--------------------------------------------------------+            14300000
         SPACE 1                                                        14310000
         PUSH  USING                                                    14320000
BLD77WNG DS    0H                                                       14330000
         MVC   GRFCCW1(WNG77CPL),WNG77CP  Channel program               14340000
         MVC   GRFXBUFF(WNG77DSL),WNG77DS Data stream                   14350000
*                                                                       14360000
         LA    R1,WNG77DSL        Set data stream length                14370000
         STH   R1,GRFCCW2+6         into the write CCW                  14380000
         LA    R1,GRFXBUFF        Data stream goes here                 14390000
         STCM  R1,7,GRFCCW2+1     plug in CCW address                   14400000
         B     GOODEXIT                                                 14410000
         SPACE 1                                                        14420000
         POP   USING                                                    14430000
         SPACE 3                                                        14440000
*-------------------------------------------------------------          14450000
*        WNG (warning) Channel Program template                         14460000
*-------------------------------------------------------------          14470000
         SPACE 1                                                        14480000
WNG77CP  DS    0D                                                       14490000
         CCW   CCWSEL,0,SILI+CC,1       Select                          14500000
         CCW   CCWWRT,*-*,SILI,*-*      Write: WCC, etc                 14510000
WNG77CPL EQU   *-RDR77CP                                                14520000
         SPACE 1                                                        14530000
*-------------------------------------------------------------          14540000
*        Warning Data Stream template                                   14550000
*-------------------------------------------------------------          14560000
         SPACE 1                                                        14570000
WNG77DS  EQU   *                                                        14580000
         DC    AL1(WCCBEEP)                                             14590000
WNG77DSL EQU   *-WNG77DS                                                14600000
         TITLE 'HDKGRC:HDKGRCRL  (CP)  VM370CE: VIRTUAL MACHINE/370 COMX14610000
               MUNITY EDITION'                                          14620000
***************************************************************         14630000
*                                                                       14640000
* METHOD NAME -                                                         14650000
*                                                                       14660000
*        HDKGRCRL                                                       14670000
*                                                                       14680000
* FUNCTION -                                                            14690000
*                                                                       14700000
*        Release any RDEV resources used building 327x                  14710000
*        channel programs                                               14720000
*                                                                       14730000
* ENTRY CONDITIONS -                                                    14740000
*                                                                       14750000
*        R8  = Address of the RDEVBLOK                                  14760000
*        R10 = Address of the IOBLOK                                    14770000
*        R11 = Address of the user's VMBLOK                             14780000
*        R12 = Address of HDKGINIT entry point                          14790000
*        R13 = Address of standard SAVEAREA                             14800000
*                                                                       14810000
* EXIT CONDITIONS -                                                     14820000
*                                                                       14830000
*        R15 = 0 : All resources released                               14840000
*                                                                       14850000
***************************************************************         14860000
         SPACE 3                                                        14870000
HDKGRCRL RELOC ,                                                        14880000
         SPACE 3                                                        14890000
*-------------------------------------------------------------          14900000
*        Generate 327x channel programs and data streams                14910000
*-------------------------------------------------------------          14920000
         SPACE 1                                                        14930000
         ICM   R7,15,IOBCHPRG Get channel program addressing            14940000
         BZ    RLRETURN       not there.. nothing to do                 14950000
*                                                                       14960000
*        Release logo data buffer if there                              14970000
*                                                                       14980000
         ICM   R1,15,GRFBUFFA Is the logo buffer there?                 14990000
         BZ    NOGRFBUF       no, skip the step                         15000000
         LH    R0,GRFBUFFL    Get size in bytes                         15010000
         SRL   R0,3           ...      in wdords                        15020000
         CALL  DMKFRET        Release trhe storage                      15030000
*                                                                       15040000
NOGRFBUF DS    0H                                                       15050000
         LR    R1,R7          Finally, release the CCW area             15060000
         LA    R0,GRFCCWLD    ...                                       15070000
         CALL  DMKFRET        ...                                       15080000
         SR    R1,R1                                                    15090000
         ST    R1,IOBCHPRG    Clear IOBLOK field                        15100000
         SPACE 1                                                        15110000
RLRETURN DS    0H                                                       15120000
         EXIT  ,                                                        15130000
         TITLE 'HDKGRC           (CP)  VM370CE: VIRTUAL MACHINE/370 COMX15140000
               MUNITY EDITION'                                          15150000
         LTORG ,                                                        15160000
         EJECT ,                                                        15170000
         COPY  EQU                                                      15180000
         COPY  DEVTYPES                                                 15190000
         COPY  GRCWORK                                                  15200000
         COPY  HDK3270                                                  15210000
         COPY  VMBLOK                                                   15220000
         COPY  RBLOKS                                                   15230000
         COPY  GRFXBLOK                                                 15240000
         COPY  IOBLOKS                                                  15250000
         COPY  CONBUF                                                   15260000
         COPY  SAVE                                                     15270000
         COPY  TIMER                                                    15280000
         PSA                                                            15290000
         SPACE 3                                                        15300000
HDKGRC   CSECT ,                                                        15310000
         ORG   ,                                                        15320000
MODEND   DS    0D             *** Mark module's end ***                 15330000
         END                                                            15340000